[
  {
    "id": "1r5pz2p",
    "title": "What followed from Landsberg-Kaufering",
    "author": "Beard-and-Beyond",
    "score": 865,
    "url": "https://www.reddit.com/r/nosleep/comments/1r5pz2p/what_followed_from_landsbergkaufering/",
    "created_utc": 1771189393.0,
    "num_comments": 27,
    "word_count": 710,
    "body": "The humidity in Georgia usually smells like peaches and pine, but in my bedroom, it smells like scorched hair and wet ash.\n\nI’m eighty-four years old. My legs are thin as birch branches, and my eyes are clouded with cataracts, but I see them clearer than I see my own daughter. They don’t scream. That’s the worst part. They just stand in the corners of the room, their striped uniforms hanging off ribcages that look like birdcages.\n\nI first saw the boy in 1946, a year after I came home from the 101st Airborne. He was sitting at the foot of my bed, his eyes two hollow pits of ink. I thought it was \"shell shock.\" I thought if I married Rose and worked the hardware store for forty years, the boy would fade.\n\nInstead, he brought friends.\n\nNow, there are dozens. They crowd the hallway. When I walk to the kitchen, I have to pass through them. Their skin feels like cold, damp parchment against my arms. They follow me because I was there when the gates of Landsberg were kicked open. I saw the stacks of \"cordwood\" that were actually people. I smelled the sky when it turned gray with the soot of the ovens.\n\n\"I tried to save you,\" I whisper to the woman standing by my dresser. She has no teeth, and her fingernails are gone. \"We gave you our rations. We called for the medics.\"\n\nShe only stares, her jaw unhinged in a silent, eternal hollow.\n\nLately, the haunting has intensified. The house grows cold enough to see my breath, even in the July heat. My daughter, Martha, thinks I’m losing my mind.\n\n\"Dad, you're talking to the air again,\" she says, setting a tray of tea down. She walks right through the man with the shattered spectacles. He doesn't flinch.\n\n\"They won't leave, Martha,\" I croak. \"They want something. They’ve been waiting sixty years for me to give it to them.\"\n\nI feel the guilt like a stone in my gut. I lived. I had steak dinners, and a mortgage, and grandchildren. They got a ditch and a number. I’ve spent my life thinking they haunt me because I didn't do enough. Because I was a witness to a godless world and survived it.\n\nTonight, the air is thicker than usual. The smell of the ash is suffocating. The boy—the first one—crawls onto the edge of my mattress. His hand, nothing but bone and grey skin, reaches out.\n\n\"I'm sorry,\" I weep, the tears stinging my wrinkled cheeks. \"I'm so sorry I couldn't pull you all out in time.\"\n\nFor the first time in sixty years, the boy speaks. His voice isn't a whisper; it's a vibration in my very marrow.\n\n\"We aren't the ones who followed you home, Arthur.\"\n\nMy heart stutters. I look past the boy, toward the bedroom door. The crowd of prisoners—the starving, the broken, the ghosts I thought were my tormentors—suddenly shift. They aren't looking at me with malice.\n\nThey are looking at the doorway with terror.\n\nThey aren't haunting me. They are protecting me.\n\nFrom the shadows of the hallway, a different shape emerges. It’s taller, wearing a charcoal-grey coat with silver skulls on the lapels. Its face is a polished mask of cruelty, and it carries a heavy Luger that drips with ethereal blood.\n\nThe SS officer steps into the light of my bedside lamp. I remember him now. I remember the basement in that village. I remember the way he begged for his life before I lost my soul and pressed the barrel to his temple after he had already surrendered.\n\nThe ghosts of the camp survivors link their translucent arms, forming a wall between my bed and the man in the grey coat.\n\n\"You saved us at the gate,\" the boy whispers, his hollow eyes finally softening. \"So we stay. He’s been waiting for you to die since the day you pulled the trigger. We're just making sure that when you cross over, he doesn't get to catch you.\"\n\nThe officer lunges, but the woman with no teeth pushes him back with a silent, righteous fury. I close my eyes, the smell of ash fading, replaced by the faint, sweet scent of a Georgia peach."
  },
  {
    "id": "1qzmmkg",
    "title": "My airpods keep connecting to an unknown device, and I’m terrified by what I hear…",
    "author": "lets-split-up",
    "score": 563,
    "url": "https://www.reddit.com/r/nosleep/comments/1qzmmkg/my_airpods_keep_connecting_to_an_unknown_device/",
    "created_utc": 1770588932.0,
    "num_comments": 8,
    "word_count": 879,
    "body": "I bought these brand new airpods. Or… well, not *brand* new. Refurbished. New enough, anyway, that I wasn’t expecting them to be glitchy. They paired with my phone just fine. But once I was outside and starting my jog, the strains of creepy violins filled my ears.\n\nI suffered a minute or two of this and then took out the airpods. Looked at my phone but it was definitely my “Get Pumped” playlist.\n\nStill, the airpods refused to play anything but ambient horror-movie music. I resigned myself to a creepier run than usual, that chilling lofi sound giving me goosebumps even though the day around me was bright and sunny, melting some of the snow into dirty slush in the glistening streets.\n\nI was still jogging when suddenly the music amped up, the strains of the violins becoming loud and deafening. It hurt my ears. Just as I reached a crosswalk, the shriek of the violins merged with the blare of a truck’s horn. A semi-truck went screaming right in front of me, splashing me with icy water.\n\n“Asshole!” I shouted, flipping the driver off.\n\nThe music in my earbuds died back down to ambient lofi.\n\nAfter I got home, I took out the earbuds and changed my clothes. Showered, paired them with my phone again, and put them back in. This time I tried listening to a news podcast, but it was still just eerie music.\n\nIf anyone has any advice for how to get these things to unpair from this spooky soundtrack, reach out!\n\n\\*\\*\\*\n\nOK, I’ve had these glitchy airpods for about a week, and what I’ve realized is that it’s not just a generic horror movie soundtrack. The eerie music changes depending on what I’m doing. Almost as if it’s playing a literal soundtrack to my life.\n\nFor example, a few days ago while I was at a coffee shop waiting for my drink, the lofi music shifted to off-key strains of violins. The music got really loud, and someone grabbed my shoulder. I actually jumped. A literal jumpscare. When I turned around, it was just a woman behind me, who apologized and pointed out that I had dropped a card from my wallet while paying.\n\nI thanked her and, as I picked up my drink, the airpods chimed with a discordant note.\n\nI sat down at my table and put the drink down, trying to figure out what that chime meant. Then I picked up my cup again.\n\nThe discordant chime repeated.\n\nAs I raised the cup to my lips, the music veered off-key and the notes clashed unpleasantly. I sipped my hot cocoa.\n\nImmediately, I spat it out. I went up and complained and they checked the milk and yes, it was spoiled, even though it shouldn’t have been expired yet. They gave me a new drink and this time there was no discordant chime.\n\nI don’t know why the airpods play this weird soundtrack, but I can’t bring myself to stop wearing them. I can feel myself becoming addicted to the audio clueing me into events before they happen.\n\nGiven the airpods are refurbished, maybe their previous owner returned them because of this “glitch”?\n\n\\*\\*\\*\n\nI’ve learned most of the cues.\n\nLoud violins mean a jumpscare. Discordant chiming means something off. A low, dull tone means frustration, like trying to call someone but the line is busy. Just once I’ve heard a long, mournful horn—it was for a friend calling in tears to tell me about how they’d had to put their dog down.\n\nThere’s only *one* sound I haven’t figured out the cue for.\n\nIt’s a low, rhythmic percussion—almost like a heartbeat.\n\nOne time I heard it while I was lying in bed. The drumming heartbeat woke me out of a nap. Suddenly the percussion stopped and I heard a key slide into my front door lock. The lock rattled a little.\n\nProbably just a neighbor. My apartment building has five floors, and all have an identical layout, so maybe it was the person upstairs or below me who got off the elevator on the wrong floor.\n\nThe few other times it’s happened have all been in different locations and circumstances.\n\nI tried contacting the seller to find out who owned these airpods before they were refurbished. I got a reply back within 24-hours. But I knew from the dull tone in my ears as I opened the email that it would be disappointing—they said they had no information.\n\n\\*\\*\\*\n\nHelp!\n\nI'm in my closet.\n\nThat heartbeat sound has been going. And now it's SO LOUD—THUMPA-THUMPA-THUMPA—and it’s still going, raging like my pulse. I scrambled into my bedroom and into the closet and shut the door and texted my parents to call 911 because I can't risk making the call aloud, or making any sound. Because when I take the airpods out it is DEAD QUIET. And yet the music is so so SO loud, and it is getting louder—LOUDER!! The sound dialed up like right before the main character gets killed in a movie and now I can't stop thinking about the key jingling in my lock that one time and did I lock the door?? Shit shit shit there is a shadow outside my closet door shit\n\nPosting now"
  },
  {
    "id": "1qrihks",
    "title": "I was a 911 dispatcher. This is the most disturbing call I received on the job",
    "author": "HorrorJunkie123",
    "score": 310,
    "url": "https://www.reddit.com/r/nosleep/comments/1qrihks/i_was_a_911_dispatcher_this_is_the_most/",
    "created_utc": 1769808193.0,
    "num_comments": 9,
    "word_count": 649,
    "body": "Anyone who works in a call center has had at least one. Whether it’s the first traumatizing call or one that hit particularly close to home, we’ve all had a call that stuck with us. \n\nMine isn’t like the others. It was worse. Much worse. \n\nThis is the call that made me quit my job as a 911 dispatcher. \n\n“911, what is your emergency?” \n\nA woman answered, panicked. “Please, you have to help me. I think someone is in my house.” \n\n“Ma’am, what is your address?” \n\n… \n\n“Ma’am, what is your-”\n\n“Please hurry. I’m hiding in the closet. I can hear footsteps.” Her voice was little more than a whisper. \n\n“Ma’am, I need your address. If you could text-” \n\n“Shhh. He’ll hear you.” \n\nI paused, listening intently. \n\n…\n\n…\n\n“Lily H., N------ Elementary School, Class 2A.” \n\nI froze. The buzz of the world around me was drowned out as a deep-seated dread coursed through my body like venom.\n\nThat was my daughter’s information.\n\nIt took me a long time to find the words, but when I did, they practically spilled out of me. “Who are you?” \n\nI didn’t receive a response. The call ended immediately afterward. \n\nI threw down my headset and stormed past my supervisor, pale as a ghost. \n\n“Hey! Where are you going!” he shouted. \n\nI didn’t stick around to explain. I had to get home.  \n\n\\*\\*\\*\n\nI drove like a woman possessed all the way to my house. I kept turning over the caller’s words in my head. The woman. Who was she? \n\nI skidded to a stop in my driveway and made a beeline for the front door. I was fumbling with the key, trying to fit it into the lock, when I felt a cold hand on my shoulder. \n\n“Don’t turn around.” \n\nIt was the woman’s voice. \n\n“I know everything about you. Where you work, who your friends are, what you eat for breakfast in the morning.” I felt a long fingernail tracing the outside of my ear. Taunting me. Almost playful. \n\n“Tell anyone about that call and you *will* regret it.” She sliced her finger down my earlobe hard enough to draw blood. \n\nI winced. “Why? Why are you doing this to me? I don’t even know who you are.” \n\nThe woman’s breath was hot against my flesh. “You took something very precious from me. Now I’m going to take something precious from you.” \n\nThe hand lifted from my shoulder, but I was too frightened to move. I don’t know how long I stood there trembling, key halfway in the lock. \n\nWhen I finally gathered the courage to turn around, the woman was gone. \n\nI burst into the house and raced to my daughter’s bedroom. I threw open the door and flew over to her bed. \n\nI cannot describe the immense relief I felt when I found Lily lying under the blankets, fast asleep. \n\n\\*\\*\\*\n\nNothing happened for weeks afterward. I had informed the police and Lily’s school of the matter despite the woman’s threat, and they assured me that they would do everything in their power to keep me and my daughter safe. \n\nBut they failed. \n\nI received a call yesterday while hunting for jobs. It was Lily’s teacher. \n\n“Hello Mrs. H., this is Lily’s homeroom teacher. I’m calling to ask if you’ve picked up your daughter from recess today.” \n\nDread swallowed me like a python. My voice trembled as I gave my answer. “No, I haven’t. What happened? Where is my daughter?” \n\n“I’m sorry, Mrs. H, I really am. Lily, she… she never came back inside from recess. The police have been informed.” \n\nIn that moment, my entire world fell apart. I hung up the phone and I cried. \n\n\\*\\*\\*\n\nI know it was her. The woman. \n\nI don’t know who she is or what she wants, but now I can only pray that she brings my daughter back to me."
  },
  {
    "id": "1qon14q",
    "title": "I'm a Stealth Camper. Someone Was Standing Outside My Tent.",
    "author": "Hokons",
    "score": 245,
    "url": "https://www.reddit.com/r/nosleep/comments/1qon14q/im_a_stealth_camper_someone_was_standing_outside/",
    "created_utc": 1769540410.0,
    "num_comments": 0,
    "word_count": 540,
    "body": "It’s been two weeks since my van got totalled.\n\n\nI’m not gonna lie, that set me back; I’d been sleeping in the rear compartment. Don’t feel sorry for me, I’m the idiot who crashed it.\n\n\nAfter the accident, I had nowhere to sleep. Motel rates were double what I could afford, so I bought a cheap tent from BFC and hitched back to the lot where I used to park.\n\n\nI ended up in a flat section of woods by the Tookie River, past the McDonald’s on Ambridge Street.\n\n\nIt felt private without being secluded. There were public restrooms a short walk away, a 24-hour 7-Eleven, and just enough light from the nearby car park to make me feel like I wasn’t completely alone.\n\n\nTwo days in, dead in the middle of the night, I heard a shrill scream—like a hunter gutting a deer, only to find that it survived the initial buckshot.\n\n\nI wound up my hand-charged flashlight and exited the tent, aiming it from bushes to branches, and to the endless black that swallowed the gaps between the trees. The woods stayed silent after that—even the buzz of mosquitoes disappeared—but I stayed awake in my tent for an hour or so, straining my ears to hear what sounded like leaves crackling underfoot.\n\n\nThe next morning, as I was washing my work shirts in the Tookie River, a pink and grey sneaker washed ashore, caught in the reeds that lined the bank. I retrieved it and read the tag on the inside of the tongue: Woman's size 9.\n\n\nLots of things washed up in the river. Shoes, clothes, cardboard boxes and cartons of milk. I tossed the shoe back thinking it was another piece of junk.\n\n\nLater that night I was eating a Big Mac from the Ambridge Street McDonald's, hugging my knees to my chest and trying to keep warm. Outside, the leaves began crunching again. I thought maybe a deer had smelt my food or noticed my camping light and came to investigate.\n\n\nI unzipped my tent and went walking into the woods, following the sound. Whatever made the sound wasn't disturbed by my movement and kept creeping from tree to tree. My torch light started to stutter, and I stopped to wind the lever and boost the charge.\n\n\nThe light turned back on.\n\n\nAhead of me, something ducked behind a tree.\n\n\nI froze, aiming the flashlight where I'd seen the face.\n\n\nAn animal would have scurried away. Dashed off into the thickets to escape the human presence.\n\n\nThe light started flicking again. I tilted it down to wind the lever—\n\n\nFootsteps.\n\n\nDisguising themselves amongst the *click-click-click* of the wind-up torch.\n\n\nI turned on my feet, sliding on the loose leaves—the torch tumbling from my grip, and I zig-zagged between trees and rocks, sprinting back to the tent.\n\n\nI zipped myself inside and waited.\n\n\nI had no tools—no bear spray, no torch. Nothing to defend myself with.\n\n\nI switched off the camping light and sat in the darkness, letting my ears work to their full breadth. The night went silent again—as still as the surface of water.\n\n\nNo bugs. Not even the crunch of leaves.\n\n\nNothing.\n\n\nExcept for one sound.\n\n\nWind, blowing gently against my tent.\n\n\nBreathing."
  },
  {
    "id": "1qni6x2",
    "title": "I Grew Up in a House Where No One Remembered I Was There. Then I Met the Boy Who Made Sure I Never Forgot.",
    "author": "SlowAbbreviations517",
    "score": 223,
    "url": "https://www.reddit.com/r/nosleep/comments/1qni6x2/i_grew_up_in_a_house_where_no_one_remembered_i/",
    "created_utc": 1769439322.0,
    "num_comments": 2,
    "word_count": 854,
    "body": "I Was Forgotten My Whole Childhood. Something Noticed.\n\nI don’t talk about my childhood much because when I do, people start forgetting things.\n\nSmall things at first. Appointments. Names. Faces they swear they just saw.\nIt’s worse if they listen too closely.\n\nLately, I can’t sleep. And every time I close my eyes, I hear breathing that isn’t mine — slow, careful, matching me. I need to get this out before it takes something else.\n\nMy name doesn’t matter. I was the youngest of four, living in a small house on the south side of Chicago. From the street, it looked normal. Inside, it felt wrong — like the house didn’t expect you to stay. Paint peeled. Floors creaked even when no one moved. The air stayed heavy, no matter how wide the windows were.\n\nMy parents were technically there. Dad worked until he came home angry. Mom forgot things — keys, dates, dinner, sometimes that she even had kids. My older sister Liz made lists that never got finished. My little sister Maggie drew houses with too many windows and people too small inside them.\n\nAnd then there was James. My older brother. The only one who noticed me on purpose.\n\nJames taught me how to disappear safely. How to breathe when the house got loud. He’d slow his breathing until I matched it. In through the nose. Out slower. He said waiting was better than being wrong. That if you stayed still long enough, people stopped being angry — and sometimes stopped noticing you at all.\n\nApril 4th, 1991. I was eight. James packed a bag in the middle of the night. Kissed Maggie’s forehead. Waved at Liz. Put his hand on my head for one second. His fingers shook. He promised he’d come back.\n\nThree weeks later, the police came. They used careful words. Tunnel. Accident. River Road. They said boys run away. They said the tunnel was dangerous. They said it wasn’t my place to ask questions.\n\nAfter that, no one talked about James again.\n\nThe house got quieter. Sharper. Like it was listening for him to come back.\n\nI did what James taught me. Walk soft. Breathe small. Don’t remind anyone I’m there.\n\nIt worked too well.\n\nAt school, teachers looked through me. At home, plates were set for three kids instead of four. Sometimes I sat at the table and no one noticed I hadn’t eaten. I stopped asking for things. It felt safer.\n\nThat’s when they sent me to St. Mary’s Home for Boys.\n\nThe orphanage smelled like bleach and dust. The clocks didn’t match. The lights buzzed. Beds were packed too close together. Mrs. Kimber ran the place. She checked her watch before she spoke, like time owed her money.\n\n“You’ll settle in,” she said. “Boys always do.”\n\nThe first night, I lay awake listening to the others sleep. Some cried quietly. Some snored. I counted breaths.\n\nThen the mattress dipped.\n\nA hand grabbed my collar and yanked me forward. Pain flashed white. A boy my age leaned over me, face half-shadowed, eyes flat.\n\n“Don’t make noise,” he whispered.\n\nHe hit me once. Then again. Not hard enough to kill me. Hard enough to teach me something.\n\n“You don’t get to be quiet here,” he said. “Quiet makes people look.”\n\nIn the morning, Mrs. Kimber called it a nightmare. The nurse wrapped my head. Asked who did it. I said I didn’t know.\n\nBecause naming things makes them real.\nAnd real things grow.\n\nAfter that, four boys started sitting near me. Gage. Redd. Dax. Cole. Loud boys. Smiling boys. They shared snacks. Told jokes. Pretended to notice me.\n\nGage suggested a game.\n\nThe tunnels under the city.\n\nI said yes.\n\nWe went at night. Flashlights. Wet concrete. Rust. Echoes that bounced wrong. Gage stopped deep inside and told me to close my eyes. Count to one hundred.\n\nWhen I opened them, they were gone.\n\nThe flashlight flickered on the ground. Their laughter echoed — then stopped. I ran. Fell. Cut myself on rails and stone. The tunnel twisted. I couldn’t tell which way was out. Eventually I stopped calling and started listening.\n\nThat’s when I heard breathing.\n\nSlow. Careful. Matching mine.\n\nA boy stood at the edge of the light. Eight years old. Pale. Blonde hair dirty at the tips. White shirt. Navy jumper. Red sneakers. Blue eyes too wide.\n\nI asked who he was.\n\nHe didn’t answer.\n\nHe stepped closer.\n\nI ran until I found light and crawled out. Ambulances. Questions. Punishment. Blame. No one listened.\n\nI disappeared a week later. Just walked away. The missing poster went up. Then came down.\n\nNow I drive at night when I can’t sleep.\n\nSometimes I see him in the rearview mirror. Same clothes. Same eyes. Breathing slow. Matching me.\n\nI don’t look for long.\n\nBecause when I do, people around me start forgetting things. Memories slip. Faces blur. And the longer I look —\n\nthe more he starts to look like me.\n\nIf you’re driving through Chicago at night and feel someone breathing in your backseat, don’t turn around.\n\nJust keep driving.\nAnd don’t breathe too fast."
  },
  {
    "id": "1qrin7q",
    "title": "I recorded myself sleep talking and regret it.",
    "author": "PNWCartoboi",
    "score": 176,
    "url": "https://www.reddit.com/r/nosleep/comments/1qrin7q/i_recorded_myself_sleep_talking_and_regret_it/",
    "created_utc": 1769808546.0,
    "num_comments": 4,
    "word_count": 626,
    "body": "I sleep talk.  A lot.  I know that I sleep talk a lot because when I wake up in the morning my wife’s first words of her mouth are “You were talking again last night, this time it was about trying to cross a bridge made of rubber or something.”  Most of the time it’s harmless stuff like that, nonsensical ramblings said with utmost urgency.  \n\nEvery once in a while, especially after I’ve experienced something really stressful I’ll get night terrors, meaning that I sleep talk with body movements as well.  One time I was dreaming we were in an avalanche and in the middle of the night I threw myself on top of my wife screaming “WATCH OUT FOR THE SNOW.”  Needless to say she was not thrilled that I woke her up, even if it was for the right reasons.  Other times it was more serious, like I dreamed there was an intruder and so jumped out from underneath the covers, yelling “GET OUT GET OUT GET OUT.”\n\nI’m sure by now you can tell that my wife’s sleep is not the most consistent and it’s kind of my fault, at least partially.  People get mean when they’re sleep deprived and it started to become an issue in our marriage.  How can you get mad at someone’s unconscious thoughts?  After a couple weeks I agreed to go to a sleep specialist and try to find a solution.  To my surprise sleep therapy was very similar to regular therapy, including talking through problems, dream journaling, mindfulness meditation, etc.  \n\nHowever, the one thing that was different versus regular therapy is that my therapist asked me to use an app to record myself when I sleep.  The idea is that in addition to tracking your diet and caffeine intake, the app turns up your phone’s microphone sensitivity to record any talking, moving, snoring, etc.  After a couple weeks the app said that it should be able to give me insights into what is giving me night terrors.  Up until last night the data collection was going really well.  \n\nI went through my usual bedtime routine.  Brushed my teeth, flossed, put in my night guard, plugged in my phone and started reading my book to drift off to sleep.  My phone is automatically set to always record between 10pm and 7 am, and as long as the speaker is pointed near my head it has no problem picking up what I say.  \n\nThe next morning I noticed that my phone has a lot more snippets of talking than usual.  The first clip is the sound of me rolling over.  The next one is a sample of my wife’s snoring.  The third was me.\n\n“Mmmm no I don’t trust that one it’s going to explode,” I mumbled.  The fourth one was also me, “Nonononono I don’t think that’s right.”\n\nThe fifth snippet was a voice I did not recognize. It was hard to make anything out but it was low, deep and gravely, humming a tune I could not place.  I listened to it over and over again to make sure and everytime the humming voice came through crystal clear.\n\nMy wife thinks it might have been me doing a character voice from my D&amp;D game but I have never done that in any of my previous sleep talking episodes and I can’t make my voice sound baritone and gravely.  I’m not really sure how else to explain it but needless to say, I’m going to be extra sure that my phone is recording again tonight.  I know it’s probably nothing but I can’t shake this feeling that something is wrong.  I have this feeling like I am anticipating that I am going to be watched while I sleep."
  }
]