[
  {
    "id": "1r5pz2p",
    "subreddit": "nosleep",
    "title": "What followed from Landsberg-Kaufering",
    "author": "Beard-and-Beyond",
    "score": 907,
    "url": "https://www.reddit.com/r/nosleep/comments/1r5pz2p/what_followed_from_landsbergkaufering/",
    "created_utc": 1771189393.0,
    "num_comments": 27,
    "word_count": 710,
    "body": "The humidity in Georgia usually smells like peaches and pine, but in my bedroom, it smells like scorched hair and wet ash.\n\nI’m eighty-four years old. My legs are thin as birch branches, and my eyes are clouded with cataracts, but I see them clearer than I see my own daughter. They don’t scream. That’s the worst part. They just stand in the corners of the room, their striped uniforms hanging off ribcages that look like birdcages.\n\nI first saw the boy in 1946, a year after I came home from the 101st Airborne. He was sitting at the foot of my bed, his eyes two hollow pits of ink. I thought it was \"shell shock.\" I thought if I married Rose and worked the hardware store for forty years, the boy would fade.\n\nInstead, he brought friends.\n\nNow, there are dozens. They crowd the hallway. When I walk to the kitchen, I have to pass through them. Their skin feels like cold, damp parchment against my arms. They follow me because I was there when the gates of Landsberg were kicked open. I saw the stacks of \"cordwood\" that were actually people. I smelled the sky when it turned gray with the soot of the ovens.\n\n\"I tried to save you,\" I whisper to the woman standing by my dresser. She has no teeth, and her fingernails are gone. \"We gave you our rations. We called for the medics.\"\n\nShe only stares, her jaw unhinged in a silent, eternal hollow.\n\nLately, the haunting has intensified. The house grows cold enough to see my breath, even in the July heat. My daughter, Martha, thinks I’m losing my mind.\n\n\"Dad, you're talking to the air again,\" she says, setting a tray of tea down. She walks right through the man with the shattered spectacles. He doesn't flinch.\n\n\"They won't leave, Martha,\" I croak. \"They want something. They’ve been waiting sixty years for me to give it to them.\"\n\nI feel the guilt like a stone in my gut. I lived. I had steak dinners, and a mortgage, and grandchildren. They got a ditch and a number. I’ve spent my life thinking they haunt me because I didn't do enough. Because I was a witness to a godless world and survived it.\n\nTonight, the air is thicker than usual. The smell of the ash is suffocating. The boy—the first one—crawls onto the edge of my mattress. His hand, nothing but bone and grey skin, reaches out.\n\n\"I'm sorry,\" I weep, the tears stinging my wrinkled cheeks. \"I'm so sorry I couldn't pull you all out in time.\"\n\nFor the first time in sixty years, the boy speaks. His voice isn't a whisper; it's a vibration in my very marrow.\n\n\"We aren't the ones who followed you home, Arthur.\"\n\nMy heart stutters. I look past the boy, toward the bedroom door. The crowd of prisoners—the starving, the broken, the ghosts I thought were my tormentors—suddenly shift. They aren't looking at me with malice.\n\nThey are looking at the doorway with terror.\n\nThey aren't haunting me. They are protecting me.\n\nFrom the shadows of the hallway, a different shape emerges. It’s taller, wearing a charcoal-grey coat with silver skulls on the lapels. Its face is a polished mask of cruelty, and it carries a heavy Luger that drips with ethereal blood.\n\nThe SS officer steps into the light of my bedside lamp. I remember him now. I remember the basement in that village. I remember the way he begged for his life before I lost my soul and pressed the barrel to his temple after he had already surrendered.\n\nThe ghosts of the camp survivors link their translucent arms, forming a wall between my bed and the man in the grey coat.\n\n\"You saved us at the gate,\" the boy whispers, his hollow eyes finally softening. \"So we stay. He’s been waiting for you to die since the day you pulled the trigger. We're just making sure that when you cross over, he doesn't get to catch you.\"\n\nThe officer lunges, but the woman with no teeth pushes him back with a silent, righteous fury. I close my eyes, the smell of ash fading, replaced by the faint, sweet scent of a Georgia peach."
  },
  {
    "id": "1rc2szn",
    "subreddit": "scarystories",
    "title": "Today, my son broke character at the breakfast table.",
    "author": "Trash_Tia",
    "score": 667,
    "url": "https://www.reddit.com/r/scarystories/comments/1rc2szn/today_my_son_broke_character_at_the_breakfast/",
    "created_utc": 1771806956.0,
    "num_comments": 23,
    "word_count": 988,
    "body": "He wasn’t acting like himself.\n\nHe wasn’t fighting with his siblings, who were unusually quiet.\n\nCallie sat silently, pushing her breakfast around her plate. \n\nThere was no brutal fight to the death over the bathroom. \n\nNo constant bickering about cereal. \n\nZach wasn’t kicking his siblings under the table to start arguments.\n\nAnd I didn’t have to shout once.\n\nIt was far *too* quiet.\n\n“Jonas.” I spoke up, looking up from my iPad. It was *too* quiet. \n\nWhich meant my children were either sick, or something was brewing. \n\nJonas, my eldest at sixteen, was usually the instigator. \n\nBut he couldn't even look me in the eye. \n\n“What's going on?” I set down my iPad, and across the table, Zach flinched, gaze glued to his bowl of untouched cereal. \n\nCallie ducked her head, thick brown strands hanging in her face. \n\nI knew this stance. \n\nI knew my children. Too quiet, and *guilty.* Just like five years ago when they shattered my Mom’s vase playing The Floor is Lava. \n\nThey'd *broken* something.\n\nI sighed, noticing the atmosphere. Jonas and Zach were clearly trying to stay silent, and Callie was one squeak away from singing like a canary. “All right, as long as it's not your grandfather’s urn, I don't care what you've broken, as long as you fix it.” \n\n“Dad’s hurting us.” \n\nAt first, I didn't even hear my son. I was too busy reaching across the table and grabbing maple syrup for my pancakes. \n\nBut then he said it *again*, stabbing his fork through his breakfast. His voice choked up. “Dads *hurting* us.” \n\nZach’s head snapped up, narrowed eyes glued to his brother. Frightened. \n\n“What are you *doing*?!” He hissed. Zach straightened up with a tense smile. “It's okay, Mom! Jonas is just—”\n\n“He's *hurting* us.” Jonas whispered, curling into himself. His eyes found mine. Hollow. Broken. How did I not notice? How did I not see the shadows under his eyes? \n\nThe agony creased between his brows? \n\n“I'm not staying silent anymore,” he whispered. “You two can. But I'm not.” \n\nJonas glared down at the table. “I… I fucking *can't* do this anymore.\" \n\nHe broke into sobs that immediately broke my heart. \n\nI stood and aimed to wrap my arms around my son, but the second I touched him, he flinched away, eyes wide, almost feral. \n\nHe shoved me back, diving to his feet.  “No, get away… get away from me!”\n\nIgnoring him, I wrapped my arms around him, and after fighting me, screaming and sobbing at me to get away, he melted into my shoulder, sniffling. \n\nI stayed very calm, but my chest was aching. \n\nI pulled away from the hug, trying to smile. \n\n“Show me.” I said, steadying my voice. \n\nI couldn't scream. If I showed my children I was scared, I would scare *them*. \n\n“Mom—” Callie spoke up.\n\n“Callie, stay here.” I said. “You too, Zach.” I turned to my son. \n\n“Tell me everything, okay? Everything, sweetheart.” I grasped his shoulders. “I'm not mad, and I promise I *believe* you.”\n\nJonas nodded, and ran upstairs.\n\nI followed him on shaky legs, my heart in my throat.\n\nJonas led me inside his room he shared with Zach. \n\n“When you go to bed, Dad comes in our room and makes sure we’re restrained,” Jonas lifted up his pillows, and there, looped around his bed frame, were chains. \n\nJonas turned to face me. “Ever since we tried to run, he's chained us to our beds.”\n\n“You tried to run *away*?” I choked out. “Why—”\n\nThick bile crawled up my throat when my son stepped in front of me, his expression crumpled. “Mom,” he whispered. “There's something…. I need to tell you.” Jonas grasped my shoulders, his nails digging in. \n\nHarsh. “But you can't freak out, all right? You can't call Dad. Just *listen* to me.” \n\nI nodded, breathless, as he took my hand and led me back downstairs.\n\n“Five years ago, a man approached me on the street in LA. I was fifteen, and trying to be an actor,” he said, leading me out into the back yard. “He said I would be paid in full every week. Five hundred dollars. For one simple job.” Jonas let go of my hand. \n\n“And all I had to do was… pretend to be your son. Jonas.” \n\nJonas’s hand slipped from mine. “But then he *stopped* paying us,” he whispered. \n\n“We tried to leave. Tried to call the cops, but he was forceful. He punched Zach in the face, and drugged our drinks at night. He started chaining us up when you weren't here— and now, we're prisoners.\"\n\nHe sputtered. “I'm not even from here! I’m from Texas. I ran away to LA because I *thought* I wanted to be an actor. But I’m done playing a fucking dead *kid*.” \n\nJonas ducked his head. \n\n“We just want to go home, Mrs McCarthy.”\n\nJonas shook his head. “Mom.” He corrected himself.\n\n“So, we’re going to go.” Zach’s voice startled me. \n\nHe was standing behind me, grasping hold of Callie’s hand.\n\n“I'm sorry for your loss,” he whispered. “But we’re *not* your children.” He nodded at Jonas. “Get your shit, Jack. We’re going.”\n\nJonas nodded. He gave me a quick hug. \n\n“Thank you for saving us,” he said. “And I’m sorry for your loss, Mrs McCarthy.”\n\nI stood, numb, as the three of them started toward the fence. \n\nAnd I was reaching into my jeans, and pulling out my gun.\n\nSomething inside me exploded, and I let out a shriek of laughter.\n\nI started forwards, pressing the gun into my sweet daughter’s head.\n\n“Stupid kids,” I spoke through gritted teeth. \n\nI wasn't losing them *again*. I buried my children once.\n\nNever again.\n\n“Your father ran the auditions,” I said, clicking off the safety. I lowered the barrel to Callie’s calf. “Run, and I’ll cut off your legs.”\n\nThey froze, and I took pleasure in my next words, “But who do you think *chose* you?”"
  },
  {
    "id": "1rceiqe",
    "subreddit": "nosleep",
    "title": "I'm a wildlife acoustics researcher. Since the comet appeared, every animal on Earth has gone silent. I think I know why.",
    "author": "UntitledDoc1",
    "score": 326,
    "url": "https://www.reddit.com/r/nosleep/comments/1rceiqe/im_a_wildlife_acoustics_researcher_since_the/",
    "created_utc": 1771844551.0,
    "num_comments": 10,
    "word_count": 931,
    "body": "I don't know who else to tell this to. My university won't return my emails. My research partner won't pick up her phone anymore. So I'm posting here because someone needs to know what's happening.\n\nMy name doesn't matter. I work in wildlife acoustics — basically I record the sounds animals make and analyze the data. Bird calls, whale songs, insect noise, all of it. I've been doing this for seven years across three continents. I know what the natural world sounds like.\n\nAnd right now it sounds like nothing.\n\n**Two weeks ago**\n\nIt started small. I was running a field recording session from the back of our Land Rover — headphones on, spectrograph open on my laptop. Usually the screen looks like a mess of jagged peaks. Cicadas screaming at 4kHz, scrub-wrens doing their thing, the constant hum of everything alive around you.\n\nThe screen was flat.\n\nI checked the cables. Swapped the mic. Rebooted everything. Maren — my research partner — told me it was the humidity wrecking the equipment. Or the batteries cycling. She was mapping the trajectory of that comet, C/2024-V1. The one that's been smearing itself across the daytime sky for weeks now.\n\n\"Batteries are fine,\" I whispered. And I didn't know why I was whispering. Everything just felt — filtered. Like someone had turned the world's volume down by half and I was the only one who noticed.\n\n**Eight days later**\n\nThe email from Monterey Bay Aquatic Research Institute was three words long.\n\n*The whales stopped.*\n\nI read it twice. No breaching. No clicking. No song. Five thousand miles of Pacific Ocean had just gone quiet. Like someone hit mute.\n\nAnd it wasn't just them. Every field station on the planet started reporting the same thing within days. The Bio-Acoustic Index — which is basically a measure of how much sound living things are producing — wasn't dropping. It was flatlining.\n\nMaren suggested atmospheric pressure from the comet's tail. She didn't sound like she believed it. She was scrolling the news on her phone. Every headline was about the \"Celestial Guest\" but the smaller stories underneath were starting to mention the quiet. People in cities noticing their dogs had stopped barking. Not less barking. No barking. At all.\n\nI started paying attention to the comet after that.\n\n**Four weeks in**\n\nThe comet is a jagged white scar now. Bright enough to cast shadows at midnight. That alone should be getting more attention than it is.\n\nI walked into the meadow behind our research station with a parabolic mic — gold standard for long-range capture. Pointed it at a rotting log. The kind that's usually crawling with beetles making that frantic microscopic static of legs on bark and chitin grinding together.\n\nNothing.\n\nThey were there though. I could see them through my magnifying glass. Thousands of beetles just — frozen. Not dead. Their antennae twitched with this slow deliberate rhythm like they were trying not to be noticed.\n\nThey were waiting. All of them. Waiting for something.\n\nThe silence wasn't just absence. I need you to understand that. It was a choice. A collective global decision to become invisible. Every living thing on this planet decided at the same time to shut up and I can't get anyone to talk about why.\n\nI looked over at Maren. She was standing by the Rover with her keys in her hand staring straight up at the sky. She opened her mouth to say something — probably another theory, another coincidence — and then she just stopped. Swallowed hard. The sound of her throat was like a gunshot in that silence.\n\nShe looked ashamed. Of swallowing. Of making a sound.\n\nThat's when I knew this wasn't equipment failure.\n\n**Two days ago**\n\nThe sun went down but the sky didn't go dark. It turned this bruised electric violet. I stepped out onto the porch of the station.\n\nAnd it hit me.\n\nThe horror isn't the comet. The horror is whatever the animals are hiding from. Something so vast and so sensitive to vibration that the only survival strategy left is to stop existing in the acoustic world entirely.\n\nThe birds figured it out. The whales figured it out. The beetles figured it out. Even the ants figured it out.\n\nI felt a vibration through my boots. Low. Subsonic. The kind you feel in your teeth more than you hear. It wasn't the comet entering the atmosphere.\n\nIt was the comet looking.\n\nI can't explain why that's the word that came to mind but it's the only one that fits.\n\nMy own heartbeat sounded obscenely loud. Like a neon sign blinking in the dark. HERE I AM. HERE I AM. HERE I AM.\n\nEvery other creature on this planet had the instinct to go silent. Every single one. Billions of years of evolution screaming at them to hide. And it worked.\n\nWe're the only ones still making noise. Still talking. Still broadcasting. Too loud and too oblivious to realize that something out there is finally listening.\n\n**Now**\n\nMaren left yesterday. Didn't say where. Didn't say goodbye. Just got in the Rover and drove. I don't blame her.\n\nThe comet is bigger tonight. The violet is deeper. I can feel the vibration in the floor of the station now. Constant. Rhythmic.\n\nI'm typing this with the lights off. I don't know if that helps. I don't know if anything helps. But every instinct in my body is telling me to be quiet and small and still.\n\nI think I'm going to listen to that instinct now.\n\nI think it's the correct response."
  },
  {
    "id": "1qrihks",
    "subreddit": "nosleep",
    "title": "I was a 911 dispatcher. This is the most disturbing call I received on the job",
    "author": "HorrorJunkie123",
    "score": 314,
    "url": "https://www.reddit.com/r/nosleep/comments/1qrihks/i_was_a_911_dispatcher_this_is_the_most/",
    "created_utc": 1769808193.0,
    "num_comments": 9,
    "word_count": 649,
    "body": "Anyone who works in a call center has had at least one. Whether it’s the first traumatizing call or one that hit particularly close to home, we’ve all had a call that stuck with us. \n\nMine isn’t like the others. It was worse. Much worse. \n\nThis is the call that made me quit my job as a 911 dispatcher. \n\n“911, what is your emergency?” \n\nA woman answered, panicked. “Please, you have to help me. I think someone is in my house.” \n\n“Ma’am, what is your address?” \n\n… \n\n“Ma’am, what is your-”\n\n“Please hurry. I’m hiding in the closet. I can hear footsteps.” Her voice was little more than a whisper. \n\n“Ma’am, I need your address. If you could text-” \n\n“Shhh. He’ll hear you.” \n\nI paused, listening intently. \n\n…\n\n…\n\n“Lily H., N------ Elementary School, Class 2A.” \n\nI froze. The buzz of the world around me was drowned out as a deep-seated dread coursed through my body like venom.\n\nThat was my daughter’s information.\n\nIt took me a long time to find the words, but when I did, they practically spilled out of me. “Who are you?” \n\nI didn’t receive a response. The call ended immediately afterward. \n\nI threw down my headset and stormed past my supervisor, pale as a ghost. \n\n“Hey! Where are you going!” he shouted. \n\nI didn’t stick around to explain. I had to get home.  \n\n\\*\\*\\*\n\nI drove like a woman possessed all the way to my house. I kept turning over the caller’s words in my head. The woman. Who was she? \n\nI skidded to a stop in my driveway and made a beeline for the front door. I was fumbling with the key, trying to fit it into the lock, when I felt a cold hand on my shoulder. \n\n“Don’t turn around.” \n\nIt was the woman’s voice. \n\n“I know everything about you. Where you work, who your friends are, what you eat for breakfast in the morning.” I felt a long fingernail tracing the outside of my ear. Taunting me. Almost playful. \n\n“Tell anyone about that call and you *will* regret it.” She sliced her finger down my earlobe hard enough to draw blood. \n\nI winced. “Why? Why are you doing this to me? I don’t even know who you are.” \n\nThe woman’s breath was hot against my flesh. “You took something very precious from me. Now I’m going to take something precious from you.” \n\nThe hand lifted from my shoulder, but I was too frightened to move. I don’t know how long I stood there trembling, key halfway in the lock. \n\nWhen I finally gathered the courage to turn around, the woman was gone. \n\nI burst into the house and raced to my daughter’s bedroom. I threw open the door and flew over to her bed. \n\nI cannot describe the immense relief I felt when I found Lily lying under the blankets, fast asleep. \n\n\\*\\*\\*\n\nNothing happened for weeks afterward. I had informed the police and Lily’s school of the matter despite the woman’s threat, and they assured me that they would do everything in their power to keep me and my daughter safe. \n\nBut they failed. \n\nI received a call yesterday while hunting for jobs. It was Lily’s teacher. \n\n“Hello Mrs. H., this is Lily’s homeroom teacher. I’m calling to ask if you’ve picked up your daughter from recess today.” \n\nDread swallowed me like a python. My voice trembled as I gave my answer. “No, I haven’t. What happened? Where is my daughter?” \n\n“I’m sorry, Mrs. H, I really am. Lily, she… she never came back inside from recess. The police have been informed.” \n\nIn that moment, my entire world fell apart. I hung up the phone and I cried. \n\n\\*\\*\\*\n\nI know it was her. The woman. \n\nI don’t know who she is or what she wants, but now I can only pray that she brings my daughter back to me."
  },
  {
    "id": "1qon14q",
    "subreddit": "nosleep",
    "title": "I'm a Stealth Camper. Someone Was Standing Outside My Tent.",
    "author": "Hokons",
    "score": 248,
    "url": "https://www.reddit.com/r/nosleep/comments/1qon14q/im_a_stealth_camper_someone_was_standing_outside/",
    "created_utc": 1769540410.0,
    "num_comments": 0,
    "word_count": 540,
    "body": "It’s been two weeks since my van got totalled.\n\n\nI’m not gonna lie, that set me back; I’d been sleeping in the rear compartment. Don’t feel sorry for me, I’m the idiot who crashed it.\n\n\nAfter the accident, I had nowhere to sleep. Motel rates were double what I could afford, so I bought a cheap tent from BFC and hitched back to the lot where I used to park.\n\n\nI ended up in a flat section of woods by the Tookie River, past the McDonald’s on Ambridge Street.\n\n\nIt felt private without being secluded. There were public restrooms a short walk away, a 24-hour 7-Eleven, and just enough light from the nearby car park to make me feel like I wasn’t completely alone.\n\n\nTwo days in, dead in the middle of the night, I heard a shrill scream—like a hunter gutting a deer, only to find that it survived the initial buckshot.\n\n\nI wound up my hand-charged flashlight and exited the tent, aiming it from bushes to branches, and to the endless black that swallowed the gaps between the trees. The woods stayed silent after that—even the buzz of mosquitoes disappeared—but I stayed awake in my tent for an hour or so, straining my ears to hear what sounded like leaves crackling underfoot.\n\n\nThe next morning, as I was washing my work shirts in the Tookie River, a pink and grey sneaker washed ashore, caught in the reeds that lined the bank. I retrieved it and read the tag on the inside of the tongue: Woman's size 9.\n\n\nLots of things washed up in the river. Shoes, clothes, cardboard boxes and cartons of milk. I tossed the shoe back thinking it was another piece of junk.\n\n\nLater that night I was eating a Big Mac from the Ambridge Street McDonald's, hugging my knees to my chest and trying to keep warm. Outside, the leaves began crunching again. I thought maybe a deer had smelt my food or noticed my camping light and came to investigate.\n\n\nI unzipped my tent and went walking into the woods, following the sound. Whatever made the sound wasn't disturbed by my movement and kept creeping from tree to tree. My torch light started to stutter, and I stopped to wind the lever and boost the charge.\n\n\nThe light turned back on.\n\n\nAhead of me, something ducked behind a tree.\n\n\nI froze, aiming the flashlight where I'd seen the face.\n\n\nAn animal would have scurried away. Dashed off into the thickets to escape the human presence.\n\n\nThe light started flicking again. I tilted it down to wind the lever—\n\n\nFootsteps.\n\n\nDisguising themselves amongst the *click-click-click* of the wind-up torch.\n\n\nI turned on my feet, sliding on the loose leaves—the torch tumbling from my grip, and I zig-zagged between trees and rocks, sprinting back to the tent.\n\n\nI zipped myself inside and waited.\n\n\nI had no tools—no bear spray, no torch. Nothing to defend myself with.\n\n\nI switched off the camping light and sat in the darkness, letting my ears work to their full breadth. The night went silent again—as still as the surface of water.\n\n\nNo bugs. Not even the crunch of leaves.\n\n\nNothing.\n\n\nExcept for one sound.\n\n\nWind, blowing gently against my tent.\n\n\nBreathing."
  },
  {
    "id": "1qni6x2",
    "subreddit": "nosleep",
    "title": "I Grew Up in a House Where No One Remembered I Was There. Then I Met the Boy Who Made Sure I Never Forgot.",
    "author": "SlowAbbreviations517",
    "score": 228,
    "url": "https://www.reddit.com/r/nosleep/comments/1qni6x2/i_grew_up_in_a_house_where_no_one_remembered_i/",
    "created_utc": 1769439322.0,
    "num_comments": 2,
    "word_count": 854,
    "body": "I Was Forgotten My Whole Childhood. Something Noticed.\n\nI don’t talk about my childhood much because when I do, people start forgetting things.\n\nSmall things at first. Appointments. Names. Faces they swear they just saw.\nIt’s worse if they listen too closely.\n\nLately, I can’t sleep. And every time I close my eyes, I hear breathing that isn’t mine — slow, careful, matching me. I need to get this out before it takes something else.\n\nMy name doesn’t matter. I was the youngest of four, living in a small house on the south side of Chicago. From the street, it looked normal. Inside, it felt wrong — like the house didn’t expect you to stay. Paint peeled. Floors creaked even when no one moved. The air stayed heavy, no matter how wide the windows were.\n\nMy parents were technically there. Dad worked until he came home angry. Mom forgot things — keys, dates, dinner, sometimes that she even had kids. My older sister Liz made lists that never got finished. My little sister Maggie drew houses with too many windows and people too small inside them.\n\nAnd then there was James. My older brother. The only one who noticed me on purpose.\n\nJames taught me how to disappear safely. How to breathe when the house got loud. He’d slow his breathing until I matched it. In through the nose. Out slower. He said waiting was better than being wrong. That if you stayed still long enough, people stopped being angry — and sometimes stopped noticing you at all.\n\nApril 4th, 1991. I was eight. James packed a bag in the middle of the night. Kissed Maggie’s forehead. Waved at Liz. Put his hand on my head for one second. His fingers shook. He promised he’d come back.\n\nThree weeks later, the police came. They used careful words. Tunnel. Accident. River Road. They said boys run away. They said the tunnel was dangerous. They said it wasn’t my place to ask questions.\n\nAfter that, no one talked about James again.\n\nThe house got quieter. Sharper. Like it was listening for him to come back.\n\nI did what James taught me. Walk soft. Breathe small. Don’t remind anyone I’m there.\n\nIt worked too well.\n\nAt school, teachers looked through me. At home, plates were set for three kids instead of four. Sometimes I sat at the table and no one noticed I hadn’t eaten. I stopped asking for things. It felt safer.\n\nThat’s when they sent me to St. Mary’s Home for Boys.\n\nThe orphanage smelled like bleach and dust. The clocks didn’t match. The lights buzzed. Beds were packed too close together. Mrs. Kimber ran the place. She checked her watch before she spoke, like time owed her money.\n\n“You’ll settle in,” she said. “Boys always do.”\n\nThe first night, I lay awake listening to the others sleep. Some cried quietly. Some snored. I counted breaths.\n\nThen the mattress dipped.\n\nA hand grabbed my collar and yanked me forward. Pain flashed white. A boy my age leaned over me, face half-shadowed, eyes flat.\n\n“Don’t make noise,” he whispered.\n\nHe hit me once. Then again. Not hard enough to kill me. Hard enough to teach me something.\n\n“You don’t get to be quiet here,” he said. “Quiet makes people look.”\n\nIn the morning, Mrs. Kimber called it a nightmare. The nurse wrapped my head. Asked who did it. I said I didn’t know.\n\nBecause naming things makes them real.\nAnd real things grow.\n\nAfter that, four boys started sitting near me. Gage. Redd. Dax. Cole. Loud boys. Smiling boys. They shared snacks. Told jokes. Pretended to notice me.\n\nGage suggested a game.\n\nThe tunnels under the city.\n\nI said yes.\n\nWe went at night. Flashlights. Wet concrete. Rust. Echoes that bounced wrong. Gage stopped deep inside and told me to close my eyes. Count to one hundred.\n\nWhen I opened them, they were gone.\n\nThe flashlight flickered on the ground. Their laughter echoed — then stopped. I ran. Fell. Cut myself on rails and stone. The tunnel twisted. I couldn’t tell which way was out. Eventually I stopped calling and started listening.\n\nThat’s when I heard breathing.\n\nSlow. Careful. Matching mine.\n\nA boy stood at the edge of the light. Eight years old. Pale. Blonde hair dirty at the tips. White shirt. Navy jumper. Red sneakers. Blue eyes too wide.\n\nI asked who he was.\n\nHe didn’t answer.\n\nHe stepped closer.\n\nI ran until I found light and crawled out. Ambulances. Questions. Punishment. Blame. No one listened.\n\nI disappeared a week later. Just walked away. The missing poster went up. Then came down.\n\nNow I drive at night when I can’t sleep.\n\nSometimes I see him in the rearview mirror. Same clothes. Same eyes. Breathing slow. Matching me.\n\nI don’t look for long.\n\nBecause when I do, people around me start forgetting things. Memories slip. Faces blur. And the longer I look —\n\nthe more he starts to look like me.\n\nIf you’re driving through Chicago at night and feel someone breathing in your backseat, don’t turn around.\n\nJust keep driving.\nAnd don’t breathe too fast."
  },
  {
    "id": "1qrin7q",
    "subreddit": "nosleep",
    "title": "I recorded myself sleep talking and regret it.",
    "author": "PNWCartoboi",
    "score": 179,
    "url": "https://www.reddit.com/r/nosleep/comments/1qrin7q/i_recorded_myself_sleep_talking_and_regret_it/",
    "created_utc": 1769808546.0,
    "num_comments": 4,
    "word_count": 626,
    "body": "I sleep talk.  A lot.  I know that I sleep talk a lot because when I wake up in the morning my wife’s first words of her mouth are “You were talking again last night, this time it was about trying to cross a bridge made of rubber or something.”  Most of the time it’s harmless stuff like that, nonsensical ramblings said with utmost urgency.  \n\nEvery once in a while, especially after I’ve experienced something really stressful I’ll get night terrors, meaning that I sleep talk with body movements as well.  One time I was dreaming we were in an avalanche and in the middle of the night I threw myself on top of my wife screaming “WATCH OUT FOR THE SNOW.”  Needless to say she was not thrilled that I woke her up, even if it was for the right reasons.  Other times it was more serious, like I dreamed there was an intruder and so jumped out from underneath the covers, yelling “GET OUT GET OUT GET OUT.”\n\nI’m sure by now you can tell that my wife’s sleep is not the most consistent and it’s kind of my fault, at least partially.  People get mean when they’re sleep deprived and it started to become an issue in our marriage.  How can you get mad at someone’s unconscious thoughts?  After a couple weeks I agreed to go to a sleep specialist and try to find a solution.  To my surprise sleep therapy was very similar to regular therapy, including talking through problems, dream journaling, mindfulness meditation, etc.  \n\nHowever, the one thing that was different versus regular therapy is that my therapist asked me to use an app to record myself when I sleep.  The idea is that in addition to tracking your diet and caffeine intake, the app turns up your phone’s microphone sensitivity to record any talking, moving, snoring, etc.  After a couple weeks the app said that it should be able to give me insights into what is giving me night terrors.  Up until last night the data collection was going really well.  \n\nI went through my usual bedtime routine.  Brushed my teeth, flossed, put in my night guard, plugged in my phone and started reading my book to drift off to sleep.  My phone is automatically set to always record between 10pm and 7 am, and as long as the speaker is pointed near my head it has no problem picking up what I say.  \n\nThe next morning I noticed that my phone has a lot more snippets of talking than usual.  The first clip is the sound of me rolling over.  The next one is a sample of my wife’s snoring.  The third was me.\n\n“Mmmm no I don’t trust that one it’s going to explode,” I mumbled.  The fourth one was also me, “Nonononono I don’t think that’s right.”\n\nThe fifth snippet was a voice I did not recognize. It was hard to make anything out but it was low, deep and gravely, humming a tune I could not place.  I listened to it over and over again to make sure and everytime the humming voice came through crystal clear.\n\nMy wife thinks it might have been me doing a character voice from my D&amp;D game but I have never done that in any of my previous sleep talking episodes and I can’t make my voice sound baritone and gravely.  I’m not really sure how else to explain it but needless to say, I’m going to be extra sure that my phone is recording again tonight.  I know it’s probably nothing but I can’t shake this feeling that something is wrong.  I have this feeling like I am anticipating that I am going to be watched while I sleep."
  },
  {
    "id": "1qvpkdz",
    "subreddit": "scarystories",
    "title": "Fifteen of us were in a plane crash. So, why are there SIXTEEN survivors?",
    "author": "Trash_Tia",
    "score": 144,
    "url": "https://www.reddit.com/r/scarystories/comments/1qvpkdz/fifteen_of_us_were_in_a_plane_crash_so_why_are/",
    "created_utc": 1770214253.0,
    "num_comments": 5,
    "word_count": 998,
    "body": "It’s like playing Russian roulette. \n\nEvery time we gather in a circle on the sand, cross-legged and stone-faced, I am certain I’ll be the one to pull the trigger. \n\nWe are all hungry. \n\nStarving. \n\nWilling to kill to survive. \n\nFifteen girls. \n\nA year ago, we were on top of the world. State champions. \n\nCheerleaders with everything at our fingertips. \n\nScholarships, college, nationals. \n\nEverything was ours. \n\nNow we are shells of those girls. Soulless, hollow outlines of who we used to be.\n\nAcross from me, Astrid wears the remnants of her cheer skirt, hanging off her skeletal frame, the school colors washed to black and gold. \n\nHer head of blonde curls is bowed as she furiously scribbles at a rock with a stick. Whoever’s name it is, is going to die. I scrutinise each girl sitting in front of me. \n\nCal, a fluffy redhead with freckles, won’t look me in the eye.\n\nI avert my gaze to our leader, nearest the fire. Bess. \n\nPonytail brunette. Jean shorts and her bra, dark skin gleaming with sweat. She’s sweating. Bad. Bess was vocal about her secret stash of deodorant, so I take notice. \n\nHer optimistic smile is too bright, too hollow. We can all still taste Elsa. \n\nShe sits on my tongue, sweet yet sour. Her meat was good. \n\nStringy, easy to pull from the bone.\n\nWe thought she was the imposter. \n\nSixteen girls survived the plane crash. We’ve known each other since freshman year, grown up together in our tiny coastal town. \n\nWe were besties. \n\nSlumber parties. \n\nFights. \n\nBreakups. \n\nBoys. \n\nA shiver creeps down my spine. \n\nI maintain my poker face. \n\nExpressions say a lot about a person, especially if they're guilty. \n\nI have nothing to hide, and yet I am trembling, my breaths coming out shallow and ragged. I fight to control my breathing, control my facial expression. There were 15 of us on the team, and 16 girls sat under the late glaze of the sun. \n\nMeaning, one of us was *lying*.\n\nOne of us had successfully gaslit us into believing they were *real*. \n\n“Isabelle, have you finished?” Bess’s voice snaps me out of it.\n\nI finished writing my chosen suspect’s name first. But letting people know that was suspicious. \n\n“Ready.” I say, and Bess nods and stands up.\n\n“We're ready to vote,” she announces in a single breath. \n\nI can tell by her eyes that she hates being the leader, *hates* being the one to make the decisions and let the fallout consume her. Bess is strong and resilient, but she's too… human. She's trembling, her eyes frantically flicking to each of us. \n\n“As always,” Bess takes a deep breath, “we’ll go alphabetically around the circle.” \n\nShe turns to Anna, whose already sobbing, her head of filthy blonde curls sandwiched in her lap. “Anna?” \n\nThe girl’s head snaps up, and like an animal, her frantic eyes zero in on each of us. \n\n“I don't want to do this,” she whispers, shuffling uncomfortably. \n\nI take notice of her demeanour. \n\nBess’s voice is calm. \n\nSoothing. \n\n“Who do you think is the imposter, Anna?” \n\nAnna holds up her rock. “I think it’s *Jessie*,” she grits out. “I saw her stealing food, and she refused to fill the water bucket last night.”\n\nJessie, who has been silent until now, sits up, her eyes darkening. “I was sick, you fucking *bitch*!” \n\n“Jessie.” Bess’s tone reminds us she's our leader. \n\nOne by one, we go around the circle.\n\nAnd, just as I thought, Anna’s name is repeated. \n\nIs it because she’s a cry baby, or refused to eat Elsa? Who knows. \n\nWhen Bess reaches me, I hold up my rock.\n\n“Anna,” I say softly, and the girl breaks down. \n\nI try to smile at her. “I just think you're a really *good* actress.” \n\nI hold my breath, as Bess counts the votes, her hands trembling. \n\nI watch her gather fifteen rocks. \n\n“All right,” she raises her voice. “I've counted 13 votes for Anna. Two for me, and one for Isabelle.”  \n\nHer hollow eyes find Anna, who is paralyzed to the spot.  \n\n“I'm sorry, Anna.”\n\nBess pulls out our only weapon from her filthy jeans.\n\nA 9mm handgun. \n\n“Cover your ears,” she tells the rest of us. \n\nI do, slamming my hand over my ears.\n\nI squeeze my eyes shut.\n\nI pretend not to hear the BANG. \n\nThe sound of Anna's strangled scream. \n\nHer body hitting the ground.\n\nI count my breaths, and how long it takes for Bess to stop crying.\n\nWhen I slowly remove my hands, Bess is already back to stoic self.\n\n“Take her back to the tent, and skin her,” she orders us. “Keep her organs. Just take all the meat.”\n\nWe comply, as usual.\n\nI help strip and skin Anna. The other girls gag.\n\nI don't.  \n\nI don't remember what real food tastes like, anyway.\n\nWe cook the best parts of her. I watch her spin, impaled on a spit.\n\nI feel weirdly… comfortable. \n\nWe can eat. We won't go hungry. \n\nAnd the imposter has been found.\n\nIt's not until a strangled yell— an unfamiliar cry, splinters through our afterglow.\n\n“What the *fuck*?!”\n\nThe other girls dive to their feet, shrieking.\n\nSeven teenage boys stand huddled together.\n\nBloodstained faces, wide eyes, wrapped in the remnants of sports wear.\n\nBess slowly raises to her feet, and runs over to them.\n\n“Oh my… oh my God,” she whispers.\n\nFifteen girls and fifteen boys were on that plane. \n\nBess wraps her arms around the lead boy, but he staggers back, his lips curling in disgust. “Cody? We thought…” Her voice breaks as she drops to her knees. “We thought you were dead. The plane exploded. We found blood—” She sobs, the words tumbling out. “We stopped looking for all of you!” \n\nCody, the boys leader, doesn't respond, his eyes zeroing in on me. He starts forward, his eyes widening. He raises his knife I only just realize is in his hand. \n\n“Bess,” his voice is terrifyingly calm. “Who the fuck is *that?”*"
  },
  {
    "id": "1qpr80x",
    "subreddit": "nosleep",
    "title": "My Best Friend Got Cheap Cosmetic Surgery.",
    "author": "MinuteConsequence660",
    "score": 108,
    "url": "https://www.reddit.com/r/nosleep/comments/1qpr80x/my_best_friend_got_cheap_cosmetic_surgery/",
    "created_utc": 1769641732.0,
    "num_comments": 3,
    "word_count": 770,
    "body": "About a week ago, my best friend called me about getting cosmetic surgery to hide some scarring on her face.\n\nI was happy for her. Growing past her pain rather than letting it consume her. I was ready to support her all the way.\n\nUntil she said the price.\n\n$50.\n\nFifty dollars for cosmetic surgery.\n\nSurely it had to be a scam right? Or some quack in a back alley.\n\nBut no matter what I said, I simply couldn't convince her to go somewhere else. Her mind was made up. When I tried, she snapped at me.\n\n\"You're trying to sabotage me, aren't you?! Trying to send me to some expensive quack who'll mess it up!\"\n\nI eventually managed to calm her down. I was just worried about her. I didn't try to convince her anymore.\n\nI wish I did.\n\nThe day after the surgery, she came over to my apartment. She looked great. Her skin was softer, her scars weren't even visible, she was absolutely glowing.\n\nWe talked for a while, and I noticed something. A strange sound coming from beneath her skin. Like rushing water but... thicker. It got louder whenever she opened her mouth to speak.\n\nI tried to write it off as paranoia. I was just worried about that surgeon she had gone to. But she looked great. Surely I had no reason to worry, right?\n\nWe said our goodbyes with smiles as she went home that evening.\n\nEvening?\n\nI hadn't noticed it at the time, but yes. She had been there all day. And neither of us had eaten. My stomach panged, but I watched as she left... she didn't even seem bothered by the hunger.\n\nThat night, she posted a picture of herself on Instagram. I opened it, used to it at this point. She loved posting pictures of her makeup or just herself when she was having a good day.\n\nI nearly screamed when I saw the photo, and actually dropped my phone.\n\nThere was something black leaking out of her. Out of her eyes, her ears, even seeping between her perfectly white teeth.\n\nI turned off my phone. I didn't touch it again for the rest of the night.\n\nI made myself dinner and went to bed, hoping that sleep could ease my nerves, or that I would wake up and it would just be a bad dream.\n\nThe next day, I got a call from an unknown number. I didn't answer it the first time. It called three more times.\n\nI answered, and nearly swallowed my tongue.\n\nThe words came as no more than a whisper, and that only made my heart race faster.\n\n\"I've already fixed your friend. You're next.\"\n\nI hung up, and immediately called my friend. She didn't answer. I called again and again. Nothing. I texted, nothing.\n\nBut she posted another picture. Her eyes were solid black now, and the same substance was running out of her nose.\n\nIt felt like I couldn't breathe. I closed and opened the app, hoping the image would fix itself. It didn't.\n\nI didn't look at my phone for days after that, too scared of what I might see.\n\nIt wasn't until yesterday that I finally bit the bullet and went to her house. I had a spare key, and let myself in.\n\nThe house was too quiet.\n\nI walked up the stairs to her bedroom with my heart pounding in my ears and dread filling every inch of my bones.\n\nI found her on the bed. The skin of her face was... bubbling. Like Harry Potter polyjuice potion bubbling.\n\nWhen she spoke, her voice was hoarse, like there was something in her throat, stopping her from making sound.\n\n\"I don't... feel so good...\"\n\nThere was this awful stretching sound coming from her fake. Not her mouth. Her face. Her skin.\n\nI could only stare with horror. Her eyes were black her hands were stained with what looked like ink...\n\nAnd then it happened.\n\nHer entire face popped.\n\nI couldn't even see blood. It was all black, thick like tar, it splattered all over the room.\n\nI heard a scream. It took me only seconds to realize that I had made the sound myself...\n\nBecause she had stood up. Skin hanging off of her skull in sheets... and spoke. Her voice wasn't hers.\n\n\"Join us. Let him fix you.\"\n\nI raced home, trying to wash off the black substance that was staining my skin. It wouldn't come off. My fingertips are still black.\n\nI got an ad on my phone today for cheap cosmetic surgery. I think I'm the next target..."
  },
  {
    "id": "1radknb",
    "subreddit": "nosleep",
    "title": "Ever Heard A Man Scream With No Lungs?",
    "author": "BloodySpaghetti",
    "score": 106,
    "url": "https://www.reddit.com/r/nosleep/comments/1radknb/ever_heard_a_man_scream_with_no_lungs/",
    "created_utc": 1771636367.0,
    "num_comments": 7,
    "word_count": 942,
    "body": "A sick man kidnapped me. He seemed remorseful after the fact, speaking about some alien entity threatening to destroy the whole world unless he sacrifices me to this entity. A thing he called Unketzez. Since his actual name isn’t particularly relevant, I’ll refer to him as John.\n\nSee, John had a very disorganized speech and an impossible train of thought. Surely, he was delusional. Clearly ill, as I said. I let myself be taken hostage because I have time and very little to do with my time. With that in mind, I played along with the poor man.\n\nJohn, for all of his faults, worked hard to delay what he thought was inevitable.\n\nUnfortunately, Unketzez won out, and I had to be sacrificed.\n\nNeedless to say, it didn’t work out as intended. Not for a lack of trying. No, John tried to sacrifice me. Technically, he succeeded.\n\nTechnically.\n\nIt didn’t work out because I am immortal. I cannot permanently die, not as far as I know. Trust me, I’ve tried; others have tried to kill me, too. Nothing seems to work so far. Temporarily, I can “die,” but eventually my body fixes itself. There are drawbacks to that; I’m not immune to the pains of dying.\n\nAnd John, well, John made it a very long night…\n\nI was partially flayed, with a hot iron, force-fed my own burnt skin, then disemboweled and hanged from my own intestine.\n\nAfter that, the mad bastard tore open my back, shattered my ribcage, and draped the lungs over the exposed bone.\n\nI felt all of that, every single moment.\n\nAdrenaline shots worked like magic to keep me awake and prolong my suffering.\n\nThere are no words to describe the agony John put me through. Bless his heart, he kept apologizing and weeping throughout.\n\nImagine a man screaming with no lungs; that’s what it was like.\n\nEventually, it stopped, and I “died”.\n\nImagine John’s shock when he found me walking out of his basement unscathed.\n\nHe looked and screamed like he’d seen a ghost. I could’ve laughed if he didn’t stab me through the arm and a lung in that moment.\n\nPinning him to the wall was surprisingly easy before I spun him a tale. Playing into his delusions, I told him that I, too, was a devotee of Unketzez and that the whole ordeal was just a test to see whether he was worthy of an awakening.\n\nBeing the sick man he was, he believed every word.\n\nI explained that I was immortal thanks to our god. In reality, it’s been so long that I don’t know if I was born this way or became like this. What I do know is that if someone eats my flesh or drinks my blood, they gain some superhuman ability.\n\nI mentioned how I’ve been killed many times before, in part to be consumed.\n\nWhat happens every time, though, is that whoever partakes in my consumption ends up with an ability that inadvertently kills them.\n\nEvery single time.\n\nSo, I told John that drinking my blood would make him an immortal, too.\n\nIt’s hard for me to say I was angry with him; one effect of a long life is detachment. I couldn’t care less what happened to this insignificant creature, but a terrible night was worth teaching a lesson over.\n\nSo, I convinced John that he wanted this immortality I was promising him, and once he agreed, I pulled out the knife from my body, I shoved my wounded arm straight into his mouth, making sure he got a good taste of my blood. I kept it there until he started gagging and regurgitating and wouldn’t stop, even then. Only relenting when the collapsed lung in my chest finally knocked me out, and we both fell to the ground.\n\nI came to my senses only hours later, to the sound of a weeping man.\n\nThe room was coated in patches and handprints of gold.\n\nAlmost everything around me shone with an auric radiance; the walls, the floor, the furniture. Everything had a tinge of that precious metal coating it.\n\nAt its center, facing me, sat John, half covered in gold himself, rocking back and forth.\n\nThe metal seemed to slowly spread over his body as his movements became stiffer and stiffer with each passing moment.\n\nHe was muttering and crying to himself.\n\nHis own Midas touch was slowly killing him…\n\nQuicker than I even anticipated, by the time I picked myself up, he could barely beg for help.\n\nA dreadful look of fear in his desperate gaze penetrated straight through me. It’s been a while since something sent shivers down my spine, but in this state, this sick man definitely did.\n\nHe barely managed to lift one gold-plated arm in my direction when he saw me get up, and his cries for help slowly morphed into something far worse, and far less human.\n\nBreathless, suffocated, almost crushed\n\nA hiss.\n\nA death rattle escaping from a crack in a metallic statue when the wind blows through it.\n\nThat was the sound of a man screaming with no lungs.\n\nHis death was slower than it seemed. Even after falling silent, he must’ve had some time before the gold statue encasing his organs fully hardened, collapsing his lungs and heart in place.\n\nThe worst part of it all is that even after the gold covered his body completely, it must’ve been only skin deep, because I watched his eyes dart about, almost pleading, for another minute or two, before their gaze fell on me.\n\nDilating one last time, stuck in place\n\nYet somehow, following me across the room until I left."
  },
  {
    "id": "1qn35tq",
    "subreddit": "nosleep",
    "title": "I Sleep in an Elevator Maintenance Room. There’s a Secret Floor Below Ground.",
    "author": "Hokons",
    "score": 103,
    "url": "https://www.reddit.com/r/nosleep/comments/1qn35tq/i_sleep_in_an_elevator_maintenance_room_theres_a/",
    "created_utc": 1769393854.0,
    "num_comments": 3,
    "word_count": 977,
    "body": "Times are tough, they say.\n \n \nI've heard that a hell of a lot in my life. I've slept on sidewalks, using sheets of cardboard to shield myself from the sun. I've been robbed at knifepoint while living at a shelter.\n \n \nUntil recently, I lived in a share house with six flatmates, but I was never formally on the lease and they kicked me out when I couldn't afford the rent increase.\n \n \nThankfully, I'd directed my small trickle of cash flow to train as an elevator technician. A solid trade. Something I could do with my own two hands–something no one could take from me.\n \n \nSo after my last job for the day, a run-of-the-mill hotel in Mott Haven, I simply never left. I just stayed in the maintenance room. I'd fixed the elevator, so they had no reason to go investigating, and who were they gonna call? Me? \n\n\nI plumped up my backpack as a makeshift pillow and hunkered down for the night. I didn't mind sleeping on the floor; the concrete was cool to the touch. In one corner of the room was an exposed pipe, which I stuffed with an old shirt. Experience taught me something nasty like rats or cockroaches were apt to crawl out of there.\n \n\nThe hardest part about sleeping in the maintenance room was the beeping.\n \n \nAll night the elevator would ring. Even at odd hours, like three o’clock in the morning. I figured there'd been an event on–a party hosted in one of the rooms.\n \n \nIt didn’t pass. *Ding. Ding. Ding.* Every night.\n\n \nWhen the elevator moved during these hours, it sounded like it was moving down.\n \n \nI had access to the whole MCP form; that's a piece of documentation detailing the whole elevator shaft.The maintenance room was on the ground floor, and there were no basement floors listed–at least none on file.\n \n \nI brushed it off as acoustics–how the sound bounced off the concrete walls–but the sound was particularly annoying in its persistence. At least when sleeping on the street, all the sounds merged into one.\n \n \nThere were new sounds too: glasses clinking together, cutlery scratching plates, a cat–or some sort of wild animal–yowling.\n \n \nTired and cranky, I traced the sounds and found they were loudest near the pipes. I removed the old shirt I'd stuffed down the exposed hole and it became clear. People were having dinner–a party–and it was coming from below.\n \n \nStill, the room was safe, and I could stick a wrench through the door handle to stop people getting in. No sun to scorch my skin, no rain to turn the walls soggy until they collapsed on top of me.\n \n \nWhen livin’ is tough, you learn pretty quickly to accept things as they are and not push your luck.\n \n \nSo I plodded on, ignoring the sounds. People came and went, visiting the basement dining room at inappropriate hours. If I pressed my ear against the door, I could hear them talking. One night there had been a heavy, wet plod, and then a man said,\n \n \n“Quiet, piggy.”\n \n \nThe smells would drift up from the pipe, and I hadn't smelt any pork that night–more like minced veal and a bitter stench like too much garlic.\n \n \nIn the early hours of the morning, when I snuck out to go to work, there were brown stains like machine oil streaking the floor, leading right to the elevator doors.\n \n \nIt pissed me off more than anything. Here I was living in a cell while they dined lavishly.\n \n \nThe other night, there were two men speaking outside the door.\n \n \n\"Is the meal prepared for tonight?\"\n \n \n\"Yes, a full course. Caught fresh.\"\n \n \n\"And the tools?\"\n \n \n\"Sharpened.\"\n \n \nThey chuckled to themselves as the elevator arrived, and I listened to their voices drift off.\n \n \nDrift down.\n \n \nCoincidentally, my job the next day was at this very hotel. I dipped out amidst the morning rush, when the front desk staff were overwhelmed and wouldn't notice. After pretending to park my van, the hotel manager greeted me in the lobby.\n \n \n“Back so soon?” He drawled.\n \n \nI recognized the voice immediately; I'd heard it just last night. “What can I say? This lift sees a lot of use.” He raised an eyebrow, so I followed up. “This place must fit a hundred, a hundred and fifty guests.” \n \n \n“About so, yes.”\n \n \nHe left me at the elevators and I went to work on the issue; a twelfth floor button that wouldn’t register when pressed. A simple enough problem. We get about one a week. I’d coordinated with the in-house maintenance team to shut down the power until I was done.\n \n \nHalfway through the job, the elevator doors suddenly rattled shut.\n \n \n“Hey–what the fuck?”\n \n \nThe elevator started moving, and although no buttons were lit up, I could feel that it was moving down.\n \n \nThe doors opened onto near-total darkness. In the centre of the room was a long, glass table. The type you see in an executive boardroom. The table was set entirely in glass—plates, cups, even knives thin as broken window shards. Above the table were three hooks. Glass hooks.\n \n \nBefore I could see more, the doors closed again, and the elevator shifted back up to the ground floor.\n \n \nI stumbled out into the lobby, a little dazed. The hotel manager was speaking with some guests in fancy suits. He spotted me and excused himself.\n \n \n\"Is it all fixed?”\n \n \n\"Almost. I just need to grab a screwdriver from my van.”\n \n\nI already had my tools with me but I needed to grab something else from my van. An inflatable mattress, that I could blow up once I was done with the job.\n \nThe elevators had cameras. If I reported anything, they’d see it was me. I’m in no position to help anyone. I just need a place to sleep.\n \n \nAnd truth be told? I’ve slept through worse."
  },
  {
    "id": "1qrotbc",
    "subreddit": "nosleep",
    "title": "I messed up and I think I noticed something I wasn’t supposed to notice",
    "author": "Big_Analyst_8704",
    "score": 100,
    "url": "https://www.reddit.com/r/nosleep/comments/1qrotbc/i_messed_up_and_i_think_i_noticed_something_i/",
    "created_utc": 1769823523.0,
    "num_comments": 15,
    "word_count": 875,
    "body": "I don’t have a lot of time to organize this because it gets harder to hold thoughts in place the longer I try to write them. They move. I know that sounds like I’m speaking metaphorically but I am not. The thoughts rearrange themselves and when I reread things they feel edited slightly like someone corrected them but not fully.\n\n \nThis started a few days ago but maybe earlier and I just didn’t see it yet. I realized conversations aren’t stable. People are saying things that have two tracks. The normal one and the one meant for me. It happens in person but it’s stronger through screens.\n\n \nYesterday the news anchor paused mid sentence and blinked three times in uneven timing and then continued reading. That is not normal blinking. I rewound it and it only happened the first time which means it was live targeting, not recorded. I know people will say that’s impossible but explain why it didn’t repeat when I rewound.\n\n\n\nMy apartment has been quieter but also louder at the same time. I can hear small electrical sounds behind the walls that weren’t there before, like clicking and faint chirping almost like insects but metallic. It gets louder when I try to relax or when I start thinking about whether this is being monitored. When I stop thinking about it, it fades like it’s waiting for my attention.\n\n \nI covered my laptop camera and unplugged the router but my phone still vibrates randomly with no notifications. It’s not a normal vibration pattern. It feels like it’s trying to sync with my pulse or maybe influence it. I held it against my chest and it matched my heartbeat for a few seconds and then stopped when I noticed.\n\n \nThere are messages hidden in normal posts online. I know Reddit has moderation but certain phrases keep appearing across different subreddits from accounts that don’t know each other. The phrase “keep the window open” showed up four separate times today in unrelated posts about weather, computer cooling, and houseplants. That is not coincidence. Windows are about access.\n\n \nI tried going outside to clear my head but people kept glancing at me in a synchronized way. Not everyone. Just enough that it forms a pattern if you map it. A man across the parking lot dropped his keys right when I started thinking about leaving town. That felt like a warning or maybe confirmation that movement is being tracked.\n\n \nTime is also slipping slightly. I lose small chunks like pages torn out of a notebook. I’ll look at the clock and then suddenly 40 minutes has passed but I don’t remember moving or doing anything. The lights feel brighter afterward like something adjusted while I wasn’t fully present.\n\n \nI wrote reminders on paper because paper is harder to alter but I found one of my notes folded differently than how I left it and the handwriting looked heavier like someone pressed the pen harder while copying it. I live alone. There is no reason for that to happen.\n\n \nI’m starting to think this isn’t surveillance in the normal sense. It feels more like calibration. Like they are testing responses and adjusting variables around me to see what I notice and how I react. Conversations, sounds, advertisements, even weather alerts seem too specifically timed.\n\n \nI haven’t slept properly because when I start to drift off I hear my name almost spoken but not fully formed, like it’s caught in someone’s throat or coming through a bad speaker. The last time it happened it sounded like it came from inside the room instead of outside it. I checked everywhere. Closets, vents, behind furniture. Nothing but the air feels thicker at night like it’s crowded.\n\n \nI know someone reading this is going to say stress or carbon monoxide or paranoia. I already bought detectors. They’re fine. Or at least they say they are fine but I don’t know how much I trust devices anymore because devices are the easiest thing to change remotely.\n\n \nI tried calling a friend earlier and halfway through the call I couldn’t tell if the pauses in conversation were normal or if he was receiving prompts. His responses felt slightly delayed like subtitles catching up to dialogue. I hung up because I didn’t know if continuing the conversation would give them more information about how I think.\n\n \nIf this post gets removed or edited then that confirms this is being filtered. If it stays up I don’t know if that means they want it visible or if they’re watching who responds.\n\n \nI’m not trying to cause problems. I just need to document that something shifted and I noticed it. Things are too aligned. Too responsive to internal thoughts. The world feels like it’s leaning closer than it used to.\n\n \nIf anyone else has noticed signals hidden in normal behavior or sudden synchronization between electronics, strangers, and media, please respond but be careful how specific you are. I don’t know which words trigger attention yet.\n\n \nI’m going to stay awake tonight and write down every sound and pattern I notice so there’s a record that can’t be erased all at once.\n\n \nIf I stop updating suddenly, it probably means they finished adjusting whatever they started."
  },
  {
    "id": "1qt4sgz",
    "subreddit": "nosleep",
    "title": "The Chef",
    "author": "fluffybottompanda",
    "score": 95,
    "url": "https://www.reddit.com/r/nosleep/comments/1qt4sgz/the_chef/",
    "created_utc": 1769967194.0,
    "num_comments": 3,
    "word_count": 939,
    "body": "I should have known something was wrong the moment we stepped into Elias’s foyer. The air didn't smell like a dinner party. It didn't smell like roasting garlic or expensive wine. It smelled like ozone and wet copper, the kind of scent that pricks the back of your throat and makes your eyes water.\n\nMy friend Mark had been hyping this up for weeks. Elias had supposedly hired a \"private culinary specialist\" who specialized in rare, exotic proteins. Mark is a bit of a foodie snob, so I just rolled my eyes and went along with it. I didn't mention that I’d been transitioning to a vegetarian diet over the last few months; I didn't want to be the \"difficult\" guest at a high-end event, and I figured I could just fill up on side dishes.\n\nThen I saw the chef.\n\nHe was standing in the open kitchen, framed by stainless steel and hanging copper pots. He was tall, unnervingly thin, and wearing a coat that was a shade of white so bright it felt aggressive. He didn't look like any chef I’d ever seen. He didn't move like one, either. His movements were jerky, like a marionette being piloted by someone who hadn't quite mastered the strings. When he looked up at us, his eyes didn't seem to focus on our faces. They darted toward our throats, then our chests, then back to the slab of dark, iridescent meat on the counter.\n\n\"The main course,\" Elias announced, beaming. \"A once-in-a-lifetime harvest. Chef says it’s from a very... remote location.\"\n\nThe Chef didn't speak. He just smiled, and his teeth looked too numerous for his mouth.\n\nWhen we sat down, the atmosphere shifted from awkward to oppressive. The Chef brought out the plates himself. The meat was a deep, bruised purple, marbled with veins of silver that seemed to pulse under the dim dining room lights. As he set my plate down, he leaned in close. I could smell that ozone scent coming off his skin. He lingered for a second too long, his hand resting on the back of my chair.\n\n\"Eat,\" he whispered. It wasn't an invitation. It was a command.\n\nI felt a cold spike of genuine fear. Looking at his face, I realized his pupils weren't round—they were slightly jagged, like cracked glass. I knew right then that if I told him I wouldn't eat his \"specialty,\" I wouldn't be leaving that house.\n\nSo, I did what I had to do. I’m a nurse; I’m used to keeping a straight face under pressure. While Mark and the others dug in, making \"Mmm\" sounds that turned into wet, gagging gasps of delight, I went to work. I used my knife to move the meat around, smearing the dark purple juices into the mashed potatoes. I tucked the largest chunks into my cloth napkin when the Chef turned his back to the stove. I even took a piece into my mouth, holding it against my cheek until I could pretend to cough and spit it into a glass of dark red wine.\n\nThe change in the others started before the second course.\n\nMark was the first. He stopped chewing, his fork clattering onto the porcelain. A thin, translucent thread—like a strand of spider silk but thicker—slid out of his nostril. He didn't wipe it away. He just stared at the ceiling, his jaw unhinging further than should be humanly possible.\n\nThen came Sarah. She started scratching at her forearm, her nails tearing through the skin.\n\nUnderneath the surface, I saw it. A rhythmic, undulating bulge. Something was moving under her skin, long and thin, traveling from her wrist toward her shoulder. It wasn't a worm from this earth. It glowed with a faint, sickly bioluminescence, a rhythmic blue pulse that matched the silver veins in the meat.\nI looked at the Chef. He was watching them with a look of terrifying hunger. He wasn't even pretending to cook anymore. He just stood there, his long, pale fingers twitching in sync with the parasites moving inside my friends.\n\n\"So vibrant,\" the Chef murmured. \"The colonization is successful.\"\nHe turned his gaze to me. I froze, my heart hammering against my ribs so hard I thought he’d hear it. I had the napkin full of meat clenched in my hand under the table. I forced a smile, though my lips were trembling.\n\n\"It’s... delicious,\" I managed to choke out.\nHe stepped toward me, his eyes narrowing. He looked at my plate, then at my face. I thought for sure I was dead. But then, Elias let out a wet, gurgling scream as a jagged, multi-segmented limb erupted from his throat, and the Chef’s attention snapped back to his primary \"success.\"\n\nIn the chaos of Elias’s body folding in on itself, I bolted. I didn't grab my coat. I didn't look back at Mark, who was now making a clicking sound that I still hear every time it gets too quiet. I ran out the front door and didn't stop until I reached my car.\nI’ve been sitting in my apartment in Jackson for three hours now. I’ve scrubbed my hands until they bled, but I can still smell that ozone. I keep looking at my own reflection, checking my nostrils, checking my skin for any blue pulses.\n\nI’m safe. I didn't eat it. But as I look out my window at the streetlights, I can't help but wonder how many other \"dinner parties\" the Chef is hosting tonight. And I can't help but notice that the stars look a little brighter, and a little hungrier, than they did yesterday."
  },
  {
    "id": "1qq74zw",
    "subreddit": "scarystories",
    "title": "My dad has been hiding a \"Missing\" poster of me from two decades ago!",
    "author": "johley89",
    "score": 89,
    "url": "https://www.reddit.com/r/scarystories/comments/1qq74zw/my_dad_has_been_hiding_a_missing_poster_of_me/",
    "created_utc": 1769689423.0,
    "num_comments": 3,
    "word_count": 296,
    "body": "I was looking for my birth certificate to renew my passport when I found it. It was tucked at the very bottom of a locked filing cabinet, hidden under decades of tax returns and old property deeds. The paper was yellowed and brittle, but the face staring back was unmistakable. It was me at five years old, wearing a red sweater I don’t remember owning. The text at the top read \"MISSING\" in bold, black letters, followed by a description of a girl who disappeared from a town three states over in 2001. The name on the flyer wasn't mine, though. It said \"Elena,\" a name I haven't heard once in the twenty years I’ve lived as Sarah.\n\nI’ve lived with my father in this same house since I was a kid. He told me my mother died in a car accident when I was a toddler and that we moved here to start over. But seeing that poster made my stomach drop because of the memories I’ve always tried to dismiss. I have these flashes of a house with a wrap-around porch and a dog named Buster. I always assumed I’d just seen those things on a TV show or dreamed them up because I wanted a bigger family.\n\nI looked at the contact number on the poster and felt a cold chill wash over me. It wasn't a police station. It was a private landline. I sat on the floor of the office and realized that every photo of me before the age of five is missing from our family albums. Then I heard the garage door open. My father is home early. I didn't have time to lock the cabinet, and I can hear his heavy footsteps coming straight toward the office door."
  },
  {
    "id": "1quar7s",
    "subreddit": "nosleep",
    "title": "I Found a Suit Left on the Train",
    "author": "Hokons",
    "score": 84,
    "url": "https://www.reddit.com/r/nosleep/comments/1quar7s/i_found_a_suit_left_on_the_train/",
    "created_utc": 1770073242.0,
    "num_comments": 2,
    "word_count": 656,
    "body": "I squatted on my heels while I waited for the train, taking a long drag from my vape. My phone buzzed in my pocket as Stephanie called. That was the sixth time. I’d already texted—start dinner without me—no matter how much Mum guilt-trips her. Maybe she knew that meant I wasn’t coming.\n\n\nIt’s not that I don’t love my family; I just crave independence more. There’s something about having nothing to fall back on that ignites my drive. Too many safety nets, and I become complacent.\n\n\nAt 10:30 p.m., the train would arrive and take me down the T9 Eastlake line. In an hour, I’d be in Brianna’s arms, eating her roast vegetables, sniffing sparkling wine, and pretending we were sommeliers. If they didn’t want Brianna in their home, then so be it—but I wouldn’t be there either.\n\n\nWhen the train arrived, I watched the empty carriages fly past. The lights inside only illuminated how void of anything they were. No people. No bags. In one carriage, I saw what looked like a suit jacket hanging in a plastic dry-cleaning bag. Some unlucky sap had probably lost a good amount of money forgetting that.\n\n\nI boarded the last carriage and sat in the top compartment, kicking my feet against the splotchy blue-and-yellow seat. I opened my phone, swiped away the missed calls and message notifications, and launched Block Puzzle.\n\n\nAs I played, I kept getting distracted by a crinkling sound, like a kid trying to quietly unwrap a candy bar. I looked around, but there was no one else in the top compartment. Still, the sound persisted, and after ten minutes of doing my best to ignore it, I pushed myself off the seat and started walking toward the lower carriage.\n\n\nI paused on the steps. I hadn’t realized it when I got on, but I’d boarded the same carriage as the suit jacket. Only now did I see that it was a full suit—all dark navy wool. Expensive.\n\n\nNow, I’m no thief. I could see that the dry-cleaning tag had no name or number, and a suit this nice would never see a lost-and-found bin. If it was going to wind up in someone else’s hands, why not mine?\n\n\nMy phone buzzed again. I left it buzzing.\n\n\nThe suit was attached to a handrail that dangled from the ceiling of the vestibule. I reached out to unhook it, then paused. The plastic covering was skin-tight—vacuum-sealed. There was no air in it to possibly make any crinkling sounds.\n\n\nThe train jostled as it rounded a corner, making the suit jacket’s arm flap out and land on my shoulder.\n\n\nWhere the jacket touched, my skin tightened. A sharp pain twitched in my deltoid.\n\n\nI pulled back, but the jacket stayed attached.\n\n\nThe plastic tightened where it touched my shoulder, shrinking with a wet, sucking sound. My skin pulled with it, stretching thin and going numb, like it too was being shrink-wrapped. The pain sharpened, deep and burning, and I bit down on my tongue to keep from crying out.\n\n\nI clawed at the sleeve, but my fingers slid uselessly over the plastic. Where I touched it, the vacuum-seal effect spread to my fingers, sucking them dry.\n\n\nThe train screeched as it slowed for the next station. The sudden deceleration broke whatever tension the suit was holding. The hanger snapped free, and I fell hard onto the floor. The plastic ripped back from my arm with a sound like masking tape.\n\n\nWhen the doors slid open, I ran, barely feeling my feet hit the platform. The cold air burned against my arm where the plastic had been, my skin red and smooth—so tight I couldn’t even pinch it.\n\n\nBehind me, the doors closed, and the train pulled away.\n\n\nThrough the window, I saw the suit hanging exactly where it had been when I first saw it—sealed and empty.\n\n\nMy phone rang in my pocket.\n\n\nThis time, I answered."
  },
  {
    "id": "1qp7nqv",
    "subreddit": "nosleep",
    "title": "I Inherited My Father’s Digital Fortune. His Kill Switch Could Ruin Everyone.",
    "author": "de-secops",
    "score": 77,
    "url": "https://www.reddit.com/r/nosleep/comments/1qp7nqv/i_inherited_my_fathers_digital_fortune_his_kill/",
    "created_utc": 1769595727.0,
    "num_comments": 8,
    "word_count": 619,
    "body": "I have a job that sounds like it was invented by a science fiction writer. I am a Digital Inheritance Auditor. When a high-net-worth individual dies, I am the one hired by banks or estates to locate missing digital assets. Bitcoin, dormant accounts, encrypted intellectual property.\n\nMost of the time, I find nothing but unlinked Amazon accounts and old browser histories. Last month, my own father died. For the first time, the audit was personal.\n\nMy father was the Golden Boy of our city. He built a waste management empire, sold it for hundreds of millions, and retired. My siblings Tyler, the so-called influencer, and Sarah, the socialite philanthropist, spent the last decade jetting off to Dubai and the Maldives on his dime.\n\nI was the invisible one. For years, I handled everything behind the scenes. I managed his estate, coordinated his business affairs, and kept things running while they lived on Instagram-ready snapshots of his generosity.\n\nWhen he passed, Tyler and Sarah did not wait for the funeral. They showed up with a moving truck, expecting the estate and the remaining trust funds to be theirs. They called me unambitious and a leech because I had not built a personal brand like they had.\n\nThey did not know about the Kill Switch.\n\nDuring my audit of my father’s private server, a machine I had maintained for years, I found an encrypted file labeled The Cost of Silence 1994.\n\nIt revealed that my father had not really sold his company. The buyers were not a legitimate corporation. They were a shell for a conglomerate that needed to bury decades of illegal environmental violations. My father had built his wealth by negotiating payments in exchange for secrecy. The Kill Switch was a safeguard embedded in a recurring digital contract. If it was not reset every ninety days, a packet of evidence would automatically be sent to the authorities, exposing everything.\n\nI was the only one who knew how to maintain it. When he died, the ninety-day countdown began.\n\nTyler and Sarah are now suing me for theft of digital assets, claiming I have hidden his Bitcoin. They have no idea that if they seize the server before the contract is renewed, the Kill Switch triggers automatically. All of their inherited wealth, along with proof of decades of corporate malfeasance, would go public.\n\nI am sitting in the kitchen while their lawyers are outside with a court order to seize his devices. They think they are about to get rich. I am staring at the clock. Seventy-six hours left.\n\nEvery second feels like I am sitting on a bomb I cannot see.\n\nThey are packing the server now. Sarah just walked past me carrying a twenty-thousand-dollar vase like it is a trophy. She looked me dead in the eye and said, Time to find your own place. The leeching ends today.\n\nI have not even had time to grieve, and they are already moving in.\n\nThe Kill Switch does not care about grief. It does not negotiate. If they unplug the hardware, the contract submits itself automatically. The evidence goes to the authorities. Tyler and Sarah inherit everything my father protected them from. The law, the debts, the public shame.\n\nAnd I am the only one who can stop it.\n\nI could intervene, renew the contract, and preserve their wealth. But I cannot forget how they treated me. Every Instagram story, every boastful vacation photo, every insult. They never cared when I was keeping everything together.\n\nThe clock is ticking. Seventy-five hours and fourteen minutes left.\n\nDo I let them win, or do I sit back and watch the consequences unfold?\n\nI have never felt more powerless or more in control."
  },
  {
    "id": "1r6c1f5",
    "subreddit": "nosleep",
    "title": "I don’t want to be haunted…",
    "author": "8_Bit_Nerd",
    "score": 72,
    "url": "https://www.reddit.com/r/nosleep/comments/1r6c1f5/i_dont_want_to_be_haunted/",
    "created_utc": 1771254442.0,
    "num_comments": 4,
    "word_count": 534,
    "body": "…like my mother was. She’d tell me true ghost stories all the time growing up. There were the stories she’d share with other folks. Like the time she saw the ghost of her dead cousin who drowned, or the ghost of our dead cat that time it darted under her bed just hours after it’d died.\n\nThen there were the stories she saved just for me, it seemed, when we were alone and my knees were tucked into my chest under the covers. Like the time something grabbed her ankle in the middle of the night and dragged her to the foot of the bed. Then she’d grab my ankle, laughing, and send me off to sleep. I was supposed to pray for everyone’s safety before sleeping, but all I ever did was pray to never seeing ghosts like she did. Never feeling something pulling on my hair like she did. I never wanted to be haunted and see the things she did.\n\nAs I got older, it was easier to dismiss my fears as part of my mom’s morbid imagination. She was the woman who told me that when you saw a shoe in the street, it was because someone got pulled into a car. But then she told the stories around my aunt and uncle, about the hair pulling and the hand grabbing her ankle, and they nodded. They remembered what happened. They all heard her scream and saw the heavy bruises on her ankle. They were in the room when it happened. They saw her get lifted up by the hair.\n\nMy prayers came back too. “Please God, I don’t want to be haunted and see the things she did.”\n\nBut she never stopped telling me about them when we were alone, about the difference between ghosts and spirits… about the things that were once people who were now wandering around, lost. And the things that were never human, that were waiting for her to die. Maybe she was warning me. Maybe I was like her and she was trying to protect me.\n\nThen she got sick, and I sat there and watched her eyes dart to the dark corners of her hospice room, whimpering at what she saw. I didn’t look, I didn’t want to see them, but they were there like she said. Waiting for her. I could feel them in the room, hear a soft, eager clicking like dry mouths moving and making no sound. I could only hold her hand as she clutched mine, too weak to hurt me and holding on for dear life, like my hand was the only thing stopping her from slipping away.\n\nBut she slipped away, and I felt… relieved. I felt like a monster because I hadn’t inherited her ghosts and I felt relief at that, but I told people I was relieved because at least her pain was over.\n\nIt’s been ten years since she’s been gone, but she still visits me, sitting on the edge of my bed late at night, staring across the room, her dry lips moving silently as she tells me ghost stories I can’t hear.\n\nAt least I’m not haunted by the things she sees."
  },
  {
    "id": "1r5q1jp",
    "subreddit": "scarystories",
    "title": "What followed from Landsberg-Kaufering",
    "author": "Beard-and-Beyond",
    "score": 72,
    "url": "https://www.reddit.com/r/scarystories/comments/1r5q1jp/what_followed_from_landsbergkaufering/",
    "created_utc": 1771189559.0,
    "num_comments": 41,
    "word_count": 710,
    "body": "The humidity in Georgia usually smells like peaches and pine, but in my bedroom, it smells like scorched hair and wet ash.\n\nI’m eighty-four years old. My legs are thin as birch branches, and my eyes are clouded with cataracts, but I see them clearer than I see my own daughter. They don’t scream. That’s the worst part. They just stand in the corners of the room, their striped uniforms hanging off ribcages that look like birdcages.\n\nI first saw the boy in 1946, a year after I came home from the 101st Airborne. He was sitting at the foot of my bed, his eyes two hollow pits of ink. I thought it was \"shell shock.\" I thought if I married Rose and worked the hardware store for forty years, the boy would fade.\n\nInstead, he brought friends.\n\nNow, there are dozens. They crowd the hallway. When I walk to the kitchen, I have to pass through them. Their skin feels like cold, damp parchment against my arms. They follow me because I was there when the gates of Landsberg were kicked open. I saw the stacks of \"cordwood\" that were actually people. I smelled the sky when it turned gray with the soot of the ovens.\n\n\"I tried to save you,\" I whisper to the woman standing by my dresser. She has no teeth, and her fingernails are gone. \"We gave you our rations. We called for the medics.\"\n\nShe only stares, her jaw unhinged in a silent, eternal hollow.\n\nLately, the haunting has intensified. The house grows cold enough to see my breath, even in the July heat. My daughter, Martha, thinks I’m losing my mind.\n\n\"Dad, you're talking to the air again,\" she says, setting a tray of tea down. She walks right through the man with the shattered spectacles. He doesn't flinch.\n\n\"They won't leave, Martha,\" I croak. \"They want something. They’ve been waiting sixty years for me to give it to them.\"\n\nI feel the guilt like a stone in my gut. I lived. I had steak dinners, and a mortgage, and grandchildren. They got a ditch and a number. I’ve spent my life thinking they haunt me because I didn't do enough. Because I was a witness to a godless world and survived it.\n\nTonight, the air is thicker than usual. The smell of the ash is suffocating. The boy—the first one—crawls onto the edge of my mattress. His hand, nothing but bone and grey skin, reaches out.\n\n\"I'm sorry,\" I weep, the tears stinging my wrinkled cheeks. \"I'm so sorry I couldn't pull you all out in time.\"\n\nFor the first time in sixty years, the boy speaks. His voice isn't a whisper; it's a vibration in my very marrow.\n\n\"We aren't the ones who followed you home, Arthur.\"\n\nMy heart stutters. I look past the boy, toward the bedroom door. The crowd of prisoners—the starving, the broken, the ghosts I thought were my tormentors—suddenly shift. They aren't looking at me with malice. They are looking at the doorway with terror.\n\nThey aren't haunting me. They are protecting me.\n\nFrom the shadows of the hallway, a different shape emerges. It’s taller, wearing a charcoal-grey coat with silver skulls on the lapels. Its face is a polished mask of cruelty, and it carries a heavy Luger that drips with ethereal blood.\n\nThe SS officer steps into the light of my bedside lamp. I remember him now. I remember the basement in that village. I remember the way he begged for his life before I lost my soul and pressed the barrel to his temple after he had already surrendered.\n\nThe ghosts of the camp survivors link their translucent arms, forming a wall between my bed and the man in the grey coat.\n\n\"You saved us at the gate,\" the boy whispers, his hollow eyes finally softening. \"So we stay. He’s been waiting for you to die since the day you pulled the trigger. We're just making sure that when you cross over, he doesn't get to catch you.\"\n\nThe officer lunges, but the woman with no teeth pushes him back with a silent, righteous fury. I close my eyes, the smell of ash fading, replaced by the faint, sweet scent of a Georgia peach."
  },
  {
    "id": "1qq96ih",
    "subreddit": "scarystories",
    "title": "The deadlocked house",
    "author": "crabknucklejoe",
    "score": 67,
    "url": "https://www.reddit.com/r/scarystories/comments/1qq96ih/the_deadlocked_house/",
    "created_utc": 1769694906.0,
    "num_comments": 10,
    "word_count": 941,
    "body": "Mark had been acting strange lately. He said he was okay, so I believed him and chalked it up to his new medication.\n\nIt was little things. Like getting up in the middle of the night and wandering around the house in the dark. Or writing notes and being all cagey when I asked to see. Which is why, when I arrived home with the kids to a locked up house, I wasn't immediately concerned. \n\n\"Mark!\" I shouted between knocks on the front door. \"It's starting to rain! Open the damn door!\"\n\n\"Daddy,\" Little Donny called through the mail slot, way up high on his tiptoes, \"the food's getting wet.\"\n\nI blew out a sigh and cursed under my breath. I glanced over at my eldest, Meggie, who was peering through the front window. \n\n\"You see him?\"\n\n\"I don't know. TV's on. Loud.\"\n\n\"Probably doing something he shouldn't.\"\n\n\"Like what?\" \n\n\"Nothing.\" I shook my head. \n\n\"Mommy!\" Donny sat smiling in a dirty puddle. He had a sodden sheet of paper balanced on his head. \"Look! I'm a boat! Here's my sail!\"\n\nI turned back to my daughter. \"Take your brother back into the car.\"\n\n\"But mo--\" \n\n\"Go. You're both gonna catch a chill.\"\n\nMeggie's face folded with teenage angst. She scooped up Donny and trudged down the driveway back to the car. She clicked Donny into his seat and then was sure to slam the car doors as loud as she could. \n\nBending down, I peered through the mail slot. A long dark corridor flashing blue, green, purple from the TV off in the living room. The staircase ascending up into shadows. \n\n\"Mark? What's wrong?\"\n\nI went to the window to get a good look into the living room. Through a small gap in the curtains I could see the TV lighting up the room. Dark shapes snapped and shifted with the light. Empty. \n\nHands on my hips, I looked over to the car. Meggie was turned around in the passenger seat passing out snacks to Donny from the grocery bags. \n\nI called Mark's phone and the landline. Nothing.\n\nStepping back, I looked up at the bedroom windows. That's when I saw it. A faint silhouette illuminated behind the blinds in the master bedroom.\n\n\\*So he was home.\\*\n\n\"Mark!\" I shouted up. \"This ain't a joke. Let us in!\"\n\n\\*Was he moving?\\* It was tough to say. If he was, it was only slightly. \n\nAnother glance back to the car, Donny was now kicking at the back of Meggie's chair, silent laughter on his face. Meggie's hood up and knees tucked under her chin. It was only a matter of time before the kids would be at eachother's throats. \n\n\\*Christ, why didn't I take a ke--\\*\n\nThe spare key. I rounded the fence and knocked on my neighbour's door. While I waited for Bernie to slowly rise up from his armchair and shuffle to the door, I stared that that shape in the bedroom window. Still there. \n\n\\*What was he doing?\\* \n\nLocks clicked. I shook the concern from my mind and pressed out a smile. \n\nA pale face at war with gravity peered out. Bernie's cold blue eyes chastised me. \n\n\"I'm in the middle of my shows. What is it?\"\n\n\"Sorry,\"--I cleared my throat and straightened--\"we're locked out. I was wondering if we could ha--\"\n\n\"Locked out?\"\n\n \n\nBernie peered out of the doorway at our house. His face, a well-practiced grimace. \n\n\"Yes.\"\n\n\"I thought Mark was home.\"\n\nI sighed. \"He is. Please. The key.\"\n\nThe old boy mutter something under his breath, disappeared then returned with the key. \n\n\"Always a pleasure,\" Bernie said. Though his face conveyed none of the sentiment. \n\n\"Thanks,\" I said, taking the key and turning away.\n\n\"Oh, and before I forget,\" Bernie called out over the hissing rain, \"ask your husband if he's using all that rope. I could do with something to tie back my rose bus--\"\n\n\"Yes. Fine.\" \n\nI was already opening the car door to screams from the kids. Donny was throwing his arms and legs around. His face all red and slick with snot.\n\n\"Mom,\" Meggie whined, \"tell Donny to stop crying.\" \n\n\"What happened?\"\n\nDonny screamed something unintelligible. \n\n\"That dumb piece of paper. He dropped it between the seats.\"\n\nI drew in a breath. Steadied my heart. \"Meggie, take the keys and help get your brother in the house. I'll find this damn paper and bring in the groceries.\"\n\n\"But--\"\n\n\"But nothing, Meggie!\" \n\nShe flinched, then nodded like her head was on a string. \"Okay.\"\n\n\"And while you're at it, tell your father he has some explaining to do.\"\n\nMeggie blinked away some tears, then led Donny up the driveway to the house.\n\nThe anger bled from me while I fumbled an unseen hand between the seats. Gotcha. The small piece of paper pinched between finger and thumb.\n\nLeaning back, I glanced over to the kids. Meggie had opened the door to reveal a yawning square of darkness. She led her brother inside by the hand and helped him out of his coat. Then they both kicked off their shoes and ran towards the shadows calling out for their daddy.\n\nWhatever this shit Mark was pulling, nothing could ruin those little moments of care shared between the little ones. \n\n\\*We raised them good, Momma Bear,\\* I imagined Mark saying.\n\nBlack fingertips. Ink had streamed off the paper onto my hands. I unfolded it--all swollen with rain and clinging to itself.\n\nA note. Words bled off the page.\n\nAnd screams from inside the house. A pain too raw for such little mouths.\n\nMark's message, barely legible:\n\n\\*DO NOT LET THE KIDS SEE WHAT HAPPENED\\*."
  },
  {
    "id": "1qo2y92",
    "subreddit": "scarystories",
    "title": "Mom's FINALLY started eating again!",
    "author": "Trash_Tia",
    "score": 64,
    "url": "https://www.reddit.com/r/scarystories/comments/1qo2y92/moms_finally_started_eating_again/",
    "created_utc": 1769485741.0,
    "num_comments": 5,
    "word_count": 999,
    "body": "The world ended while my Mom was eating a McDonald's cheeseburger. \n\nExtra sauce, extra cheese, extra lettuce. That was always her order. \n\nDouble patty, easy on the mayo, and tonnes of BBQ sauce. McDonald's was always a treat on Fridays. If I ate all my meals for the week, including all my greens, Mom stopped by the drive-thru on the way home and ordered takeout. \n\nI was five, only allowed her cast off pickles, and my Happy Meal of eight weirdly shaped chicken nuggets, soggy fries, and lukewarm chocolate milkshake. \n\nThe problem with kids' meals was that they were too small. \n\nThere was never enough to savor. Never enough to truly be full. \n\nI was a kid, of course I was greedy— of course I wanted the bigger, juicer option. \n\nI hated vegetables and tolerated fruit, and the only none-junk food I *did* like was pasta. I ate every nugget and all my fries, slurping my shake in one brain-freeze gulp. I was still hungry. Gnawing hungry. \n\nPainful hungry. \n\nTummy rumbling hungry. \n\nLunch was too small. Too healthy. Carrot sticks, yogurt, and milk. \n\nIt was a warm day, but the windows were sealed shut. \n\n“Hey, Mommy?” I leaned over in my seat. \n\nMommy’s burger was making my mouth water, the thick smell of meat and mayo suffocating the car. \n\nI remember she was eating like an animal, tearing through every bite, her jaw moving, teeth ripping through the meat. I couldn't take my eyes off of the patty dripping grease through the bread. \n\nHer greasy fingers pawed at the double patty monstrosity sticking out of her mouth. I swallowed thickly. “Please can I have a bite?”\n\n“Mmmph,” was Mom’s only response. No. \n\nI turned to the window instead. Because my tummy was rumbling. \n\nSebastian Atlas was walking with his Mom, the two of them eating ice cream. \n\nI was trying to figure out which superhero was on the back of Sebastian’s backpack, whether it was Spider-Man or Superman, when Mommy made a horrible gagging sound.\n\nI whipped around to see my Mommy choking up the burger all over her lap, her eyes wide, lips parted. I thought she choked on it, but she lurched forwards, her face blooming red like a tomato, a fountain of vomit spewing from her mouth. \n\nPanic froze me in place. \n\n“Mom?” Outside, a familiar cry rang out. \n\nPressing my face against the window, Sebastian knelt next to his mommy, who was on her hands and knees, heaving up watery ice cream. His was on the ground, rapidly melting into a gooey blue mess. \n\nBefore I could see what was happening, Mommy gently strapped me in my seat and crawled into the driver's seat. \n\n“It's okay, baby,” she whispered to me, as we drove through a deluge of people on the ground, vomiting. I sat back in my seat. \n\nMy tummy had stopped rumbling. \n\nBehind us, Sebastian was crying. \n\nThe road was blocked, car doors opening, people stumbling out. Mom spat, swiping at her mouth. “It's, uh, just a bit of food poisoning! Nothing to worry about.” \n\nWhen we got home, I realized it was more than a bad tummy. \n\nI watched Mommy raid the refrigerator, tearing into leftovers and cookies, before vomiting it all back up. She calmly handed me a sandwich and told me to eat it, her eyes glittering with tears. I did. I took three bites, swallowed, and smiled. “It tastes good, Mommy.”\n\nShe nodded and took her own bite, before her whole face twisted and she dropped to her knees, spitting it out. \n\nI didn't fully understand what was happening, but it was clear on the TV. \n\nMommy wasn't the only one who was sick.\n\nWho couldn't eat anything. \n\nMommy cooked meals for me, but never herself.\n\nShe grew thinner, gaunt in the cheeks, protruding eyes that looked straight through me. Mom ate dirt instead. Then cardboard, and stuffing from my teddies. Until one day, a news bulletin flashed up on the TV. But Mom wouldn't let me see it. \n\nShe covered my eyes, but I did manage to see a woman on the screen. \n\nWide eyes and a grinning mouth, she was covered in tomato sauce, red dripping from her mouth and chin.\n\n“I’ve found a way,” she told every news station Mom frantically clicked onto. “I've found a way we can *eat*! I've found a way humanity can finally be saved!” \n\nThe headlines screamed at me. “HUMANITY SAVED!” \n\n*“There's a special digestible protein inside the flesh of—”*\n\nMom turned off the TV.\n\nI grabbed cookies from the kitchen, revelling each one.\n\nSo *yummy*! \n\n“Will you be able to eat soon, Mommy?” I asked. \n\nMommy didn't respond. Instead, she wrapped me into a big hug, cupping my cheeks. “Stay here, okay?” She whispered, her shuddering hands stroking my hair. \n\n“I want you to stay in this spot and not move a muscle.” Mommy was crying. “Do you *understand* me, Primrose?” \n\nI nodded. \n\nMommy grabbed her jacket, and left the house.\n\nI stayed in the exact same spot for hours. \n\nUntil the sky went dark, and my tummy was rumbling.\n\nWhen I started to cry, Mommy came back.\n\nHand in hand with Sebastian Atlas, and a grocery bag full of veggies.\n\nGross. \n\nSebastian smiled, waving at me. “Hi, Primrose!” \n\nMommy locked the door, shut the curtains, and pulled me into a hug. “Sebastian, can you head into the kitchen for me, honey?” She said with a big smile. “There's some chocolate cookies in the cupboard.” \n\nSebastian nodded, running into the kitchen. “Can I have the peanut butter ones?” \n\n“Are you going to eat tonight, Mommy?” I whispered. \n\nMommy was sobbing, shaking, squeezing me tight against her.\n\n“Yes, sweetie,” she said. “Mommy’s going to eat tonight.” \n\nShe slowly took my hands and placed them over my ears, pressing enough pressure to hurt. “Do not remove your hands until I come back,” she whispered, tears filling her eyes. “Understand?” \n\nI smiled, nodding.\n\nI couldn't wait to see Mommy finally eat! \n\n“Yes, Mommy.”"
  },
  {
    "id": "1qs7s9p",
    "subreddit": "scarystories",
    "title": "I Found a New Podcast",
    "author": "donavin221",
    "score": 60,
    "url": "https://www.reddit.com/r/scarystories/comments/1qs7s9p/i_found_a_new_podcast/",
    "created_utc": 1769879021.0,
    "num_comments": 4,
    "word_count": 597,
    "body": "I’m a true crime junky. Guilty as charged, pun intended. I’ve developed a habit of listening to those podcasts on Spotify pretty much anywhere I go, and I think it’s begun to spook my friends a little. They’re just addictive, what more can I say? \n\nIn the car, while I work, while I sleep…okay, maybe it is a bit of a problem. \n\nI’d actually listened to so many that I ended up finishing nearly all of the episodes from my favorite podcasters. This forced me to look for new ones, but alas, none could compare to my sweet, sweet Let's Read podcast. \n\nI’m a bit of a weirdo, so every morning before work, I’ll always queue up music mixed in with my podcasts to last me throughout the day. On this morning in particular, I ended up stumbling across a new podcast that I had some silent hope for. I skimmed through some of the episodes and found that I quite enjoyed the host's voice, as well as their personality. \n\nI decided I’d finish out the episodes I had left from my favorites, and I’d save this new guy for last. I had 6 total episodes for the day, each one being around an hour and 45 minutes long. Perfect. \n\nThe last of the Let’s Read episodes lasted me for a majority of the day, and I didn’t get to the new guy until it was time for the car ride home. The commute to my job lasts about 45 minutes, so I had plenty of time to decide whether or not I was invested. \n\nThe ambience was perfect, the background music was excellent, and the ads were few and far between. One of the benefits of listening to a smaller account, I suppose. \n\nFor the first 25 minutes or so, the host told a fantastic story regarding the JFK assassination and the CIA’s supposed involvement. And that was all it took. I was simply hooked and could not turn my ears off, even if I tried. \n\nAfter a quick, mystic transition, the host launched into his next story. I felt my heart land in my stomach as he spoke. \n\n“Has anyone heard the story of Donavin Meeks? Donavin was a 22-year-old college dropout from the town known as “Gainesville, Georgia.” He led a normal, peaceful life, working to support his loved ones until the afternoon of January 31st, 2026.” \n\nI almost couldn’t believe my ears. This episode aired last week. I didn’t know what I was hearing, but whatever it was, it had to be some kind of joke.\n\nThe host continued. \n\n“On that evening, as Donavin went inside a roadside gas station to pay for a fill-up, a man crawled into his backseat with what appeared to be a heavy object and lay dormant as Mr Meeks, blissfully unaware, pumped his gas and left the parking lot.” \n\nI heard a shift behind me, but I didn’t dare turn around. For the remainder of the car ride, the host went into depth about my own kidnapping, torture, and eventual murder. About how the man stole my car and drove me to a discreet location. How ring doorbell footage showed the unknown man violently pulling me to the backseat of my Kia Optima before climbing into the driver's seat and peeling out of my neighborhood. \n\n“5:47 P.M.” \n\nThat’s what the host claimed was my last time being seen alive. \n\nI’m writing this because I’m now in my driveway. \n\nMy phone says the time is 5:45 P.M. \n\nAnd I can hear heavy breathing coming from my back floorboard."
  },
  {
    "id": "1qmlvpz",
    "subreddit": "scarystories",
    "title": "Mr. Adam",
    "author": "Nessieinternational",
    "score": 58,
    "url": "https://www.reddit.com/r/scarystories/comments/1qmlvpz/mr_adam/",
    "created_utc": 1769354494.0,
    "num_comments": 2,
    "word_count": 345,
    "body": "In early 2015, my wife fainted when the teacher told us a man named “Mr. Adam” had picked up our seven-year-old son Calvin. \n\n“Mr. Adam” was the name Calvin gave to a figure in an oil painting at home, who vanished from the canvas two hours earlier.\n\nAfter contacting the Singapore Police Force, we showed the detective the painting. Mr. Adam had returned, but now with a boy.\n\nThe detective shared similar cases had been reported all over Singapore since 2013. Every missing child eventually returned, though parents never shared how.\n\nWith the detective, we investigated. We went back to the thrift shop in Bugis, then to an orphanage in Ang Mo Kio. The orphanage owner explained the painting was titled *Family Joy*, created by a blind teenage artist who survived a house fire in Yishun that killed his family. During his six-year stay, he painted them from memory.\n\nMr. Adam was his father.\n\nWhen the orphanage sold the painting in 2013 to raise funds after his death in 2012, every buyer returned it, after their child vanished. The child reappeared once the painting was sold again.\n\nQuickly, we put the painting up for sale. EBay, Carousell, Shopee and every online marketplace place we could find were not spared.\n\nBut every interested buyer had children.\n\nThat is, until the National Museum of Singapore contacted us. They were collecting Singaporean items in celebration of the nation’s 50th birthday. The orphanage owner further sealed the deal by explaining the painting‘s history, omitting the child disappearance part.\n\nAfter a bit of confusion over the fact we were selling the painting for 2 dollars , the painting officially entered the National Collection.\n\nWe silently thanked God that the director was a lifelong celibate Catholic priest. The detective said that if the sale works, the case would be closed as a temporary disappearance.\n\nMoments later, we ran to the museum’s front desk after an announcement echoed through the speakers:\n\n“Attention visitors. Our staff has found a lost seven-year-old boy named Calvin. Will his parents please come to the front desk.”"
  },
  {
    "id": "1r0uge5",
    "subreddit": "nosleep",
    "title": "Every year on my birthday, I am trapped in the family labyrinth. (Part 4)",
    "author": "BadandyTheRed",
    "score": 57,
    "url": "https://www.reddit.com/r/nosleep/comments/1r0uge5/every_year_on_my_birthday_i_am_trapped_in_the/",
    "created_utc": 1770708737.0,
    "num_comments": 6,
    "word_count": 994,
    "body": "Part 3. Part 5.\n\nI walk down the path I chose. I lost track of time, but it feels like almost an hour has passed and no change, nothing along the way. No other paths to run down, no voices, no traps. Just monotonous travel. I consider turning back but it's pointless, I have gone too far at this point.\n\nFinally I emerge in a familiar junction. I look up and see four paths with marks on the ceiling and the designs make me fear something horrible. I turn around and walk a few paces back and see that despite the nearly hour long walk in one direction, the path leads back to the small tunnel and the watery deathtrap. Somehow I have ended up right back at the space I started!\n\nI try to quell the rising dread in my mind. I cant keep wandering aimlessly, I have no food or water and the idea of sampling the fetid liquid from the last area is not appealing.\n\nI have to keep moving, I need to find a way out of this. I start heading down the path to the left. One of these halls has to lead somewhere else.\n\nI trudge on for several minutes and the everpresent sound of my feet echoing of the stone starts to become softer, then almost muted. I look around and feel an enveloping, almost suffocating aura in the air.\n\nThe worst part, is that it feels like that aura has a source and I am walking directly into it. There is an abyssal darkness yawning before me, taking up the entirety of the hall and absorbing all of the dim light that tries to penetrate the space beyond. I look back over my shoulder and see the way I came from is darkening too.\n\nI have seen this phenomenon before, two years ago. I found a different path and avoided it back then. The blackouts are not technically life threatening by themselves, but the danger of what could strike while blind and alone is ever-present.\n\nThough I am concerned for a different reason, the darkness never moved like this before. It has already obscured the way I came from. I have no choice but to move on, walking slowly and with arms outstretched to keep myself from smacking straight into a wall or something worse.\n\nI stumble in the dark for a while, fearing to walk any faster than the pace I feel safe going. Then as I walk, I hear it, a slow whisper is just barely perceptible. It sounds far off, but I know it will get closer. I wish I had something like earplugs to block the sound, the sound of what comes next.\n\nI place my hands over my ears and try to keep the creeping sounds of the voices out of my head. Voices of family that have been lost. Each voice calling out to me specifically, begging for help, crying in torment or in some cases, just crying hopelessly. I start to hear the panicked cries silenced, I hear groans of pain, shrieks of agony and the sounds of bodies being mutilated and destroyed.\n\nI shudder as I consider whether these awful sounds are really them, or if it is some horrible trap meant to break the will of those the labyrinth torments, neither is comforting.\n\nI am able to ignore all the voices, until I hear her. It's Lydia, my sister. I hear her speaking clearly, much more clearly than the other voices. Rather than pleading for help or crying she sounds angry and forlorn, she does not ask for help, she warns me,\n\n“Brother you must leave now! Find the way out, do not linger. Do not search for the Ouroboros, do not seek the hidden chamber. Something terrible will happen. You cannot go in there...”\n\nI stop moving and the voice sounds so much like her I whisper instinctively,\n\n“Lydia, is that really you?”\n\nNo response. Of course not it has to be the vindictive forces that live in the labyrinth, they can sound like lost family members. At least the other voices did, but Lydia sounded...different. It really seems like she was warning me.Why would she not want me to find the hidden chamber? Why would she not want me to break this curse and free the entire family from this endless nightmare?\n\nAs I dwell on the disturbing encounter I am relieved to see the faint illumination of the walls beyond and the abyssal darkness of the hall diminishing. I can finally see clearly again.\n\nI take a deep breath of stagnant air and relax a bit. I am tired, thirsty and hungry but at least I can see. I move to a T junction and am relieved to find I did not wind up back where I was before. Though now I have to decide what direction to go again.\n\nAs I consider which way to go, I see something. It looks like a strangely phosphorescent footprint near the corner of the hall to the right. It's smaller than my own, but who could it be? Then I see a small strand of long hair by the same wall. I am surprised again, someone else has been here. More evidence of another family member. I don't know if this is a trick or not, but I consider how real Lydia’s voice sounded. I look at the hair and see it's a long lock of red hair, just like hers was.\n\nI start to wonder, then I start to hope. I know it can't be, but a part of my mind starts to believe it could be possible. Maybe she could still be alive somehow?\n\nI have to decide which way to go. I will have to be careful and watch out for any traps, but I feel like I can't pick any other way now.\n\nI go right and pray it's not a mistake."
  },
  {
    "id": "1qs5ouy",
    "subreddit": "scarystories",
    "title": "Have You Seen Lily Finch?",
    "author": "BrennanCorzine",
    "score": 56,
    "url": "https://www.reddit.com/r/scarystories/comments/1qs5ouy/have_you_seen_lily_finch/",
    "created_utc": 1769874313.0,
    "num_comments": 1,
    "word_count": 867,
    "body": "For as long as I can remember, people have brought up a person named Lily Finch. I finally met her.\n\nWhen I was thirteen, there was this girl in my class. I don’t recall her name. She would always sit there and daydream.\n\nAfter a while, one of my classmates walked up to her.\n\nIn the days that followed, she grew more outspoken.\n\nEventually, after a few weeks of this behavior, she began raising her hand—not to answer questions, but to ask her own.\n\nWho is Lily Finch?\n\nAfter that, she began showing up less and less.\n\nThe last time I remember seeing her was sometime in February of 2016.\n\nShe looked… emaciated. Dark circles clung to her eyes, and the blue they once were had dulled into a dark, sickly green.\n\nA few weeks later, she was found in a ditch.\n\nApparently, the cause of death was cerebral hypoxia. Or at least, that’s what the rumors said.\n\nThe day after she was found, the principal came over the intercom and encouraged students to visit the school counselor.\n\nNobody did.\n\nThat was ten years ago. Since then, I’ve only heard the name “Lily Finch” every so often—but the context always changes.\n\nI heard it again two weeks ago while grabbing coffee before work. Two women were talking behind me, and I couldn’t help but overhear part of the conversation.\n\n“The Finch’s girl came by last night.”\n\nThe details aren’t important. What matters is how casually they said it. As if Lily Finch were a given. As if she’d always been part of this town.\n\nShe’s ingrained herself into this town.\n\nBut there has never been a Finch family in Jackson County.\n\nThe same night I bought that coffee, around 10 PM, I was waiting for a pizza. Music played in the kitchen—some random playlist a friend had sent me. Money sat on the counter for the driver. The forecast called for a bad winter storm later that night.\n\nA knock at the door.\n\nI sprang up and looked toward the front entrance. The porch light flickered a few times before staying on.\n\nI grabbed the cash, assuming it was the delivery guy. Before opening the door, I peeked through the curtains.\n\nNobody was standing there.\n\nI opened the door. Nothing. I put the cash in my pocket and took a step outside. It was a new moon—no ambient light, just the porch light humming beside me. The wind struck my face carrying the snow with it. \nThe mailbox flag was raised. I started walking towards it and nearly slipped a few times before finally reaching it. An envelope. No return address. No stamp. Sealed.\n\nI took it back inside, sat at the table, and opened the envelope. \nI unfolded it. It simply read “See no evil”\n\nThe handwriting had no flaws. Not typed. Not printed.\n\nI noticed something out of the corner of my eye—but before I could focus on it, there was another knock at the door.\n\nThis time, before opening it, I grabbed the bat leaning against the wall and kept it at my side. I pushed the curtain aside.\n\nThe pizza guy.\n\nI opened the door, fumbled with my pockets, tipped him, and took the pizza inside.\n\nAs he turned to leave, I caught a reflection on the icy path beside him.\n\nA girl.\n\nLong black hair. Sunken eyes. Too thin.\n\nShe was standing just out of the porch light.\n\nI quickly shut the door, locked it, and set the pizza on the table.\n\nThe bat slipped from my hand and rolled across the floor, stopping just short of the door. \nI moved toward it slowly.\n\nThe porch light cast a sickly green hue across the floor, stretching to my feet—then creeping forward, inch by inch, toward the doorway.\n\nAs if it were leading me outside.\n\nA faint hum came from outside the door. The closer I got to the bat, the louder it grew.\n\nI reached it, knelt down, and wrapped my fingers around the handle. I couldn’t help myself and peeked through the curtains.\n\nOutside—on the path—stood the girl, her back to the house.\n\nSomething compelled me to open the door. I stood in the doorway, the bat hanging loose in my hand, watching her.\n\nShe didn't turn. After a moment, she stepped forward—into the storm. The blizzard swallowed her whole.\n\nI shut the door and locked it. I walked back to the kitchen. My pizza sat there, cold. A second note lay on the pizza box. One that wasn't there before. I unfolded it. \n“Hear no evil”\n\nThat was two weeks ago.\n\nFor fourteen nights straight, I’ve heard things moving around my house. Not loudly—just enough to notice. Just enough to make sleep impossible. I don’t know how to stop it.\n\nToday, I was at a restaurant with a friend. I asked him about Lily. He hesitated before asking, \"Did you see her?\"\n\nI waited a moment before answering. \"Yeah. Why?\"\n\nHe reached into his pocket, pulled out a hundred dollars in cash, set it on the table, and walked out.\n\nWritten on the dollar: \"**Speak no evil**.\"\n\nNow I'm writing this asking one simple question.\n\nHave you seen Lily Finch?"
  },
  {
    "id": "1rc0tx0",
    "subreddit": "scarystories",
    "title": "Don't pull me out",
    "author": "Pitiful_Emu_9629",
    "score": 55,
    "url": "https://www.reddit.com/r/scarystories/comments/1rc0tx0/dont_pull_me_out/",
    "created_utc": 1771801945.0,
    "num_comments": 2,
    "word_count": 202,
    "body": "Don't pull me out\n\nThey found him buried upright in the mud, only his head and shoulders free. Rain still fell, soft now, like it was ashamed of what it had done.\n\nThe rescuer reached for him.\n\n “We’ve got you, sir. You’re safe.”\n\nThe man didn’t move.\n\nAnother rescuer tried gently. \n\n“If we pull you out now, you’ll live. Please.”\n\nHe shook his head, mud cracking on his face. \n\n“No.”\n\nThey thought he was in shock.\n\n“You can’t stay here,” one of them said.\n\n“The ground could give way again.”\n\nHis voice broke. \n\n“I know.”\n\n“Then why won’t you let us help you?”\n\nHe swallowed, eyes fixed somewhere far away. \n\n“Don’t pull me out… both my daughters are holding my hands.”\n\nSilence.\n\nThe rescuers looked down.\n\nHis arms disappeared straight into the mud, buried to the shoulders. There was no space. No air. No way anyone could be alive down there.\n\nOne of them slowly lowered his voice. \n\n“Sir… your daughters—”\n\n“They’re right here,” he said, tightening his grip beneath the mud. \n\n“If I let go, they’ll be alone.”\n\nNo one pulled him.\n\nWhen the rain started again, harder this time, they backed away.\n\nThe mountain took all three of them together."
  },
  {
    "id": "1qyfc3k",
    "subreddit": "scarystories",
    "title": "The story of how I came back from the dead to join the living",
    "author": "1000andonenites",
    "score": 55,
    "url": "https://www.reddit.com/r/scarystories/comments/1qyfc3k/the_story_of_how_i_came_back_from_the_dead_to/",
    "created_utc": 1770474908.0,
    "num_comments": 11,
    "word_count": 924,
    "body": "# I was eight when I became a ghost, rising from the shallow grave where my stepfather had buried me in the woods behind our house. \n\nI still remember the moment of my murder.\n\nI knew it was coming. You can sense when you are the object of hate, right? Like a big black hot ball of energy coming at you, ready to crush you. I knew he was going to hurt me. The way he looked at me. The way he never said my name. The way he seemed to bump up against me - he had made me fall a few times, once down the stairs, but I had not been seriously hurt. Just bruises.\n\nAnd then one day, my mother was out. I had tried not to be alone with him but he cornered me in the kitchen. I was at the fridge, scrounging around for something to eat.\n\nThe last thing I remembered was his eyes as he lunged in for the attack. There was a flash of horrible pain, and I heard myself scream. I tasted blood. Then everything went dark. The last thought I had was \"welp, now I'm dead.\"\n\n\\*\\*\\*\n\nAnd when I opened my eyes, I knew I had become a ghost, and my first thought was \"Now he can't hurt me anymore\". I knew humans couldn't touch ghosts, so I was happy to be one.\n\nI stood over the grave he had dug for me and thought about what to do. Ghosts go back to the places they live, and so I went back to the house. There was nowhere else for me to be.\n\nI didn't go in. Even though I knew as a ghost he couldn't hurt me, I didn't want to be seen. I went straight into the basement. That seemed like a good place for a ghost. I made myself a sort of hidey place in the back, and stayed there.\n\nTime passed.\n\nSometimes I would go up in the dead of night, poking around in the kitchen.\n\nThen one night I crept up to their bedroom and stood at the foot of their bed. My mother jerked out of sleep, sat up, stared at me, and then screamed and screamed. I fled back to my hidey hole in the basement. I never tried going up again.  \n\nThey left that house soon after and others came. But they didn’t stay long either. As much fun as it is to imagine haunted houses, it actually isn’t fun to live in one. And so families came and went, and I grew more forgetful about how living humans do things. \n\nI look back to those years as if in a dream now, my ghostly existence flitting through the house, the basement, and the woods. Time lost its meaning for me.  \n\n\\*\\*\\*\n\nUntil Lily and her family came. Lily was often ill, and couldn’t get out and run around like others. I heard it whispered through the walls that she may not live much longer. I wondered if she would become a ghost like me, perhaps joining me in my basement home, creeping up to the kitchen and out into the woods every now and then. It wouldn’t be terrible to have a companion in the dark and dreary basement.  \n\nSo, despite what had happened those years ago, when my mother sat up in bed screaming and screaming, her mouth an open black hole of suffering and misery, I decided to visit Lily in the bedroom where she lay in bed. \n\nLate one night, I crept up to her room, and quietly laid my hand on the doorknob and swung it open. I heard Lily restlessly move, and then sit up.  \n\nShe stared at me in the dim night glow. I waited for her to scream. But she didn’t.\n\nInstead, she said quite clearly “I heard it was little boy who haunted this house. But you are a young man.” \n\nNobody had spoken to me for so long. I frowned, trying to understand her words.  \n\nShe spoke again. \n\n“Who are you?” she asked . \n\nI understood that one. “I am Daniel. A ghost”. It had been years since I had spoken, but the words were coming to me. I remembered becoming a ghost. \n\nLily got out of bed, and walked towards me. “Daniel?” \n\nShe reached out, took my wrist, and holding it tight, turned me to a large shimmering mirror against the wall. I saw myself, a lanky pale young man looking back at me. I was so confused.  \n\nI turned back to Lily. Memories and futures started running through my mind.  \n\nLily said quietly “You’re not a ghost Daniel”. \n\nI can still remember the warmth of my tears on my cheeks as they squeezed out of my eyes. I closed my eyes briefly, remembering the time I thought I became a ghost, opening my eyes, seeing the flecks of blue-black night sky and stars through the loose earth over me. My hands, scrabbling through and pulling me out.\n\nI remembered the cool air on my face as I crawled out of my grave and started walking home, covered with dried blood. \n\n“You’re alive” said Lily, and I was, I was there in her room, looking into a mirror at myself, a young man. A car drove by outside, its bright lights shining into the room and lighting up my face.  \n\nLily sat me down next to her, on the edge of the bed. \n\nWe began talking. \n\nAnd I never lived as a ghost again."
  },
  {
    "id": "1r1t1om",
    "subreddit": "nosleep",
    "title": "The shadow on my ceiling",
    "author": "PenguinMonstrosity",
    "score": 51,
    "url": "https://www.reddit.com/r/nosleep/comments/1r1t1om/the_shadow_on_my_ceiling/",
    "created_utc": 1770802826.0,
    "num_comments": 3,
    "word_count": 811,
    "body": "I was hellbent on getting my deposit back once I move out of this place so I made sure to take pictures of everything on the day I moved in. That’s how I know, it wasn’t here back then. I needed to make sure, because I felt like I was losing my mind, but looking at the pictures it’s true. The shadow is new.\n\nI first noticed it a week ago. I turned off the TV, since I was done with the movie I was watching. I laid back and closed my eyes. When I opened them back up, I saw it. A small dark spot at the ceiling of my apartment. About 5cm in diameter. It was pretty much the same colour as the surroundings, but a couple shades darker.\n\n My first thought was water damage, so I took a picture and called it in immediately. I asked the person living above me if they’ve noticed anything, but apparently, they hadn’t. They even showed me the spot directly above it at their place. Nothing out of the ordinary.\n\nI waited a couple days and the stain began to grow. I felt like it was about as large as my face at this point. My landlord hired someone to investigate potential water damage, but according to them, there was none. So here I was, perplexed. I decided to keep monitoring it. Maybe I was doing something that was causing this stain to grow without knowing it?\n\nIt grew by a lot. But not in a circular shape. It grew, like it was trying to resemble something specific. I grabbed a ladder to see if I could remove it somehow. It was dry to the touch. I used five different cleaning agents and made sure to have them soak into the ceiling. Once it dried it looked exactly the same as before, Larger though I guess. It was still growing.\n\nThe next day, when I turned off the light, I couldn’t see it anymore. Sure, it was \n dark, so maybe that’s it. But it didn’t feel like that was it. It felt like it wasn’t there anymore in the dark. I couldn’t make out the colour at all.\n\nI turned the light back on and I swear it was not in the same spot as before. It hadn’t moved much, one centimetre at most, but with how much I’ve investigated it the past couple days I could see the difference. I decided to leave the living room lights on.\n\nThe next morning, walking into the living room, I could tell what it was immediately. A human shadow. It looked like it was stuck in the middle of doing a jumping jack. It was still in the same spot though, so leaving on the light must’ve been a good idea.\n\nIt was freaking me out too much now, so I decided to get help one more time. When I left the living room though, I instinctively turned off the light. The curtains were still drawn, so the room was now completely dark. Just as I realized what had happened, I felt something bite my foot from behind. I immediately turned the light back on and looked at the shadow. It was gone.\n\nIt wasn’t gone. Looking down at my foot, I could see it, now on the floor, with my foot standing on top of it. I reflexively moved away. It was still in the same position as before. Stuck in the middle of doing a jumping jack.\n\n I ran, but only after making sure that all the lights in the apartment were on. I called some friends and had two of them agree to come back with me. I was grateful for that, because I knew how crazy I probably sounded.\n\n I was shaking when I put the key in the door, but I pulled myself together and opened it. Darkness. The lights were not on anymore. I could see sparks coming from the breaker box and the apartment was completely black.\n\nI stepped in with one foot expecting the worst, but nothing happened. I continued inside. Thankfully turning on the switches in the breaker box turned the lights back on.\n\nWe searched the entire apartment but the shadow was gone. We checked behind every piece of furniture, any place we could have missed but nothing. I haven’t gone back to the apartment since.\n\n I’m currently staying at a hotel, keeping the lights on of course. Looking back at it, it doesn’t feel real. But I can still see the shadow on the image I took for my landlord and the bitemarks on my foot are as real as it gets. I don’t know how to continue now.\n\nMaybe one of you has some idea? Some knowledge on what this thing might be? One thing for sure. I’m not going back there."
  },
  {
    "id": "1qtmowk",
    "subreddit": "scarystories",
    "title": "Who did you let in?",
    "author": "Guyonthought",
    "score": 47,
    "url": "https://www.reddit.com/r/scarystories/comments/1qtmowk/who_did_you_let_in/",
    "created_utc": 1770011059.0,
    "num_comments": 0,
    "word_count": 855,
    "body": "The elders said winter thinned the veil.\n\nCold made old things hungry.\n\nThat was the lore you grew up with when you lived near the reservation, stories traded quietly at gas stations, warnings disguised as jokes. Don’t whistle at night. Don’t answer your name if you hear it outside. And never trust what looks like something you love.\n\nThe Mitchells knew the stories. Everyone did. But stories felt smaller inside a warm house, with the heater humming and the kids tucked in.\n\nThat night was ordinary until it wasn’t.\n\nSnow pressed against the windows like frostbitten fingers. Their daughter had fallen asleep first, curled around her stuffed bear. Their son followed, his breathing deep and even beneath a space-themed blanket. The house settled into that soft nighttime quiet—pipes ticking, wind brushing the siding.\n\nOutside, somewhere too close, a dog began barking.\n\nNot playful barking. Not warning barking.\n\nThe kind that cracked and broke between breaths.\n\n“Do you hear that?” Sarah asked from the hallway.\n\nMark nodded, already uneasy. “Probably coyotes again.”\n\nThey’d heard them before. Everyone had. Shadows slipping between trees, laughter that wasn’t laughter. You learned to explain things quickly out here.\n\nStill, the barking didn’t stop.\n\nIt went on too long. Too desperate.\n\nThen it cut off.\n\nSilence rushed in to replace it, thick and heavy.\n\nMark frowned but said nothing. Sarah kissed their son goodnight and turned off the light. Routine was armor. You didn’t give fear room to stretch.\n\nMark clicked the door lock and called Bear over, he opened the sliding glass door.\n\n“Alright, buddy. Last call.”\n\nTheir dog trotted past him into the snow, black fur swallowing the porch light. A big shepherd mix, loyal to a fault. He loved the cold. Loved bouncing across the yard like it was his own private tundra.\n\nMark closed the door and pulled the drapes halfway, leaning against the wall and scrolling his phone. This was their ritual. Bear would do a lap, sniff the fence, maybe check the trampoline, then come padding back. Mark would see the dark blur through the glass and let him in.\n\nAlways the same.\n\nOutside, wind whispered through bare branches.\n\nMinutes passed.\n\nMark looked up.\n\nMovement.\n\nA smear of black fur slid past the drapes.\n\n“There you are,” he muttered.\n\nBut something felt…off.\n\nHe pulled the curtain aside a little more.\n\nBear wasn’t coming toward the door.\n\nHe was walking toward the trampoline.\n\nMark sighed. “Seriously?”\n\nHe waited. Gave him time.\n\nThen he opened the curtain fully.\n\nBear stood still near the edge of the yard, body rigid. His head tilted slightly, ears pricked forward. He wasn’t sniffing the ground. Wasn’t pacing.\n\nHe was staring.\n\nNot at the woods.\n\nAt the house.\n\nSpecifically—at the dark window beside the sliding door, the reflection.\n\nMark tapped on the glass.\n\n“Hey. Come on.”\n\nBear didn’t move.\n\nTap tap.\n\nBear’s ears flicked. Slowly, he turned his head and looked directly at Mark through the glass.\n\nThe look made Mark’s stomach drop.\n\nNo wag. No excitement. No recognition.\n\nJust a flat, assessing stare. Curious. Empty.\n\n“Bear?” Mark whispered.\n\nHe knocked harder.\n\nThe dog finally moved, padding toward the door with stiff, measured steps.\n\nRelief loosened Mark’s chest, until something else moved.\n\nFrom the side of the house.\n\nAnother shape.\n\nBlack fur.\n\nSame size. Same gait. Same familiar silhouette.\n\nThe second dog stepped into the porch light.\n\nMark’s breath caught in his throat.\n\nThe two dogs stopped inches apart.\n\nThey sniffed each other.\n\nNot aggressively. Not confused.\n\nLike this was normal.\n\nMark’s hands shook as he slid the lock shut with a sharp click.\n\nSarah appeared behind him. “What’s wrong?”\n\nHe didn’t answer.\n\nOutside, two identical Bears turned toward the door.\n\nBoth sat.\n\nBoth waited.\n\nPerfectly mirrored.\n\n“Oh my God,” Sarah whispered.\n\nThey knew.\n\nEveryone knew.\n\nSkinwalkers didn’t rush. They copied. Learned. Observed.\n\nThe dogs’ heads snapped toward each other in unison.\n\nA low growl rippled through the air.\n\nThen chaos exploded.\n\nFur and teeth collided, snarls ripping into the night. Bodies slammed into the trampoline, into the fence, into the snow. One yelped, high and terrified, then snapped back with savage force.\n\nSarah screamed.\n\nMark slammed his fist against the glass, useless.\n\nThey watched their dog fight itself.\n\nThey didn’t know which one to root for.\n\nBlood sprayed dark against the snow.\n\nOne dog went down, throat torn open.\n\nThe other stood over it, chest heaving, eyes burning.\n\nThe victor limped toward the house.\n\nToward them.\n\n“Mark…” Sarah sobbed. “What do we do?”\n\nThey looked at the dog’s wounds. Deep. Defensive. Protective.\n\n“He fought,” Mark said hoarsely. “Our dog would fight.”\n\nThe thing outside whined softly.\n\nJust like Bear always did when he was hurt.\n\nThey opened the door.\n\nThey shouldn’t have.\n\nThey carried the bleeding dog inside, laid him on the kitchen table. He didn’t resist. Didn’t growl. Just watched them.\n\nWatching too closely.\n\n“Get the first aid kit,” Mark said. “Bathroom. Hurry.”\n\nSarah ran.\n\nWhen she came back, she dropped the kit.\n\nMark was against the wall.\n\nHands, wrong hands, bending the wrong way, wrapped around his throat.\n\nThe thing wearing Bear’s face smiled.\n\nWho did you let in?"
  },
  {
    "id": "1qzvm1a",
    "subreddit": "scarystories",
    "title": "The Only Time I Ran From a Job",
    "author": "Reasonable_Mark_747",
    "score": 42,
    "url": "https://www.reddit.com/r/scarystories/comments/1qzvm1a/the_only_time_i_ran_from_a_job/",
    "created_utc": 1770614402.0,
    "num_comments": 1,
    "word_count": 757,
    "body": "I’ve been sitting on this story for years because it still creeps me out and comes back to me every now and then\n\nA few years back, when I was just starting my environmental inspection business, I was doing everything myself. I lived in Westchester County at the time but wasn’t from there. Money was tight — I’d dumped everything into equipment and was running ads on everything, trying to get any client that would pay.\n\nBecause I was desperate, I’d take pretty much any call. \n\nNormal setup: client calls for an inspection, we agree on a set price upfront, I show up, do the work, deliver the report, get paid. \n\nOne afternoon I get a call from way out — like 2.5 hours from my place. They say they have a strange odor in the house, suspect mold, and they need someone today. I’m thinking it’s too far, but they immediately agree to the full price and push for me to come right now. I’m like… alright, I need the money. I tell them I can be there by 6 p.m. It’s around 3 when we hang up.\n\nI tell my wife I’m working late and head out. About 35–40 minutes before I even reach the area, my phone loses all signal. No bars, no data, nothing. I’m in the middle of nowhere woods. I finally find the turnoff after getting lost a couple times — no real address, just vague directions. I pull up and this older guy steps out from the trees and waves me over like he was waiting. “This way,” he says.\n\nThe house looks like it hasn’t been touched since the 1960s. The couple is straight out of a time capsule — weird flannel shirts, thick old-man glasses, pants that don’t quite fit right. The wife stares at me as I get out of the car, and the guy goes, “Oh, he’s a tall one.” She doesn’t smile or anything — just this disappointed look, like I wasn’t who she expected.\n\nThey barely talk. No “come in, let me show you around,” no chit-chat about the problem like 99% of clients do. They just stand there staring, door left wide open. I ask where the smell is coming from. They point behind me to the bathroom without saying much.\n\nI go in, set up my equipment. They’re just… standing behind me. Whispering to each other. Then the guy says, “Actually, it’s coming from the basement. Can you check that?”\n\nSure. I grab my stuff and follow them. They lead me to what looks like a normal hallway cabinet. It opens — and there’s a hidden door behind it. Already weird. I say, “After you.” They both go, “No, no — you go first.” I hesitate, but figure it’s their house, maybe they’re just old and don’t like stairs. I go down.\n\nThe stairs are spiral. Tight. Steep. One full turn… then another. The house looked like a single-story ranch from outside. Now I’m easily two stories underground and it’s still going. The air gets colder, heavier. My neck hairs are standing up — I’m not someone who usually gets spooked, but this felt wrong.\n\nLast few steps: I see a heavy door at the bottom. Slightly ajar. And the biggest padlock I’ve ever seen — on the outside of the door. Like it’s meant to keep something inside. That’s when my body went full alarm mode. Heart pounding, everything slowed down, adrenaline like I’ve never felt.\n\nI spin around fast. They’re right behind me — inches away. I shove past along the railing, yell something about needing a tool from upstairs, and bolt. Three steps at a time. The guy stumbles a little. I sprint through the house, out the front door (still wide open), jump in my car. Thank god for push-button start — I duck low, floor it, and peel out.\n\nThey never came after me. Door stayed open. No one chased. No shots. I drove straight home — didn’t stop for three hours. They never called back. Number didn’t work the next day. No review, no follow-up, nothing.\n\nI still don’t know what was behind that door. I don’t want to know. I just know something was deeply off.\n\nMy point for the young people starting a service business : trust your instincts, especially when you’re alone in the middle of nowhere with people who won’t walk down their own stairs first. And maybe don’t take jobs 2.5 hours away just because you’re desperate when you’re starting out."
  },
  {
    "id": "1r86fth",
    "subreddit": "scarystories",
    "title": "\"The Black Kitty\"",
    "author": "Which_Republic4558",
    "score": 42,
    "url": "https://www.reddit.com/r/scarystories/comments/1r86fth/the_black_kitty/",
    "created_utc": 1771429507.0,
    "num_comments": 4,
    "word_count": 524,
    "body": "He beats her every morning and every night. He yells at her and shatters her from within but she won't leave him.\n\nShe's always covered in bruises, cuts, and scratches because of him. \n\nI saw a lot of bad injuries on other animals when I had no home but I've never seen anything as bad as what he does to her. \n\nI know that I'm only a kitten but even I can recognize the dysfunction. Human relationships seem quite complicated. \n\nI'm glad to be only a mere kitten so I don't have to handle such complications. \n\nI can't help but feel bad for her. She seems like a sweet lady.\nHer smile beams of innocence. Her light green eyes express so much care. Her gentle hands took me off of the streets and she is attempting to give me a good life. \n\nShe's the only human to touch me with pure intentions. The only voice that has ever soothed me. \n\nShe also protects me from the mean man and tries to hide me from him so he won't hurt me. \n\n\"No! Stop!\" \n\nWatching her scream as tears drip out of her eyes is not a lovely sight. Watching this happen to her every night is a ugly thing to witness every night. \n\nShe saved my life by taking me off of the streets. I was very hungry and thirsty. I was also all alone. She found me in the dark and brought me to her home. Perhaps I should return the favor. \n\nI hide my small body as I watch him hurt her. Once he finishes, he walks away with his bottle full of foolish substances. \n\nI quickly run over to the steps that lead to the basement. He always goes into the basement. The door being unlocked is perfect for my plan.\n\nI use my tiny mouth to grab a object. I carefully place it onto the steps. It's big enough to make him trip. \n\nHe won't ever hurt her again.\n\nI run towards her after setting up his demise. \n\nMy tongue licks her as I let out gentle purs.\n\nFeeling her gentle hands pet me and feeling her run her fingers through my black fur is such a tender feeling. \n\nHearing laughter escape from her mouth and seeing her lips create such a beautiful smile is heartwarming.\n\nThe wholesome moment comes to an end when she hears the loud sound of that evil man falling. \n\n\"Babe!! Are you okay?\" \n\nShe starts to yell that question over and over. \n\nHer body starts shaking as her eyes carry a clear look of fear. \n\nShe walks over to the basement and comes to a realization. \n\n\"He's dead.\" \n\nTears slip out of her eyes as a relieved smile appears on her face.\n\nI'm young but I know that sometimes killing is necessary for survival. \n\n\"Some people say that black cats are bad luck. You, my kitty, you're the best thing that's ever happened to me.\" \n\nI saved her because she saved me. I have also grown quite fond of her. \n\nI'm excited to live a life with her as my owner and me as her pet."
  },
  {
    "id": "1qte533",
    "subreddit": "scarystories",
    "title": "A Catholic Priest Keeps Appearing on Trail Cam",
    "author": "Sea-Marionberry-1089",
    "score": 37,
    "url": "https://www.reddit.com/r/scarystories/comments/1qte533/a_catholic_priest_keeps_appearing_on_trail_cam/",
    "created_utc": 1769987769.0,
    "num_comments": 1,
    "word_count": 855,
    "body": "I work for an emergency response contractor, killing birds infected with avian flu. We had the beginnings of an outbreak near a farm in Northwestern Texas, so I was sent down to try to minimize further potential harm. I'm usually sent out with a team of 2 or so guys, but due to the size of the farm and the time of year, my boss felt that one of us could handle the job.\n\nI'm staying in a cabin about a quarter mile from the farm, with a trail cam set up about 500 yards away to potentially get a look at any migratory birds (uncommon this time of year, but protocol nonetheless). On my first night, I was so tired I went right to sleep, deciding I'd review the cam footage in the morning and scout the woods if necessary. When I woke up yesterday morning and checked the trail cam footage, I saw something entirely new, something I still can't believe was real.\n\nAbout 3 hours into the recording, at exactly 2:38 AM, a figure is seen in the woods' shadows. He stands there for about 10 minutes doing nothing, then after 10 minutes, he raises his arms in the air and holds them up for 7 minutes. After seven minutes, he approaches the camera. I haven't been to church since I moved away from home, but I recognized this man immediately as a Catholic priest. He held his hands in the air and walked directly to the camera. Once he reached the camera, he dropped down to his knees, made the sign of the cross, and knelt there with his mouth open like when you're waiting for the Eucharist. He stayed like this until 5:50 AM, and then he stood up and, without any ceremony, walked back into the woods.\n\nI felt like this had to be some kind of practical joke, but this was like no joke I'd ever seen before. I mean, what the fuck is this? Something to frighten or confuse me? \n\nAfter getting ready, I went to the farm with the clip of the priest ready on my phone to show the guys working, but when I arrived at the farm, no one was there, just the chickens. I waited all day, and I called the managers, but nothing. I eventually called my boss, who did answer. I told him that nobody was here, and he said he would try to figure it out. Before hanging up, I told him about the priest. He didn't have much of a clue what was going on, but recommended that I just leave it be. The farm felt eerie, all empty. As I wrapped up my day, I swung the trail cam to swap SD Cards, and when I did, I noticed footprints and knee imprints in the mud. \n\nLast night I couldn't sleep. I lay in bed with the trail cam pulled up on my phone. 2:38 rolled around, and he appeared. Just out of view, he stood there, the camera capturing the white parts of his attire. He did the same procession and then knelt down. I watched for an hour, waiting for him to do something. Eventually, it clicked that I could likely see him from my cabin.\n\nI grabbed my flashlight and tried to shine it through the window at the trail cam, but couldn't quite get it. After a second of doubt, I poked my upper body out of the door and shone the light, and there he was. My eyes were switching between him and my recording of him on the trail cam. From the footage, I could see his eyes move. He never turned his head, only his eyes. I called out to him, told him it was private property. He just kept watching me.\n\nFor some reason, I can't even tell you now, I started walking at him, not much, just a little. I had my eyes on him, not the phone, and when I finally looked down at the phone, I was about one hundred yards from him. On the screen, I saw his mouth had been pulled upward into a contorted smile. He was drooling profusely and panting heavily, still viewing me only from out of the corner of his eyes.\n\nWhen I saw his face, I sprinted back to the cabin, locked the door, and sat by the window so I could see out and know if he approached. I stayed up the whole night. \n\nI don't know why I didn't, but I stopped looking at the trail cam. I think I was just so goddamn scared. This morning, I looked and realized that the moment I turned and ran was when he closed his mouth and finally turned his neck, looking at my cabin with the most furious face I'd ever seen. I hit the live button to see what was on there now, clear. I packed up my gear and decided to head out. But just as I was going to open the door, through the window I saw the salivating and joyful priest crouching by my door."
  },
  {
    "id": "1quxrat",
    "subreddit": "nosleep",
    "title": "Ethical Robbery",
    "author": "Kukul_Art",
    "score": 36,
    "url": "https://www.reddit.com/r/nosleep/comments/1quxrat/ethical_robbery/",
    "created_utc": 1770138696.0,
    "num_comments": 5,
    "word_count": 542,
    "body": "\\-Thump- “Sorry” -Thump- “Sorry again” -Thump-\n\nI woke up. I was being pulled down the stairs by a masked man. \n\nMy hands were bound behind my back, and my feet were tied. I fought through my grogginess and I got to yelling, “WHO THE HELL ARE YOU? WHAT IS THIS? WHAT ARE YOU DOING WITH ME?” The acid in my stomach boiled. My body surged with animalistic terror. I started whipping my body around in an attempt to break free.\n\nThe man stumbled down the remaining stairs pulling me down with him. My head cracked against the hardwood. We crumpled at the bottom in a jumbled mess of limbs. He jumped to his feet and fell back against the wall. “OH you’re awake, I was getting kind of worried. I think you might have like a legit medical condition that makes you such a deep sleeper.”\n\nI groaned. My head was swimming from hitting the floor.\n\nHe crouched down beside me, “Hey man, are you okay? Oh shit, that doesn’t look good…”\n\nHe reached down and touched my head, when he pulled back his gloved fingers had a layer of blood on them. Through the holes in his mask his eyes went wide. He fumbled with his words, talking more to himself than me. “Okay, okay, um… we’re going to do this quickly and I’ll get out of here.”\n\nHe dragged me across the floor into my living room and propped me up onto my armchair before pulling up a chair across from me and taking a seat. He looked somewhat distressed as he placed his hands together in front of him. “Okay, um… I don’t love that you’re injured, so we’re going to try to make this quicker.”\n\nI tried to keep my eyes on him as my vision swam. “Wha- what … do you want?”\n\nHe began what sounded like a rehearsed statement, “I’m what I like to call an ‘ethical robber,’ that means I try to take only one thing without messing up your house and everything. That’s where you come in, I want you to tell me what I should take.”\n\n“I have no idea what you’re saying.”\n\nHe seemed a bit shaken. He stammered out, “I-I’m what I like to call an ‘ethical robber’ that—”\n\nI cut him off, “I just heard you say that.”\n\nHe stood up. “Oh, uh, I don’t know what to say then … Maybe I’ll take your TV, I guess?”\n\nWalking over to the TV he looked back at me, “Or do you have any like rare artifacts, or watches, or jewelry maybe?”\n\nMy vision faded and the world went black.\n\nWhen I woke up I was surrounded by paramedics. They treated me for a concussion but ultimately I didn’t need to go to the hospital.\n\nI looked around my house for a few hours the next day before finally spotting what he took. There was a note sitting on the shelf across from my bed:\n\n“Hey man, really sorry about your head. I called the hospital so I think we’re probably even. I tried to avoid stealing anything that looked too important, but this gold vase seems pretty expensive, so hopefully I made the right call.”\n\nIt was my wife’s urn."
  },
  {
    "id": "1qs9jpy",
    "subreddit": "nosleep",
    "title": "I work for a delivery company which delivers human body parts to random addresses. Yesterday there was a package containing my fiance‘s head.",
    "author": "Wild_West_Arthur",
    "score": 36,
    "url": "https://www.reddit.com/r/nosleep/comments/1qs9jpy/i_work_for_a_delivery_company_which_delivers/",
    "created_utc": 1769882927.0,
    "num_comments": 3,
    "word_count": 844,
    "body": "It was a random Tuesday night. I was a broke man sitting in my cheap small apartment scrolling through job forums looking for some hope.\n\nI was getting married in two months. I was desperately looking for a job. If I wanted to start a family I had to. She was beautiful. A trustworthy woman. Blonde hair, blue eyes, the works. If I didn’t get a job soon she would probably divorce me less than two years after marriage. And that’s when I came across it.\n\nIt was a website advertising a delivery job. The pay was good. I clicked on the sign-up form link that the website provided.\n\nIt looked simple. So I signed up. I was doubtful I was going to get that job.\n\nBut two weeks later when I was checking my mail I found the letter.\n\n“Dear Mr. Roberts. We reviewed your information on our delivery company website. We have decided that you are eligible to be one of our delivery drivers.”\n\nI was overjoyed. There was an address attached to the letter.\n\nShortly after, I went to the interview spot. I got the job. They made me download their app. I signed up through the app.\n\nThere was only one rule. You could never open the packages that you were delivering. I brushed it off. What else was I supposed to do?\n\nThe first delivery request came a day later. I accepted it. Of course I would. The delivery spot was at a run down apartment building. Room 403.\n\nThe first thing I saw when I pulled up was a lightbulb hanging on a pole for dear life. It was just swinging in the wind. I was glad that wasn’t me. I took the package off my passenger seat and got out. I walked inside and went to the front desk.\n\n“Delivery for room 403,” I said confidently.\n\n“Take the elevator to the 4th floor. It’s the second door on your left,” the woman sitting at the desk said flatly.\n\nI walked up to the elevator and found the button. Or what was left of it. Looks like I was going to have to force the elevator doors open myself. I shoved my fingers through the tiny gap between the doors and pushed in separate directions as hard as I possibly could. When they finally did open, there was only half of a button lying on the floor. I pressed the button for the 4th floor and the button literally came off. The doors finally closed and the button clattered to the floor. When I arrived, the room door looked like it had been through an apocalypse. There was half a door knob. Most of the bottom part of the door was just gone. The room number had something brown on it. I knocked on the door and placed the package in front of it and just walked away. If the door looked like that, I wouldn’t want to imagine what the interior looked like.\n\nI heard the door open behind me with a squeak so loud I thought it was coming from a base boosted speaker.\n\nThe next few deliveries were fine. I made 200 bucks in just three deliveries. I started to pay attention to see what was in these boxes. That’s when I found out some strange things.\n\nOne package said it contained a PS5. The box was not heavy at all. It was lighter than a penny. So I opened it. And what I found inside made me scream.\n\nIt was a human finger. It looked like it had been cut off cleanly.\n\nI decided I was going to deliver the package normally. I didn’t want to get involved in whatever the fuck these people were doing.\n\nThe address lead me to a house on the outskirts of town. An old lady opened the door. An old woman that looked like she wouldn’t hurt a fly. I handed her the package and quickly speed walked to my car.\n\nI checked the next package. It contained an entire arm.\n\nI kept opening more and more packages and they all contained human body parts.\n\nI kept delivering. One package even contained a single eye.\n\nI didn’t know what to do. That’s until it happened.\n\nI opened a package. It was her. My fiance. Her decapitated head was lying in the box and next to it was a note.\n\n“You’re next.” I screamed. I fell backwards. I cried. I reported it to the police. There was no evidence. No clues. I kept seeing that message over and over in my head. I fell into depression. I stopped eating completely.\n\nIt’s midnight now. I heard a knock at my door two hours ago. I didn’t open it. I looked through the peep hole and saw a man holding a machete. I was scared out of my mind.\n\nI’m sitting in my room typing this. I don’t know how long I have. I’m writing this to all of you about what’s really in those big packages your neighbors keep getting."
  },
  {
    "id": "1qmz3hk",
    "subreddit": "scarystories",
    "title": "My husband SAVED me from being bought.",
    "author": "Trash_Tia",
    "score": 36,
    "url": "https://www.reddit.com/r/scarystories/comments/1qmz3hk/my_husband_saved_me_from_being_bought/",
    "created_utc": 1769383447.0,
    "num_comments": 1,
    "word_count": 968,
    "body": "Lucas has been on the purchase line for a while.\n\nLabelled “The perfect boy next door,” he stands beside me, perfectly still, glassy, unfocused eyes fixed straight ahead. \n\nHe’s handsome. His suit is perfectly tailored, a crisp white shirt, pressed trousers, a blazer cut to fit him exactly. \n\nThick brown curls frame his face, freckles dust his skin, his jaw sharp and clean, and a glittering smile appears only when he’s told to smile. Ever since I first noticed him on my first day, I haven’t been able to stop wondering what his story is. How he *became* a doll.\n\nWhen we’re escorted onto the shop floor, I grab his hand and squeeze it. \n\nThere have been whisperings that some of us regain the ability to touch, to feel. \n\nPart of me wants it. \n\nPart of me wants to feel Lucas’s hand in mine. \n\nPart of me longs to just… *feel* \n\nA guard shoves me forward, but I keep hold of him, our fingers entangling. \n\nHe doesn’t squeeze back. His hand is ice-cold and slimy.\n\nPlastic.\n\nLucas stares forward, unblinking. \n\nHe smiles when he’s told to smile, pouts when he’s told to pout. \n\nA few days earlier, he flinched. His eyes flickered. His lips parted. \n\nHis fingers clenched into a fist.\n\nOur sellers noticed, too.\n\nThey called it a temporary malfunction.\n\n“All right, we’ve got a great lineup today!”\n\nWe stand in a line, perfectly selected for our appeal. \n\nThere are fifteen of us, but Lucas and I are the only ones considered desirable. \n\nThe others are too *fresh*. \n\nThey still try to fight, still claw at their clothes, try to tear them off only to be shot in the back of the head. I’m used to blood splattering my cheeks, salting my tongue, smearing my eyes. Luckily, I am plastic. \n\nI have plastic thoughts. \n\nPlastic memories. \n\nPlastic emotions. \n\nPlastic sensations. \n\nI don’t *feel* the warmth of blood running down my face. \n\nI don’t *feel* splintered pieces of skull tangled in my hair. \n\nSo it doesn’t bother me.\n\nI remain silent. Perfect.\n\nI am The Perfect Wife, after all.\n\nLena stands to my left wearing a yellow smock, her hair bleached blonde. \n\nLena is The Wife That Will Cook For You. \n\nI wear a dress that clings to every curve, my face painted, silk hair cascading down my shoulders.\n\nBuyers surround us, smiling with glee.\n\nA man strides straight toward, and says, \"This one.\"\n\nLena is taken away, and I am left staring at two potential buyers.\n\nThey look me up and down, comparing me to Elena, at the end of the line. \n\nBut my attention is not on them. \n\nA boy stands in front of Lucas, wide eyes glistening with tears, cheeks blooming red. He cups his face slowly, tenderly, and says, “This one.” He chokes on a sob he tries to hide. Lucas doesn’t move, staring straight through him. \n\nBut I sense something in the air. This boy isn’t just a buyer. \n\nHe *knows* Lucas. “I want to buy this doll,” he whispers, and when he thinks nobody is watching or listening, he leans close, pressing his head into Lucas’s shoulder.\n\n“Hi, Jack.”\n\nHe raises his voice, holding his sleeve to his mouth and nose. \n\n“Please, can I buy this doll? I’ll… I’ll pay extra!”\n\nLucas is violently shoved forward, his wrist scanned.\n\nThe boy takes his hand, gently pulling him away.\n\nBut I catch his words whispered in the doll’s ear. “I’ve *found* you.” \n\nI think that's the first time my lips have formed a real smile.\n\nNot because I'm told to.\n\n*“Melody?”*\n\nI find myself face to face with a man who immediately cradles my face. His eyes are wide, his lips prickling into a smile.\n\n“Hi,” he whispers, and breaks down.\n\nIt hits me that, just like Lucas, this person… knows me.\n\nHe knows me from before I was hollowed out.\n\nThe man buys me immediately, lifting me into his arms. \n\nHe carries me outside to his car, and I find myself liking the cool graze of wind on my cheeks. I like the heat of the sun on my back. \n\nHe lowers me into the front seat of his car, and I fall limply against the window. \n\nThe effects of the numbing agent my buyers injected into my bones paralyzes me. The man is gentle, pulling a knife from his bag. “It’s okay, sweetheart,” he whispers. “I’m going to get it out.” \n\nI can do nothing but stare back at him with my manufactured grin. \n\nI don't feel him cutting into me at first.\n\nThe blade is cruel, slicing into the back of my ear.\n\nHe presses pressure, gently gagging my mouth. \n\n“Don't scream, all right?” He whispers. “We’re being watched.”\n\nI nod, obediently.\n\nBut then *pain* hits like a lightning bolt. \n\nI can *feel* it, writhing up and down me, exploding in my bones.\n\nMy body jerks violently, and I… I *scream* into the flesh of his hand.\n\nI can… I can *feel*. \n\nOh god, I can *feel!*\n\nMy head tips back, my eyes flickering.\n\n“Babe?” \n\nHis voice is suddenly so familiar, enough to sting my eyes.\n\nThe man holding me, holding my emotional inhibitor between bloody fingers, is my *husband*. He squeezes me into a hug, and I am no longer paralyzed. “I never thought I’d see you again,” he whispers, squeezing tighter. \n\nBut I remember my plastic thoughts.\n\nI remember my plastic memories.\n\nI remember my skin littered with bruises.\n\nMy black eye.\n\nI remember his plea. “I won't do it again.” \n\nI remember. \n\nWhy I surrendered myself. Why I ran away.\n\nA sudden sharp cry rang out across the parking lot. \n\n*Lucas.* \n\nMy husband grabs me, muffling my screams, forcing me to look at him, and not Lucas being stuffed into a trunk. \n\n“I’ve finally fucking *found* you.”"
  },
  {
    "id": "1r2cztc",
    "subreddit": "scarystories",
    "title": "Alone",
    "author": "TeaRevolutionary7606",
    "score": 36,
    "url": "https://www.reddit.com/r/scarystories/comments/1r2cztc/alone/",
    "created_utc": 1770851753.0,
    "num_comments": 1,
    "word_count": 834,
    "body": "*Night shift. Painkillers. Morning. Home. Stairs. My legs hurt. Headache.*\n\n*More stairs. Sixth floor. Work pants. Many pockets. The door. Keys. No, gloves first. Hell. Painkillers now. OPEN.*\n\n*Take off clothes. Hot shower. Hot water. Shampoo. Back of my head. NO.*\n\nThe foreign thoughts leave and are replaced by the cold tiled floor pressing against my right cheek. A couple of meters in front of me, a puddle of water has formed, with the shower head still running. Just beside the puddle lies what looks like the towel heater, now deformed, with cables sticking out from its back. Before I have time to question where I am, I feel the sting in the back of my head. It is warm, and my neck feels like it’s about to explode. I stretch my hand toward my neck, but the hand does not respond.\n\nMy eyes widen and I try again. No response. I feel my pulse rise and my breathing quicken. I try my legs. Nothing responds. My cheek still presses against the floor.\n\n*Sleep paralysis. Just have to wake up.*\n\nI close my eyes and force them open hard. It has worked every time I’ve needed to get out of a nightmare.\n\nThe same cold tiled floor against my cheek. I try again, this time a little faster.\n\n*Wake up, this is a dream.*\n\nI am still in the same place, eyes toward the puddle. I realize now that I cannot feel my legs. Or any other part of my body except my neck.\n\n“Ffffffffffffff. PFFFFFFF. PFFFF,” I call for help.\n\n*My mouth.*\n\nI suddenly feel short of breath. My eyes sting and I feel them begin to tear.\n\n“PFFFFFFF,” I try, now desperate.\n\n*HELP*\n\nI keep trying but not even sound comes out. *I am stuck.* My cheeks hurt from blowing. The back of my head is burning. I look around with my eyes. The bathroom door is ajar. I live alone. *I can’t move… I can’t move… I can’t move… I CAN’T MOVE.*\n\n*I fell. I must have slipped. How long have I been here???* The bathroom window is behind me. *It seems bright. But it could also be the ceiling lamp.* The light flickers and it is still bright. *It must be daytime.*\n\n“PFFFFFFF PFFF PFFFFF PFFFFFF,” I try again and empty the last air from my lungs. I lose my breath.\n\n*The neighbors below might hear me.* I bang my head as hard as I can against the floor several times. It hurts less than I expected.\n\nIt’s still quiet. I bang again. Nothing. I feel my face contort.\n\n*Mommy I want my mommy… STOP. Mom has been dead for a long time. You are alone.*\n\n*You will die alone.*\n\nI am tired. But I must not fall asleep. *I might not wake up again. Soon the ambulance will come. The neighbors must have heard me. They have called. I thought I heard sirens. They are on their way. Everything will be fine.* I slowly close my eyes.\n\n“FFFf” *NO I CAN’T FALL ASLEEP. I haven’t gotten married yet or had children or grandchildren or truly fallen in love. Stay awake stay awake stay awake stay awake…*\n\nThe puddle of water has grown and is now only a meter from me. I now notice that sparks are coming from the towel heater lying in the puddle. *I must have torn it down when I slipped. Grabbed it.* The water is live.\n\nI hear the faint sound of the door opening in the hallway. *They have come to save me. Everything will be fine.* The footsteps are quick and grow louder. The gap in the door points the wrong way, though. I can’t see who it is. The door opens. I still can’t see who it is because my eyes only see up to the neck.\n\n*THE CURRENT*\n\n“PFFFF FFFFF PPFPFFPFF” I scream so he won’t step into the electrified water. He doesn’t understand me, runs straight into the bathroom. He jerks, clenches his fists, and falls stiffly straight down with his head about half a meter in front of me.\n\nA new, red puddle forms beneath his head and slowly runs toward me. His eyes glossy, half open. My neighbor from the floor below.\n\n*Nononono no no no no no no no NO NO*\n\n*Why is this happening to me now? How unlucky can I be? What are even the chances that this happens??*\n\n*Maybe I am supposed to go. Maybe it is my turn. It must be meant to be, because this cannot happen if it’s not meant to be…*\n\nThe stinging in the back of my head has stopped. Instead I feel a warmth spreading through my whole body. *A nap maybe wouldn’t be so bad after all.*\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n“The body has been lying here a long time, at least a month I’d say.”\n\n“No family or friends to contact?”\n\n“No. The neighbor below complained about the smell. Called the landlord, who found him here. Alone.”\n\n\\- V."
  },
  {
    "id": "1r9oxcs",
    "subreddit": "nosleep",
    "title": "At this point, the glowing red EXIT sign at the mall is god",
    "author": "Thin_Kaleidoscope724",
    "score": 34,
    "url": "https://www.reddit.com/r/nosleep/comments/1r9oxcs/at_this_point_the_glowing_red_exit_sign_at_the/",
    "created_utc": 1771572533.0,
    "num_comments": 2,
    "word_count": 856,
    "body": "About 15 minutes ago the mall lights went out. I’m assuming it was a power outage. An abrupt power outage is somewhat startling to most people but only for a few seconds until you realize it’s not a big deal.\n\nI’ve recognized that that is what happened but what’s making me feel a little weird is that prior to the power outage, the mall was loud: footsteps and chatter heard from all directions, order numbers being called from the food court… but as soon as the lights turned off, all of that went away with it. It was silent.\n\nI called out “Hello?” The only response was my echo. I walked towards the exit sign. The doors to the mall were glass. I should have been able to see the sun shining outside but I couldn’t. All I saw was darkness below the exit sign.\n\nI walked towards the exit sign. Once I was below it I put my hand out to reach for a door but there was just a smooth wall. That was the moment my comfort began to crack. I tried to convince myself that there was a sensible explanation for this but I’ve came to this mall several times and why would anyone put an exit sign in an area where there was clearly no exit.\n\nI forced myself to calm down and think. “The food court has several windows on the ceiling and it should be right around the corner” I thought to myself. I reached out and found the wall to my right. I kept my hand on it as I traveled down the hall as a way to guide me.\n\nI traveled a distance to where I should have reached the corner that led to the food court. There was no corner. Just a straight path forward outlined by the walls. I looked back and could still see the red glowing exit sign in the distance. Nothing else in any direction.\n\nI tried to make a phone call but my phone would immediately turn off once I dialed a number. That’s when my stomach tightened. I knew that I was truly alone with no way to call out for help.\n\nI made efforts to control my breathing as I walked back to the exit sign. I felt like I was having a bad dream. I knelt below the sign and leaned back against the wall.\n\nThe back of my head smacked against the cold tile floor. I sat up rubbing the back of my head while reaching out to feel for the wall. It wasn’t there. Just open space to my front and to my back.\n\n“The wall was just right here!” I thought to myself. I walked to the left of the sign and found the hall wall. I laid up against it and waited. And waited. And waited some more. \n\nI was hoping to have some help arrive or really any response to the questions coming from my racing mind. They didn’t come.\n\nSo I finally got up and figured I’d look around and try and find something other than the sign. I walked down the hall again. Walking in a straight line with my fingers skimming hallway wall… until they weren’t.\n\nI had walked about 20 feet down the hall when my fingers came off of the wall. It was abrupt as if I had reached a corner. A sharp turn. So I went to feel for the perpendicular wall. \n\nBut I felt nothing… no new wall, no old wall… nothing… but I still saw the EXIT sign, If you could even call it that. As far as I could tell, it was no sign for any exit.\n\nI walked around aimlessly. Both far and near to the exit sign. I felt no walls and saw nothing else. Just darkness in all directions. Finally, I came down to sit and rest beneath the sign.\n\nI plopped down beneath it but as I braced for the impact from my rear hitting the floor, it never came. I lost sense of the ground beneath my feet and immediately adrenaline rushed through my body after sensing that I was free falling.\n\nBut I wasn’t. Or at least I think I wasn’t. The only thing that I knew was that the distance between me and the exit sign was not changing. Either we are both stationary or falling at the exact same speed.\n\nAs I write this I can’t even scroll up to see what I was writing hours ago or maybe even days ago. Who knows I’m loosing sense of time now. The previous paragraphs are gone. I can read the some 20 lines that appear on my phone currently. Eventually I believe I will be unable to determine what these words, what these letters even mean and why they are here.\n\nAs for me, I am only here for the red glowing exit sign. In all directions is darkness except directly above me, where the exit sign is. It is the only thing reminding me that I still exist. And once it ceases to exist… so will I."
  },
  {
    "id": "1r0jbw7",
    "subreddit": "scarystories",
    "title": "Memo",
    "author": "_b_va",
    "score": 34,
    "url": "https://www.reddit.com/r/scarystories/comments/1r0jbw7/memo/",
    "created_utc": 1770677359.0,
    "num_comments": 0,
    "word_count": 399,
    "body": "Numbers, Numbers, always Numbers.\nI try to refocus my eyes onto the endless stream of numbers on the computer screen.\nMy eyes burn. I lift a hand up to my face to rub at them with my thumb and forefinger. \nStars behind my eyelids.\n\nOk. Break time.\nI wander into the break room in search of a no doubt burnt, yet strong cup of coffee.\nI hear my coworkers idily chatting nearby, but I dont have it in me to care about what. \nGossip? Reports? Boring weekend plans?\nWhatever.\n\nAs I wait for the coffee to brew, my tired, strained eyes wander to the corkboard on the wall to my right.\nA flyer promoting the latest \"team-building\" exercise, a passive aggressive note about cleaning the microwave after use, and... wait, what?\n\nI take a step closer, trying to focus on the official looking print out on the board. Clearly put there by management. \nThe stamp of the government agency I work for, the signature of the head of the department. Seems official. \n\n\"To all employees,\" it reads,\n\"Due to recent unfortunate circumstances, we must advise all staff to please be aware of, and promptly report any of the following:\"\n\nI faintly hear my coworkers continuing their conversation, their voices just a vague hum in the back of my mind.\n\nThe notice continues, \n\" - Any person(s) exhibiting behavior that is unusual for them\n- Any person(s) displaying unusual movements (twitching, not blinking, smiling too broad, or too long)\n- Any unusual smells\n- Any anomalous sounds (whistling, humming, tapping etc.)\n- Any person(s) mimicking your own voice\n\nIf you encounter any of these anomalies, please contact the head of your department. \nThank you for your cooperation.\"\n\nI stand there, blinking for a few moments. The coffee machine cheerfully informs me that my shitty coffee is ready with a chime.\n\nI turn to my coworkers, who are still chatting quietly.\n\n\"Hey, have you guys seen this memo? What the fuck is that about?\" I ask,\nThey turn to me, confused. \n\"You think it's some kind of prank or something? Shitty joke, if you ask me,\" I awkwardly chuckle.\n\nOne of them finally opens their mouth to speak, I vaguely remember her, Jen from HR.\n\"I agree!\" She says, but the voice that comes out of her mouth is wrong. It's masculine. \n\"Doesn't seem very funny, does it?\"\n\nIt's my voice."
  },
  {
    "id": "1r89kko",
    "subreddit": "scarystories",
    "title": "I spammed a single letter into Google. Now I think I’ve seen something I wasn’t supposed to.",
    "author": "Sad-Tiger-4457",
    "score": 34,
    "url": "https://www.reddit.com/r/scarystories/comments/1r89kko/i_spammed_a_single_letter_into_google_now_i_think/",
    "created_utc": 1771436178.0,
    "num_comments": 2,
    "word_count": 229,
    "body": "It started as a joke. You know that glitch where if you type \"sssss\" or \"aaaaa\" into Google, the first result is always South32? That Australian mining company?\nI was bored at 3 AM and started doing it. Over and over. Each time, that sterile, blue-and-white corporate logo stared back at me. But then, I decided to go deeper. I spammed the letter \"M\" until the search bar hit its limit and pressed enter.\nThe first result wasn't their homepage. It was a private YouTube link with zero views.\nThe video was 4 hours long. It looked like a security feed from somewhere deep underground. No sound, just the grainy flicker of a tunnel. But every few minutes, a face would walk past the camera. Not a human face—it looked like a person, but the proportions were... off. Their skin had the same flat, grey texture as the rocks in the background.\nI checked the comments. There was only one, posted \"Just now\" from an account named South32_Admin:\n\"Stop digging. You're making the algorithm work too hard.\"\nMy browser crashed immediately after. Now, every time I unlock my phone, my search history is filled with addresses of abandoned mines near my house. Addresses I never searched for.\nIf you’re bored tonight, do yourself a favor: don't test your keyboard. Some things are hidden behind those letters for a reaso"
  },
  {
    "id": "1qxohhw",
    "subreddit": "scarystories",
    "title": "The frozen passenger",
    "author": "Jeekuss",
    "score": 31,
    "url": "https://www.reddit.com/r/scarystories/comments/1qxohhw/the_frozen_passenger/",
    "created_utc": 1770400008.0,
    "num_comments": 0,
    "word_count": 829,
    "body": "I’ve always loved the rhythm of the rails. There’s something hypnotic about the click-clack of a train cutting through the Canadian Shield, miles away from the nearest paved road. I booked a cabin on the \"Canadian\" from Toronto to Vancouver to get away from the noise of my life, but now, the silence on this train is starting to scream.\n\nWe’re somewhere past Winnipeg, I think. I say \"I think\" because the clocks in the cars don't seem to agree with each other anymore.\n\nThe first sign that something was wrong wasn't anything supernatural. It was just... quiet. I spent the first two days wandering the stainless-steel corridors, occasionally nodding to a porter or seeing the back of a passenger disappearing into the dome car. But yesterday, the interactions started getting strange.\n\nI went to the dining car for dinner. The steward, a man with skin like parchment, sat me at a table with a heavy silver setting. I tried to make small talk about the delay near Sioux Lookout.\n\n\"We've been stopped for a while, haven't we?\" I asked.\n\nHe didn't look at me. He just placed a glass of water down. The water wasn't clear; it had tiny shards of grey ice floating in it. \"The tracks are clear for those who know where they're going, Mr. Mayer,\" he whispered. His voice sounded like dry leaves skittering across pavement.\n\nI didn't remember giving him my name.\n\nFeeling a chill I couldn't shake, I headed toward the communal shower at the end of Car 112. I needed the steam to clear my head. As I approached, I saw the \"In Use\" sign was lit. I stood there for a moment, waiting. From behind the door, I heard a splashing sound—slow, rhythmic, like someone heavy stepping through a deep puddle.\n\nThen, a voice. It was a low, rattling croak that seemed to vibrate in my own chest.\n\n\"Have you seen Thomas?\" the voice asked.\n\nI froze. \"Thomas? I... I don't know a Thomas.\"\n\n\"He’s so cold,\" the voice drifted through the door, followed by a wet, slapping sound against the metal. \"He’s been out there in the bush for so long. He just wants to come inside. He’s right behind you, isn't he?\"\n\nI spun around. The narrow hallway was empty, save for the flickering fluorescent lights. But when I turned back to the shower door, the \"In Use\" sign was green. I pushed the door open. The small room was bone-dry, but the mirror was thick with frost. Traced into the ice were three letters: C. T. M.\n\nMy heart began to thud—a dull, heavy sensation that felt far away.\n\nI retreated to my romette, locking the heavy sliding door. I sat on the edge of my berth, staring out the window. That’s when I saw him.\n\nThe train was moving through a narrow rock cut, the granite walls only inches from the glass. And there, standing on a ledge that shouldn't have been able to hold a human being, was a figure in a long, midnight-black coat. His hood was pulled low, but I could see his hands. They were blue-grey, the skin cracked like old porcelain.\n\nHe wasn't reaching for the train. He was reaching for me. Every time we passed a signal light, I’d see him again—sometimes fifty yards back in the trees, sometimes right against the glass. He was patient. He was a predator waiting for the prey to realize it was already caught.\n\nI reached for my travel pouch, my fingers feeling numb and clumsy. I needed to see my itinerary, to see when this nightmare was supposed to end. I pulled out the yellow VIA Rail sleeve and stared at the ticket inside.\n\nPassenger Name: MAYER / CARTER THOMAS\n\nDeparture Date: February 6, 1998\n\nStatus: UNREDEEMED\n\nI looked at the date again. Then I looked at my hands. They weren't the hands of a man in his thirties. They were pale, the fingernails a dark, bruised purple.\n\nI remember the \"Legend of the Frozen Passenger\" now. People in the dining car used to whisper about a man named Carter who wandered off the train during a breakdown in '98. They said he thought he saw someone calling to him from the woods. They found him weeks later, a human ice sculpture standing perfectly upright in a snowbank.\n\nI looked back at the window. The dark-hooded figure wasn't outside anymore.\n\nHe was standing in the reflection of the glass, right behind my shoulder. He wasn't a monster. He was the Conductor. And he’s been waiting twenty-eight years for me to finally check my ticket.\n\nThe train is slowing down now. But we aren't at a station. There are no lights outside, just the endless, white silence of the pines.\n\n\"Thomas,\" the man in the coat says, his hand resting on my shoulder. His touch is the first thing I've felt in decades. It’s not cold. It’s just... final.\n\n\"It’s time to change trains.\""
  },
  {
    "id": "1qtbthx",
    "subreddit": "creepystories",
    "title": "Man in the bush",
    "author": "Zeekainit",
    "score": 9,
    "url": "https://www.reddit.com/r/Creepystories/comments/1qtbthx/man_in_the_bush/",
    "created_utc": 1769982326.0,
    "num_comments": 6,
    "word_count": 177,
    "body": "Okay… i haven’t really told anyone about this because im scared that i was seeing things but the more i think about it the more i think that it was definitely real!\n\nI was going on a run and i stopped at the gate that i usually stop at as its a nice view and i was stood there for about two minutes until something caught my eye. There was a guy crouched down behind one of the bushes but i could see him through the bush and i looked at him for a couple of seconds and he quickly got up and sped walk towards me. I instantly ran back home as ran non stop. I could hear footsteps behind me for a bit but i luckily managed to run faster then the guy. \n\nThe run i take is in the middle of nowhere and down the back streets of my village. Should I look where he was crouched? He could have been hiding something? He didn’t say anything when he stood up and looked annoyed."
  },
  {
    "id": "1r86dri",
    "subreddit": "creepystories",
    "title": "\"The Black Kitty\"",
    "author": "Which_Republic4558",
    "score": 6,
    "url": "https://www.reddit.com/r/Creepystories/comments/1r86dri/the_black_kitty/",
    "created_utc": 1771429381.0,
    "num_comments": 2,
    "word_count": 524,
    "body": "He beats her every morning and every night. He yells at her and shatters her from within but she won't leave him.\n\nShe's always covered in bruises, cuts, and scratches because of him. \n\nI saw a lot of bad injuries on other animals when I had no home but I've never seen anything as bad as what he does to her. \n\nI know that I'm only a kitten but even I can recognize the dysfunction. Human relationships seem quite complicated. \n\nI'm glad to be only a mere kitten so I don't have to handle such complications. \n\nI can't help but feel bad for her. She seems like a sweet lady.\nHer smile beams of innocence. Her light green eyes express so much care. Her gentle hands took me off of the streets and she is attempting to give me a good life. \n\nShe's the only human to touch me with pure intentions. The only voice that has ever soothed me. \n\nShe also protects me from the mean man and tries to hide me from him so he won't hurt me. \n\n\"No! Stop!\" \n\nWatching her scream as tears drip out of her eyes is not a lovely sight. Watching this happen to her every night is a ugly thing to witness every night. \n\nShe saved my life by taking me off of the streets. I was very hungry and thirsty. I was also all alone. She found me in the dark and brought me to her home. Perhaps I should return the favor. \n\nI hide my small body as I watch him hurt her. Once he finishes, he walks away with his bottle full of foolish substances. \n\nI quickly run over to the steps that lead to the basement. He always goes into the basement. The door being unlocked is perfect for my plan.\n\nI use my tiny mouth to grab a object. I carefully place it onto the steps. It's big enough to make him trip. \n\nHe won't ever hurt her again.\n\nI run towards her after setting up his demise. \n\nMy tongue licks her as I let out gentle purs.\n\nFeeling her gentle hands pet me and feeling her run her fingers through my black fur is such a tender feeling. \n\nHearing laughter escape from her mouth and seeing her lips create such a beautiful smile is heartwarming.\n\nThe wholesome moment comes to an end when she hears the loud sound of that evil man falling. \n\n\"Babe!! Are you okay?\" \n\nShe starts to yell that question over and over. \n\nHer body starts shaking as her eyes carry a clear look of fear. \n\nShe walks over to the basement and comes to a realization. \n\n\"He's dead.\" \n\nTears slip out of her eyes as a relieved smile appears on her face.\n\nI'm young but I know that sometimes killing is necessary for survival. \n\n\"Some people say that black cats are bad luck. You, my kitty, you're the best thing that's ever happened to me.\" \n\nI saved her because she saved me. I have also grown quite fond of her. \n\nI'm excited to live a life with her as my owner and me as her pet."
  },
  {
    "id": "1qp6czn",
    "subreddit": "writersofhorror",
    "title": "I'kwibalalatach",
    "author": "Migga_Biscuit",
    "score": 6,
    "url": "https://www.reddit.com/r/WritersOfHorror/comments/1qp6czn/ikwibalalatach/",
    "created_utc": 1769590948.0,
    "num_comments": 1,
    "word_count": 767,
    "body": "The internet is stillborn. At no point was it alive and well. Well...not alive in how it was claimed to be.\n\nYou have probably heard of the Dead Internet Theory. If not or you need a refresher, the gist is that around 2016 or 2017, the internet became flooded with bots. These bots make up most of the userbase of the internet, and also create most of the content you see. Videos, art, music, games, you name it.\n\nBut, unless you are a terminally online 'schizo', you likely have never heard of its more paranormal counterpart: Infernal Internet Theory. A ‘theory’ proposing that demons run the internet, and act like human users, while also making all the content you see.\nThe word ‘theory’ is in apostrophes as it should be called Infernal Internet Truth. It is, unfortunately, without an iota of a doubt, 100% true. \n\nMost likely your first instinct is to call this schizophrenic or at least have a feeling this is going a bit far, and you will probably find something else to do or at least not take it seriously, but just hear this out and truly think about it.\n\nHow can a piece of something, something not alive in the slightest, be magically made to think and do all the other stuff computers and other similar devices do? Well…...magic, black magic or witchcraft to be exact. If you look at the circuit boards of these devices, you will find demonic sigils. No, seriously go look it up online…as ironic as it sounds, all things considered. \n\nHere are some more suspicious things to consider: Both ‘computer’ and ‘internet’ equal 666 in English Sumerian and Reverse English Sumerian Gematria respectively. One of the first PCs sold for 666.66$, and it was sold by Apple, a reference to the Forbidden Fruit with even its logo being a bitten apple. Also, one of the first ISPs in the UK was literally named Demon Internet. Finally, many emojis look eerily similar to the 72 demon sigils of the Goetica. There is more...but you can search on it for your own as this is more than enough.\n\nI'kwibalalatach. Ee-Kwih-Bah-Lah-Lah-Tatch is probably how it is pronounced, though be wary in saying it. That is the name of the demon. He...well...it, is behind it all. Being a demon, it is hard to pin down its true form, but it is probably a spideroid. It tracks. InterNET. InterWEBS. The NET. The WEB. World Wide WEB. The internet is everywhere too, like spiderwebs. And like spiders as a whole, it can travel anywhere: land, air, or sea. Yes, spiders can fly and swim.\n\nThis......thing, it puppeteers everything online. Over 99% of the users online are digital avatars of I'kwibalalatach. From even the biggest of internet celebrities to the most obscure users on a backwater forum. Many of the accounts even have 666s and demonic, disturbing things in the usernames, and scary, Satanic profile pictures. This in particular has been ramping up since 2020 or 2021.\n\nThe videos, pictures, art, games, music, all of it is weaved by it. The ultra viral video you saw and loved as a child? Demon generated. The cute cat and dog pics you dawed at? Demon generated. The hentai pics you lusted over? Demon generated. Your favorite MMO game you play like it is a job? Demon generated. Your favorite internet song that puts you in a blissful trance? Demon generated.\n\nThe only silver lining in all of this is the fact that all the porn, gore, and general toxicity found here online is not made by or experienced by actual people. It is all just a way to hurt and corrupt the few legit users here online.\n\nThe major downside is that even if a user were to show their face and speak using their 'real' voice......it would not prove jack. It is only a very convincing LARP of a fellow human user.\n\nUnfortunately, it probably goes much deeper than just the internet. Descartes proposed a thought experiment with an entity known as the Evil Demon. It is able to fool all five of your senses into sensing whatever it wants. It is most likely more than just a brainteaser, he was on to the truth......assuming he is even real in the first place.\n\nI'kwibalalatach very well might have spun up a demonic dreammatrix that is currently trapping and deceiving souls. Dreamcatchers are linked with spiders, hence well....I'kwibalalatach. This part is just a gut feeling, so take it with some salt.\n\nI will leave you with this: Trust no one online and guard you, your soul. Godspeed."
  },
  {
    "id": "1r7bu47",
    "subreddit": "creepystories",
    "title": "I haven’t tasted blood for 300 years and that’s the worst news you’ll hear today",
    "author": "Beard-and-Beyond",
    "score": 4,
    "url": "https://www.reddit.com/r/Creepystories/comments/1r7bu47/i_havent_tasted_blood_for_300_years_and_thats_the/",
    "created_utc": 1771347790.0,
    "num_comments": 0,
    "word_count": 570,
    "body": "I haven't tasted blood in 300 years, and that’s the worst news you’ll hear today.\n\nI’ve been the \"village monster\" for 300 years. The truth is much worse.\n\nI’m sure some of you have seen the travel vlogs or the Wikipedia page. Sava Savanović. \n\nThe first Serbian vampire. \n\nThe guy who lived in an old watermill on the Rogačica river and drank the blood of anyone who came to grind their grain.\n\nIt’s a great story for tourism. \n\nIt keeps the kids in Zarozje in bed at night. \n\nBut I’m writing this because the mill finally collapsed a few years ago, and with the ruins being cleared, the \"warding\" is gone. \n\nI can finally speak.\n\nI wasn’t a monster. I was a buffer.\n\nIn 1720, I didn't \"turn\" because of a curse or a bite. I was the richest merchant in the valley, and I fell in love with the daughter of a local rancher. He denied me her hand. In my rage, I didn't kill her—I killed him. But the moment his blood hit the soil of that specific riverbank, something under the earth woke up.\n\nIt wasn't a vampire. It was something older, a hunger that doesn't have a name in any language. It’s a subterranean rot that feeds on the vitality of the living. If it had reached the village, Zarozje would have been a graveyard in a week.\n\nI realized that the ground was \"drinking\" him. So, I did the only thing a guilty, desperate man could do: I stepped in the way. I made a deal with the soil. I offered myself as a permanent filter.\n\nFor three centuries, I didn't kill those peasants for fun. I \"attacked\" them to scare them away from the water. And the few I did kill? They were the ones who had already stayed too long, the ones who were already infected by the thing beneath the mill. I had to consume them to keep the infection from spreading. I wasn't a predator; I was a glorified immune system.\n\nEveryone thinks the danger is that I’m \"free\" now that the mill is gone. They think I'm out there looking for fresh veins.\n\nI’m sitting in a Starbucks in Belgrade right now, typing this on a stolen laptop. I’ve had three lattes. My skin isn’t burning in the sun. I don’t crave blood. In fact, I feel... human. Completely, terrifyingly normal.\n\nAnd that’s the problem.\n\nThe legends say that when the \"vampire\" dies or leaves, the curse is lifted. But they have it backward. I wasn't the curse; I was the cork in the bottle.\n\nFor 300 years, I felt that thing under the mill screaming, trying to push past me to get to the surface. \n\nYesterday, as the last of the mill’s foundation was hauled away by a construction crew, the screaming stopped. Not because it died, but because it finally got out.\n\nI’m looking out the window at the crowds on Knez Mihailova Street. I see a businessman checking his watch. I see a teenager on her phone. And I see the shadows under their feet.\n\nThe shadows aren't moving with the sun. They’re stretching toward the people’s ankles, reaching up like dark, hungry hands. The \"vampirism\" isn't a disease you catch from a bite anymore. It’s coming up through the pavement.\n\nI wasn't the first vampire. I was the only thing stopping everyone else from becoming one."
  },
  {
    "id": "1r2tfmq",
    "subreddit": "creepystories",
    "title": "\"Polish\"",
    "author": "Which_Republic4558",
    "score": 4,
    "url": "https://www.reddit.com/r/Creepystories/comments/1r2tfmq/polish/",
    "created_utc": 1770902941.0,
    "num_comments": 0,
    "word_count": 580,
    "body": "&amp;#x200B;\n\n\"Pick a color.\" \n\nAll of the color options are beautiful. It's hard to choose which one would be the best for my nails. \n\n\"You're the expert. Pick one for me!\" \n\nI let out a giggle so I can show that I'm being playful. \n\n\"Me being a nail tech doesn't mean that I will know what you want. You should be grateful that you're one of my favorite clients.\" \n\nShe's one of the best nail techs ever. I'm surprised that she works at this salon. She's too good for it. \n\nThis salon isn't popular because a lot of the nail techs are unprofessional and make so many mistakes. This place gets horrendous reviews because of it. She's the only reason that people still come here.\n\n\"This one!\" \n\nShe picked out a beautiful red nail polish. It's really pretty but it doesn't look like typical polish. I can't explain it. \n\n\"It's beautiful. Is it new?\" \n\nShe smiles. \n\n\"Yes, I just got it a couple of days ago. A ex client gave it to me.\"\n\nEx client? She never gets rid of her clients. What did the girl do? \n\n\"Ex client? What did she do? She must have been awful.\"\n\nShe sighs. \n\n\"She was rude to me all of the time. She would complain about the prices and process every single time she came. We ended up arguing about it a couple of days ago.\" \n\nWhat a bitch. I would not have the patience to deal with people like that. \n\nShe continues talking about the girl as she gets ready to paint my nails. \n\nSeveral complaints about how she would behave, talk, and treat people. She made the environment terrible. \n\nI'm glad that she got rid of her but a question is left lingering in my mind. \n\n\"Why would she give you nail polish? I'm surprised someone so rude would give you a gift like that.\" \n\nMy eyes stare at the color as it paints my nails. It doesn't look like polish. Doesn't feel like it either. \n\n\"Long story cut short, it was the only nice deed that she's ever done.\" \n\nI can't keep letting her do my nails. I don't trust what she's using. It's a weird red liquid and the worst possibility is clinging to my mind.\n\n\"I don't want this color. The girl must have given you a random red liquid. She was likely being petty.\" \n\nA mean expression creeps onto her face. \n\n\"Don't talk to me like that or else you'll be like her.\" \n\nBe like her? That sentence leaves me fearful as I realize how disturbing the meaning is. \n\nTha red liquid. The red liquid that was being put on my nails was not given to her as a kind gesture. \n\n\"That's her liquid?\" \n\nMy hands start to shake as my eyes start looking around. \n\n\"She deserved it.\" \n\nMy body immediately jumps out of the chair as my mouth starts to let out a scream that is only heard once in a life time. I'm that petrified. \n\nWhy is no one else doing anything? The other workers and clients aren't doing anything! \n\n\"Don't try. They are all compromised.\" \n\nMy legs quickly sprint to the doors but I am stopped by one of the workers. \n\nTears drip out of my eyes as I plead to be able to leave. I plead over and over but being persistent offers no luck. \n\nDefeat sinks into my soul as she approaches me. \n\n\"You will be a wonderful color in my collection.\""
  },
  {
    "id": "1qsj1fb",
    "subreddit": "writersofhorror",
    "title": "What would you rate this?",
    "author": "Curious_Star_1027",
    "score": 4,
    "url": "https://www.reddit.com/r/WritersOfHorror/comments/1qsj1fb/what_would_you_rate_this/",
    "created_utc": 1769905176.0,
    "num_comments": 1,
    "word_count": 102,
    "body": "It’s my first time writing horror I just started this today btw. Anyways, there’s not much but here’s a snippet...\n\n# Panic Room\n\n“Welcome object 307, state your name.” What was that? Who was that? “Who are you?” I asked. 20 seconds went by…no answer. “Object 307, please state your name” The voice stated again. This time a chill went down my spine, I swear I’ve heard that voice before. I swallowed the lump in my throat “My name is Nia-”. \n\n“Object 307 here you have no name. No face. No identity. So tell me again, object 307 what is your name”."
  },
  {
    "id": "1rb6itg",
    "subreddit": "creepystories",
    "title": "Uhm",
    "author": "i_eat_vaseline67",
    "score": 3,
    "url": "https://www.reddit.com/r/Creepystories/comments/1rb6itg/uhm/",
    "created_utc": 1771718056.0,
    "num_comments": 0,
    "word_count": 363,
    "body": "I was on a night crew widening a highway when our excavator hit something solid underground. We thought it was an old foundation.\n\nIt wasn’t.\n\nIt was a perfectly smooth slab, buried deep. When we tried to lift it, the machine died mid-air.\n\nThen we heard knocking.\n\nThree slow bangs\n\nFrom underneath it.\n\nNobody spoke. The foreman told us it was metal cooling. Then it banged again. Same pattern. Like something patient.\n\nWe covered the hole with steel plates and left for the night.\n\nAt 2:40 a.m., one of the guys called me, whispering that he could still hear digging. I was about to tell him he was crazy—\n\nWhen I heard it too.\n\nThree bangs\n\nFaint. Distant. Coming from somewhere below my house.\n\nThe next morning, the steel plates at the site were stacked neatly to the side. The hole was deeper.\n\nThe slab was gone.\n\nThere was just a dark, round opening where it had been.\n\nThe foreman never showed up again. His truck was still in the lot.\n\nMe and the crew thought he went away\n\nHe didnt. It was 4AM, I woke up early for work, and that's when I heard it, the same 3, slow bangs, on my door, I get my pistol, incase I need it, I open the door and see him stood there\n\nHe looked different, his eyes were wider, he was more pale, and more hair, my foreman was well-groomed, not like this\n\nI slam the door on him, he bangs on tbe door and turns to leave, but he bolts back, I dont know why, but he runs into my window\n\nIt shatters\n\nAnd then, I pull the trigger, one, final, bang\n\nHe collapses, I still dont think that was him, even all the way to today, this was 5 years ago\n\nI called a buddy to help me bury it, he was buried, gone, it reminded me of the ryker Webb story, because the boy that was found was NOT infact ryker\n\nThey paved over the site a week later, and scrapped the truck, whenever I drive on that highway, I feel a pothole.\n\nI still dont think its the pavement settling"
  },
  {
    "id": "1qsnx8x",
    "subreddit": "creepystories",
    "title": "Work stalker",
    "author": "OverTank4095",
    "score": 3,
    "url": "https://www.reddit.com/r/Creepystories/comments/1qsnx8x/work_stalker/",
    "created_utc": 1769918365.0,
    "num_comments": 3,
    "word_count": 589,
    "body": "This was around a year and a half ago when I was freshly 18. I’m a pretty attractive gay male so I regularly got hit on at work. I was a server so it was pretty much my job to flirt with them back. After a long day of pretending not to be a raging bitch all day, some guy came in at 845. We closed at 9. He immediately put his head down after sitting down, which was very odd, and he held a very dark energy. I walked over and took his order. He got a brisket platter that came with top sides. He ordered the slaw and asked if the Mac and cheese was good. He looked uncomfortable and was just acting and talking in such a strange manner. I wasn’t really concerned because working in service you deal with alotttt of weird people. But when I told him the Mac and cheese was good he told me “if it isn’t good I’m going to eat your face”. My mouth literally dropped and I kind of just stared and smiled for a good 10 seconds. My manager was filling up sauces like 5 feet away and she came over immediately and asked if everything was okay. I just said “not really” and nervously laughed. I went to put his order in and his eyes stayed on me for a good 5 minutes straight. Our Mac and cheese honestly sucked lmfao so I was rly scared for what would happen next. I tell my boss and he tells me to go to the kitchen so he can’t stare at me anymore and hands me a turkey baster of all things in case I need to “protect myself”. Not really sure what I would have been able to do with that but regardless, I hid in the back with the turkey baster until he was done with his meal. One of my coworkers checked him out because they were concerned about the way he had acted towards me. Of course I’m told to take the trash out, and I see an old white truck with its lights on in the parking lot. I’m a very paranoid person so I immediately assume it’s him and I run back inside after leaving the trash by the dumpster. After we finish closing it’s around 1130 pm and I finally get to go home. I don’t see the white truck anymore and I begin driving. I only lived 2 miles away at the time so it wasn’t a long drive at all. Once I get to the first stop light I look behind me, and see headlights in the distance. The old white truck pulls up behind me. I’m completely freaking out at this point and I don’t really know what to do. I begin driving home and he continues to follow me. I still don’t know for sure it’s the guy but at this point I’m pressure sure. As I pulled into my neighborhood, so did the white truck. Luckily I lived in a mile and a half long neighborhood so that didn’t really give him much of an idea where I lived. I pulled into a random driveway really far on the other side of the road from my house. The truck continues on driving and I know he doesn’t know where I live. My parents were out of town so I ended up staying with one of my friends a town over. Very lucky I never saw him again"
  },
  {
    "id": "1rbwb40",
    "subreddit": "writersofhorror",
    "title": "The Sommelier of Bachmut",
    "author": "Beard-and-Beyond",
    "score": 3,
    "url": "https://www.reddit.com/r/WritersOfHorror/comments/1rbwb40/the_sommelier_of_bachmut/",
    "created_utc": 1771791448.0,
    "num_comments": 0,
    "word_count": 762,
    "body": "I shouldn’t have opened the cellar in Bachmut.\nBut then again, in the winter of 2024, curiosity is a luxury killed by the need for warmth.\n\nMy name is Marek. I am—or was—a volunteer medic. I’ve spent the last year patching up holes in boys who looked like they should be sitting for exams, not bleeding into the grey Ukrainian slush.\n\nWe were taking shelter in the skeletal remains of an old winery on the edge of the city. The shelling was constant, a rhythmic, bone-deep thrum that makes the teeth ache.\n\n\"Marek, help me with this,\" Stepan wheezed, tugging at a rusted iron ring set into the floorboards.\n\n\"Leave it,\" I said, wiping the copper-scented grime from my surgical kit. \"The drones will see the heat signature if we go deeper. It's a tomb down there.\"\n\n\"It’s a bunker,\" he countered, his eyes wide with the frantic exhaustion unique to the front lines. \"And it’s quiet.\"\n\nHe was right. The cellar didn't just feel underground; it felt outside of the war. When we finally pried the hatch open, the air that rushed out wasn't the stale, damp scent of a basement. It smelled of scorched honey and old copper.\n\nWe descended by the flickering light of a single tactical torch. The walls weren't brick. They were lined with glass jars—thousands of them—filled with a viscous, crimson fluid that refused to settle, even after decades.\n\nIn the center of the room sat a man. He didn't look like a soldier. He wore a tuxedo, pristine and black, standing in stark contrast to the filth of the 21st century. His skin was the color of a fish's belly, and his eyes were sewn shut with silver wire.\n\n\"You’re late,\" the man whispered. His voice sounded like dry leaves skittering over a grave.\n\"Who are you?\" Stepan leveled his rifle, his hands shaking. \"Russian? Wagner?\"\n\nThe man laughed, a wet, bubbling sound. \"I am the vintage. And you... you are the harvest.\"\n\nBefore I could scream, the silver wire on the man’s eyelids snapped. From his sockets, dozens of translucent, needle-like appendages erupted.\n\nThey didn't strike like a knife; they wove through the air like silk. One pierced Stepan’s throat.\nI watched, frozen, as the gore began. It wasn't just a killing; it was a distillation. The needles pumped rhythmically, drawing the blood out of Stepan’s body so fast his skin turned translucent, then grey, then collapsed like wet parchment. His internal organs were liquefied and siphoned through those terrible glass tubes. I heard his ribs snap as the pressure turned his chest into a vacuum.\n\n\"The soil of Europe is always hungry, Marek,\" the creature said, calling me by name. \"The Great War, the Second, and now this lovely little tragedy. You think the politics matter? The borders? No. We just need the friction to keep the wine flowing.\"\n\n\nI didn't run. I couldn't. I watched him fill a fresh jar with the essence of my best friend. The creature drank a single drop, and his skin bloomed with a healthy, terrifying pink glow.\n\n\"Why let me live?\" I sobbed, staring at the pile of hair and fingernails that used to be Stepan.\nThe creature smiled, revealing rows of needle-thin teeth. \"Because a sommelier doesn't work the fields. He oversees the cellar.\"\n\nHe handed me a silver needle. It was warm. It pulsed against my palm like a heartbeat.\n\nI’m writing this from a recovery ward in Poland. They think I’m a hero. They think I’m the sole survivor of a horrific Russian thermobaric strike that \"evaporated\" my unit. They see my shaking hands and think it’s PTSD.\n\nBut I have a secret.\n\nI’m not a medic anymore. I’ve been traveling the hospitals of Europe—Berlin, Paris, Warsaw, Belgrade—visiting the \"hopeless\" cases, the ones the war broke beyond repair. The doctors thank me for my \"comforting presence.\"\n\nBut they don't see what I do under the sheets. They don't see the silver needle I carry.\n\nTo be honest, I didn't serve a monster.I’ve realized he was lying. He didn't need the war to feed. He started the wars because he's a connoisseur of specific flavors. \n\nAnd as I stand over the bed of a wounded boy in Warsaw, I realize I’m not just a servant. I’ve developed a palate. The blood of the innocent is sweet, but the blood of those who have killed? It tastes like vintage champagne.\n\nI’m not trying to stop the war. \nI’m making sure it spreads. \nI need the cellar to stay full, and I’m getting very, very thirsty."
  },
  {
    "id": "1rc2k4i",
    "subreddit": "writersofhorror",
    "title": "The Redwood Ship [Part 12]",
    "author": "NullandParanoid",
    "score": 3,
    "url": "https://www.reddit.com/r/WritersOfHorror/comments/1rc2k4i/the_redwood_ship_part_12/",
    "created_utc": 1771806319.0,
    "num_comments": 0,
    "word_count": 561,
    "body": "Day 17 at the Cabin\n\nI'm really sorry about that last post. I do have an explanation, I just feel so stupid. I take a few different medications, I won't say what kinds of what they're for, and I did disclose this with those newspaper guys. What I didn't tell them is that I also, from time to time, partake in certain substances that sometimes don't interact well with these medications. A reaction that often occurs because of this is my body just sorta wanders around while my mind is completely checked out. It's not exactly like sleepwalking though I do experience things very close to nightmares when this happens. I'm actually very prone to night terrors. \n\nAll of that to say, I typically hide my laptop away somewhere so I don't do anything stupid. I was left so out of sorts by Otis' visit that I forgot to do that. And I took more than I have been. I don't remember typing up that last entry. I'm only see it this morning because I was out cold most of yesterday recovering from my experience. I think I went outside too. My shoes have mud on them. I also think that cut on my hand got infected at some point. I keep trying to pull out the scabs and clean the pus, but the green hue isn't going away. I poured alcohol on it, then drank the rest, and used the rest of the bandages Otis gave me so I'll see how that turns out. \n\nI've decided to stick this out, the staying in the cabin/ship thing. Not necessarily just for the money, but I just feel like I have to. Some bigger thing is going on, I think, and I just want to see it to the end. Even if it has nothing to do with me, I kinda want it to. Being out here has given me a larger sense of reality and I'm not ready to leave that. That picture of the lighthouse has been leering at me since I woke up. I think I'll take it down tomorrow.\n\nI keep rereading that last post. I've had nightmares similar to it I guess. Like family stuff I don't like thinking about. Usually they aren't so topical, but I guess that stress is really eating at me. Not to get super in to it, I just feel bad about uploading that, my dad disappeared when I was like seven. I think he died, but no bodies ever showed up. It doesn't feel like he's dead I guess, but he's certainly not around. Mom doesn't keep pictures of him, so I just have my memory, but she says I look like him. Don't know why she feels the need to say that.\n\nI just heard gunshots. I was up on the deck and heard this bang echo for just a second. It's not hunting season here, I don't think people are even allowed to hunt this high up. Shit I heard another. I double checked the door bolt after running to my car. Ghosts I may not know how to handle but guns, I have some practice. I read somewhere that birds can imitate some sounds. Part of me hopes it is just a bird. That sounded closer, I'm posting this now just in case I do something stupid again."
  },
  {
    "id": "1raiiu1",
    "subreddit": "writersofhorror",
    "title": "The Redwood Ship [Part 11]",
    "author": "NullandParanoid",
    "score": 3,
    "url": "https://www.reddit.com/r/WritersOfHorror/comments/1raiiu1/the_redwood_ship_part_11/",
    "created_utc": 1771650809.0,
    "num_comments": 0,
    "word_count": 899,
    "body": "I'm in the Lighthouse\n\nThere's a lighthouse that exists Nowhere and Nobody lives in it. It looks at me with its spinning, cyclopean eye, casting myself out across nervous oceans made of storm clouds. Something stands on the lookout, a shadow tripled over watches my ship stagnate at the dock, and I know it's waiting for me. Voices churn the lightning below, billowing up waves of smoke that scream at me. Plead and beg me. My hands twitch at my sides and I can feel the blood dripping down.\n\nA soul-shattering horn shakes the heavens. My judgment has called. The ship breaks at my feet, crumbling down in to the clouds, but I stay afloat. Adrift with no anchor. My judge looms over me as its light falls dead upon me. The jury circles above waiting to devour me like common cod. My executioner I know well, and I know His feelings towards me. The lighthouse foghorn descends upon me again and I think I know what is to become of me. But when the sound clears the air and I can see again, I find myself face to face with a man I barely know.\n\n\"Dad?\" I step forward, for the light shadows his features. I see him nod. \"What's going on?\" I begin to yell as the wind picks up around us. He gives no answer but moves forward as well. Lightning sparks the world and I fall to my knees. My father's soulless shark eyes watch with all the hunger I expect from an entity like him. Dead to a hurricane his body still spills with seaweed, his mouth clogged with netting but I can still see the sharp teeth working to chew through. \"What are you!\" I scream with clouds swirling around us, caught in the vicious slipstreams, obscuring everything but us and the moon falling upon us.\n\nHe only points at me. That moon haloing him in silver light while its gravity moves tides within me. His hand is webbed, tipped with razors. I look down to see the same on mine. I scream again but it's so drowned out now I can't be sure what I said, if it were words at all. Blood flows from the claws in to the growing pool I kneel in. I see faces in it. My hands fully submerge themselves as I'm forced closer. Rain begins to lash my back and makes me aware that I am bare. It stings and some external spine flexes under the onslaught.\n\nMy grandfather is in the blood, grinning up at me the way I remember my mother use to when she could be proud of me. There's others too. Faces I know and miss very much, some I don't recognize. My own face distorts until I'm looking at my father again. \n\n\"You are your father's son, for better or worse,\" my mother's voice echoes in the thunder. He stares at me with wet, unblinking eyes. Hair wild and long drifts around his face as he floats below me. Cracked lips part to release bubbles that pop against the surface, covering my face in the blood, echoing those awful words. \"You are your father's son.\"\n\nThe air is electrified, lightning cracking every few seconds with thunder trumpeting not far behind. My arms shake as the weight of the world breaks against my back. I force my head up to see the clouds part. The lighthouse stands so close now. Its glorious light replacing the paternal moon. I'm pulled towards it all the same. The foghorn's siren wail forces me to crawl up to the behemoth. Taller than any redwood. I lift my body from the swirling liquid that fights to pull me back down. The blood of the covenants and the water of the womb works in tandem to drag me away. But I'm in the lighthouse now. \n\nI'm in the lighthouse\n\nI'm in the lighthouse\n\nI'm in the Lighthouse\n\nI'm in the Light. For once in my selfish, wasted life, I'm in the Light. My God is glorious. I crawl up the stairs and the jury descends upon me. Their beaks tear at my back. They pull away chunks of scales and fins. I was born against nature and I'm reminded of this everyday. It eats away at me because I had some sort of audacity to be born. A snake eats through my mind, tearing away chunks of memory. And I crawl. And from my broken lips flow these chants.\n\n\"Storm the lighthouse and weather it down to teeth. Feast on fathoms so above as below. Shine the bell and ring the light which calls sailors to their briny tombs.\"\n\nThe top of the lighthouse thrums for me. Its light sings with me. the flock of albatross dig in to my bones. They mock me, defile me, guilt me as one booming choir.\n\n\"And it's Heave Ho, batten down the Captain's soul! Hoist yourself upon the flagpole and wait for Devil Jones to take you home!\"\n\nThey nest in my chest, vying to eat my heart, but I'm so close. That beautiful light, my sweet light. My everything. It drowns out the squawking smothering me. I reach out. So close. My fingers are scraped to bone. Flesh bubbles at my wrists. So close. One final prayer as the light kisses my broken form.\n\n\"Sunshine. Don't take, my Sunshine away.\""
  },
  {
    "id": "1r9ij0g",
    "subreddit": "writersofhorror",
    "title": "The Redwood Ship [Part 10]",
    "author": "NullandParanoid",
    "score": 3,
    "url": "https://www.reddit.com/r/WritersOfHorror/comments/1r9ij0g/the_redwood_ship_part_10/",
    "created_utc": 1771552765.0,
    "num_comments": 0,
    "word_count": 909,
    "body": "Day14 at the Cabin\n\nI slept through all of yesterday. Only got up a few times for essential stuff but it was freezing, and the bed was so warm. Woke up today earlier than Otis' arrival. I'm glad it was Otis again. We talked. I'll go in to that after I've fully internalized what he said. Before he got here I took Hampton up to my room. Didn't need him seeing what could be evidence. Maybe I should've given it to him. He could've taken it to the cops. I just didn't want to be alone again.\n\nOkay I think I've got a good final version of our conversation, yes I did take notes while we were talking. I didn't want to forget anything. He showed up while I was looking for gas cans, which I didn't think I'd find any and I was right. When his loud whistle came, my body jerked and I sliced my hand against a piece of exposed metal. He was apologetic and helped bandage it as we sat down.\n\nI didn't want him to dissolve into more ocean talk so I asked quickly, \"Who's your friend? The one you're watching this place for.\"\n\nHe shifted in his chair as the question seemed to settle heavy on his shoulders. \"You've got a spark of curiosity, Vinny, what's been fannin' the flames?\"\n\n\"These.\" I showed him the pictures I found. He gave a pleased hum as his eye scrutinized the images.\n\n\"You're quite the finder, ain't ya?\" Is all he said while he took his time looking over each one. He lingered on the picture that solely displayed the woman.\n\n\"You know her.\" I recognized that look in his eye. \"Is she the friend?\"\n\n\"Aye.\" He handed back the pictures, then gave a toothy smile. \"You find the captain's quarters?\"\n\n\"Yes. Why was it sealed off?\"\n\n\"That I don't know lad.\" He tilted his head back, staring in to the ceiling like he could see right through it, then looked back down to check a pocket watch. \"Since you got so many questions, Vinny, why don't we settle for lunch?\"\n\nA part of me was hesitant, but he was right. There were still things I wanted to know. He gave me a quick cooking lesson. Using my restocked groceries, he showed me a recipe for a nice stew. He ate two whole tomatoes by himself while everything cooked. Wouldn't answer my questions until we were sat at the dining table I had neglected to use since my original arrival. He asked me if I could say grace, which caught me off guard since he didn't seem the religious type. But maybe to him, neither did I. So I gave a quick prayer and he dug in.\n\n\"Now, tell me about that albatross on your clavicle lad.\"\n\nI tried not to acknowledge the odd saying, but when he mentioned that bird I felt my nails dig into the table a bit. \"Is this ship just a replica?\"\n\nHe took two long bites of the stew before shaking his head. \"Nothing's just something. But the soul of a ship can take many forms.\"\n\nI really didn't like the vagueness of his answer, it felt a little intentional, but I continued on all the same. \"You said there weren't any ghosts here, but I saw something. In the captain's quarters window.\"\n\nI didn't care if I sounded crazy, I was already setting aside some beliefs to admit that, I needed another opinion or something. He looked at me a long while before smiling. \"Did ya see a ghost lad?\" I could only nod in response, unable to bring myself to accept it. Otis chuckled. \"Can't let that ocean madness get to ya. Every sailor worth his salt knows what horrors lay ahead should they succumb to the visions that swim in your head.\"\n\n\"We're not on the ocean,\" was all I mumbled in response. By this point I kinda stopped taking notes, feeling overwhelmed and no longer hungry so I stood to get my medication. He made some comment about what I have left and I told him I have enough to last. When I sat back down I asked, \"do you think I'm crazy?\" I swear he kept eyeing my bottles.\n\n\"Aye lad, ocean madness ain't just from the sea. It's in your blood. You get it from your father.\"\n\nI remember not saying for a long time, and he gave me an awful pitying look. I think I said, \"What do you know about my father?\"\n\nBut he didn't answer, maybe I just thought it, instead he took his bowl to the sink and rinsed it out. The running water drowned out his words until he was standing in front of me. We were saying our goodbyes when I remembered to ask it he could bring some binoculars and gas cans up next week. He can.\n\nI know I watched him walk back to his truck, I stood on the deck. When he was out of sight I think I looked up feeling this horrible roiling in my stomach. I screamed for a very long time. Thunder rolled somewhere in the distance or just in my head. The cut had bled through the bandages. I changed them for fresh ones. I don't want another scar. I don't think it will scar. I need more. Nothing else happened. I need to hide from the moon. Bed time."
  },
  {
    "id": "1r52fdl",
    "subreddit": "writersofhorror",
    "title": "The Redwood Ship [Part 6]",
    "author": "NullandParanoid",
    "score": 3,
    "url": "https://www.reddit.com/r/WritersOfHorror/comments/1r52fdl/the_redwood_ship_part_6/",
    "created_utc": 1771120755.0,
    "num_comments": 0,
    "word_count": 810,
    "body": "Day 9 at the Cabin\n\nSo, not much to report from today. At least as far anything supernatural goes. Nope just my own stupidity and the consequences which come with that stupidity. I'll get right into it. It was a little past noon when my boredom officially peaked. I wasn't in the mood to read, and I really didn't want to go for a walk again. I found myself wandering back and forth in the living room, I tried to knock on the walls to look for secrets or something but I don't know what that would sound like, and on the deck where I could see more overcast clouds swirling. I was keeping an eye out for birds when I noticed something else. I saw during my first day here that there wasn't a ladder that went up to the crow's nest, felt it was because the folks who build this either didn't add one or took it away for safety reasons or what have you, but when I examined the mast again I saw it. The \"rungs\" were carved into the tree. Now just looking up at the lookout gives me awful vertigo, but with nothing else to do I figured why not and decided to climb it.\n\nWith the mast being a redwood, branches and leaves removed, it's a tall piece of work. I was careful, going slow and not looking down that much. My pace felt like I was going ten feet a minute. I swear it took me, like, half an hour to get to the platform. Enough time for the shadows to move around me and fog to roll in, or maybe I was just at cloud level. Because the circumference of the mast is so big the platform gave me a lot of room to walk around on, thankfully. Of course just the idea of looking over the barrier wall made me want to vomit, so I stuck close to the trunk while I did my looking around.\n\nThat's when I saw it. A lockbox tucked into a carved out alcove. I pulled it out and gave it a onceover. Looked pretty normal, didn't seem old or weathered. No key though, I would've had to break it to open it and that seemed like a lot of work for something that was most likely empty. It felt empty at least and shaking it brought up nothing so I put it back and resumed my meandering around.\n\nI caught more glimpses of birds through the fog up there, some squirrels too if I looked into it long enough, they didn't want anything to do with me though. One bird however, a crow or raven I don't really know the difference, came and perched itself on the barrier wall. It just watched me, tilting its head back and forth and hopping along the edge. I went towards it, its behavior made me want to test its tolerance of me, but now I know I should not do that. It darted at me out of nowhere and in my frenzy to keep its talons out of my face I almost fell over the wall.\n\nLuckily, I didn't, I was able to catch myself, but I did end up looking down and had the very unpleasant view of watching the peaches I had for lunch make their way to the deck below. Climbing back down took longer than going up, and cleaning the upchucked peaches took even longer cause I had no idea where the bleach was. It never occurred to me to look for the cleaning supplies these past few days, I guess that's on me, but who the hell puts cleaning supplies in a towel closet?\n\nI don't know how to get stains out of wood and it feels too late to look it up now. I scrubbed at it for a while, wood's just discolored now. I swear if I get fined for damages, I'll sue them for unsafe architecture or something. I caved and checked out the books again while boiling water for the ramen Otis brought up, the saint of a man. My eyes went back to Moby Dick and I begrudgingly grabbed it up. It's not a bad read so far, a bit long winded, but not completely boring. I got through a few chapters while I ate and then while waiting for it to be late enough to justify going to sleep.\n\nThere's not enough room on the bedside table to put it there tonight, and the drawers are filled with my clothes, so I put the book on the floor to be read some more in the morning. And that's it for now. I'm gonna try and get some shut eye with the sounds of this nearby owl. Its hooting sounds accusatory, but I'm surely just imagining it. Goodnight."
  },
  {
    "id": "1qyznk4",
    "subreddit": "writersofhorror",
    "title": "The Redwood Ship [Part 2]",
    "author": "NullandParanoid",
    "score": 3,
    "url": "https://www.reddit.com/r/WritersOfHorror/comments/1qyznk4/the_redwood_ship_part_2/",
    "created_utc": 1770525846.0,
    "num_comments": 0,
    "word_count": 909,
    "body": "Day 2 at the Cabin\n\nNot much to report from today. Doubt I'll do this every day I'm here. I did go out for a better look around though. Then layout of this cabin is kept very close to the actual ship's layout, as far as I can tell looking at this rough diagram on my laptop. This ship is just like, much bigger. Anyway the only bedroom was the one I slept in, part of the forecastle, and it makes up the front end of the second floor. The first floor is where the living room, kitchen, and bathroom are arranged in the hull of the ship. The main deck, which is the only way to access the bedroom, is like a huge balcony. Letting you see out over an ocean of giants surrounding you.\n\nI'm explaining the layout like this mostly cause I can't find the captain's quarters, and it's kinda bugging me. According to this pretty simplistic diagram, the room should be on the back end of the ship but there's no door. Just the same wood lining the rest of the ship. The latter part of my exploration led to what can be considered the third floor of this eccentric cabin. Not the crow's nest though, that shit's too high up for me.\n\nThe forecastle deck and the quarter deck, which are on opposite ends of the main deck, are just higher up balconies really. I've got a really good vantage point from the quarter deck. These mountains are beautiful and I'm not even much of an outdoors guy. They just go on forever. Views like that give me a decent understanding as to why some people crave isolation from society.\n\nWhile I was up there, I felt that unmistakable sensations of being watched. When the hairs on the back of your neck prick up, when your heart and lungs suddenly sound so loud you're forced to confront the silence around you. It took just a quick look around before I spotted an owl, way high up. I thought the little guy was looking right back down at me until I pulled my phone out for the camera. Zooming in, its head was actually turned towards something a ways from the cabin. Probably its next meal. It was blurry but I snapped a picture then went back inside to get out of the chilly air. I dug through the pantry some more, hoping to find something more filling than cereal or mac and cheese but the freshest thing I came across was a whole basket of tomatoes (which seems like a lot but what do I know).\n\nI succumbed to the cereal again, with almond milk by the way because that's the only option, and sat near the furnace for some warmth. When that was finished I perused the small assortment of books at my disposal. I guess they were left by prior tenants or the owners. It isn't a good selection. Mostly educational reads on hiking or sailing, to play into the theme I assume, but there were a lot of Jules Verne books too. I've read like maybe one of his before, the center of the earth one I think, so I grabbed an interesting sounding title. It's called \"The Lighthouse at the End of the World\". There's a lighthouse on the cover, fucking obvious I know, but there's also this huge portrait of a lighthouse right next to the bookshelf so I felt a little compelled to pick it. I hunkered down in a chair and got to reading. I barely got in to chapter two when something outside stole my attentions. There was this heavy rattling or I guess grinding noise coming from the other side of the wall.\n\nThe door was the only thing altered about the hull. No windows were added, probably for structural stability. And these walls are thick, so for something to be making that much noise it had to be purposeful. I just listened for a bit, worried it was a hunter who hadn't gotten the memo that somebody was here. Or worse, that those rumors of a mountain murder cult were more than just rumors. When it just kept going I abandoned the living room and crept up the stairs. I thought I could look down from the deck to check out what was going on.\n\nLooking over the railing I didn't see anything. No creature or man wandering around the cabin, certainly nothing that could scratch that hard against the wall. I figured my next course of action was to check for any damages. A part of me was still hoping I had just been imagining it, sometimes I just hear things, or maybe I mistook the crackling furnace wood for scratching. But when I went outside I saw the reality of it all.\n\nLong gashes were carved into the wood about two feet out of my reach. A large oval chunk had been stripped out of the first layer of planks. That's got to be from a moose, right? I'm pretty sure there are moose out here. I really hope I don't get some crap rental fee because of this. Rest of the day was boring. I'm just typing this up now before calling it a night. If I have another dream I probably won't include it. These posts are supposed to be about the cabin, not my personal problems. See you later."
  },
  {
    "id": "1qwkecu",
    "subreddit": "creepystories",
    "title": "\"Date Gone Wrong\"",
    "author": "Which_Republic4558",
    "score": 2,
    "url": "https://www.reddit.com/r/Creepystories/comments/1qwkecu/date_gone_wrong/",
    "created_utc": 1770295735.0,
    "num_comments": 0,
    "word_count": 327,
    "body": "&amp;#x200B;\n\nMy date is a beautiful girl. She's also very nice and sweet. \n\nShe's also very good at conversation and polite. \n\nWe have been on a couple different dates and none of her good qualities have changed. \n\nThe only thing that is unsettling is the fact that I recognize her but I've never seen anyone that looks like her. Beautiful but has mystery. \n\n\"What are you looking at, Cleo?\" \n\nHer beautiful eyes sparkle as she looks at me in a flirtatious way. \n\n\"I'm admiring your home. I'm glad that we're having a date in your house. I hope that this means that we're gonna be getting more serious.\" \n\nI chuckle. \n\n\"We would have to get to know each other more.\" \n\nHer frown appears and then disappears. A evil smirk appears. \n\nShe crawls on top of me and her blue eyes start to flicker to black. \n\nHer eyes? Blue? Black? Changing colors? What the hell? \n\nI push her off of me and try to sprint but I get dragged back to her.\n\nHer hands didn't drag me back. The air did? she's doing it? What?\n\nShe chuckles as her pitch black eyes haunt mine. \n\n\"Once upon a time, many years ago. Centuries ago. A young lady rejected you.\" \n\nImages start to appear in my head as her voice leads me through the story. \n\nThe young lady looks just like her. The same features. \n\n\"It all seemed wholesome until I rejected you.\" \n\n\"You accused me.\" \n\nThe vivid and horrifying images show the young lady being tortured and everyone around her is screaming about her being a witch. \n\nHer helpless eyes and weakened body from the torture leave a filthy stain in my soul. Her tears as she takes her defeated last breath leave me feeling worse. I did this? \n\n\"I wasn't a witch but I am now.\" \n\nShe starts walking close to me. Her expression leaving me no questions about my demise. \n\n\"You will die in every single lifetime.\""
  },
  {
    "id": "1r7r2c4",
    "subreddit": "writersofhorror",
    "title": "The Redwood Ship [Part 9]",
    "author": "NullandParanoid",
    "score": 2,
    "url": "https://www.reddit.com/r/WritersOfHorror/comments/1r7r2c4/the_redwood_ship_part_9/",
    "created_utc": 1771382689.0,
    "num_comments": 0,
    "word_count": 564,
    "body": "Day 12 at the Cabin\n\nI tried emailing the guys who own this dumb boat, haven't heard anything back. Hampton's set up in one of the arm chairs so I don't forget I have it. It is kinda nice to pretend I'm talking with him. I've been talking to myself a lot while I've been here. I use to talk to him a lot, good kid. I wanted to wait til I heard back from the owners, but since my email has gone unanswered for the better half of the day I've decided to go ahead and open this lock box.\n\nSo this has to be a prank. That's what this whole place is. One big fucking prank because there's no way, seriously I cannot take this anymore. \"Live 30 days in a prank house\" that's what I signed up for. There are pictures in the lock box. Pictures of this dumb pile of wood, but with people on it. And these pictures look very similar to the one Otis gave me. The ones in the box all have this same lady, she's warped in some what in each photo. Like her face is blurry, but these old pictures required you to stay still right? They have to be old, everyone is dressed weird. And with all those people for scale now, the boat in the pictures looks to be the same size as the cabin.\n\nI've been pouring over these pictures for almost two hours now. Comparing some of them to places on the boat, it's definitely the same boat, and seeing what use to be here. One of the few things to stay the exact same is the bookshelf and the picture of that lighthouse. Really good replica, yep. There's this one picture of that lady standing in front of the captain's quarters door. I can see her smile in this one, it's nice. I went up to the deck to compare and, ya there should be a door under the quarterdeck. I kicked against the wall a bit, still sounds solid. I kicked against the bedroom door. Sounds almost identical.\n\nThe air is metallic again. I hear thunder far off. Something's walking towards me. That rain was just a precursor of something bigger. No one's texted me back. I wonder if they notice I'm gone. Of course they do, I'm catastrophizing again. I stood on the forecastle deck for a while. Haven't touched the wheel yet. Feels weird. Not that I think it would move with the rudder buried in the dirt.\n\nI'm really just trying to distract myself. Like what can I do? I'm not about to actually deface the cabin. That room has to be sealed for a reason anyway. Besides it's all a prank! One big prank pulled on a broke college kid down on his luck. Almost halfway over. Otis, or someone, should be here the day after tomorrow with my new restock. He has to tell me what he knows. This picture he gave me. He said there weren't any ghosts. Birds are watching me again, what's so damn interesting about me? Why do their heads twist like that?\n\nMy eyes hurt so much, I've been staring at this screen for too long. Is the joke to drive me insane? What's insanity feel like? Folks say grandpa was insane. I should sleep. I just need sleep."
  },
  {
    "id": "1r6u1f7",
    "subreddit": "writersofhorror",
    "title": "The Redwood Ship [Part 8]",
    "author": "NullandParanoid",
    "score": 2,
    "url": "https://www.reddit.com/r/WritersOfHorror/comments/1r6u1f7/the_redwood_ship_part_8/",
    "created_utc": 1771295988.0,
    "num_comments": 0,
    "word_count": 912,
    "body": "Day 11 at the Cabin\n\nI think I messed up.\n\nI went through that kid's stuff, and I recognized him. There were textbooks, like highschool shit, and his name was written in them. Hampton Whittaker. That name probably doesn't mean a lot to most people, but it means a hell of a lot where I'm from. That's the name of a kid who went missing less than a year ago. I helped his mom put up missing posters. I didn't know him really well, but he lived close by. It was a case that got dropped cause the cops claim there wasn't anything more they could do.\n\nMy friends and I didn't stop looking though. Anywhere his parents could think of, we drove and searched. There was a theory, a dumb rumor, that he had been kidnapped by this group that's been doing weirder and weirder shit lately. I have to get this bag to the cops as fast I can, right? Calls aren't going through, why can't you text 911? My car won't be much help either. Damn myself, I should've filled the tank before getting up here. Maybe there are gas cans somewhere. Other than that I have no clue what to do.\n\nI tried to relax. Yes, it's a big deal but there's literally nothing I can do in this specific moment unless I just start walking down the mountain. And that's not happening. Sorry Hampton. I can't stand being in the cabin right now, not with his bag here. I need a walk to collect my thoughts. They keep getting away from me, I have to find them.\n\nSomething's wrong with me. The dissociation is hitting harder. I wasn't walking anywhere specific but clearly some part of me was searching for something. I ended up in that damn cave. My head cleared as I was walking past its rocky maw when fear seemed to override what was in my system. I didn't take anything before leaving. Nothing seemed different, and that box was calling my name. Curiosity may have killed the tomcat but satisfaction always brings him back. There wasn't a lock.\n\nThere were a few loose papers and a small burlap bag. I skimmed the papers, but I really shouldn't copy them here. That could get me in serious trouble, they'll come after me, if the wrong people see what I've done. Is this being overly cautious? I'm not about to be shoved into a bag and tossed into the river. I only have so many lives left. The papers got shoved back somewhere, I think I kept them. Inside the pouch was what the papers claimed would be there: a key. It wasn't a copy to the cabin which was my biggest worry. I have an idea to what this goes to.\n\nI can't be here anymore. But I can't leave. There's cash or something, and I need somebody. I need sunshine. Why the hell did I not bring headache pills? The key goes to the lockbox, but I haven't opened it yet. I'm scared for some reason, but my curiosity is frothing. Did Pandora feel the same? I won't think about it. That's what I should do, just forget. I'm good at that. My head hurts so much, that bump doesn't look any worse though despite what my reflection thinks. I can't even tell if I'm talking or\n\nSorry about that, don't worry about that. I'm choosing to leave that here for transparency. I was asked to record my experiences, and these little breakdowns are apart of the experience. Nothing supernatural, I just got so stressed this morning because of the bag that I forgot to take the medication. But we don't need to get into that. I found those cave papers in my pocket, let's talk about that. It's nothing really serious, I was just stressed earlier.\n\nSo there's this group, I'd bet not really big, and they are a little culty. Like Heaven's Gate levels of out of it. A while back I had a short conversation with a dude who was a part of it. They call it Neo-Christianity. Instead of Heaven, they're working to to get to some network. I don't exactly remember all of the details. These papers seem to be from a guy who, like, defected from the group. To type up all of this would be way too tedious. I'll summarize important details to keep this simple.\n\nIt's important to understand this group has their own version of the Bible, and something in it talks about to get to this \"network\". This guy apparently found something he calls an \"access port\" on this ship. And he thinks nobody should see it, literally how he words it, so he hid this key away. Still haven't opened the lockbox, too much has happened today. Too much stress. Then he goes on about hiding this stuff in that cave to make sure nobody finds it. Except for me, the nosy bastard I am. There's nothing about if he left or went off to attempt. But I could've sworn that bed was warm. Like body warm, especially with this weather, something else definitely warmed up that cot.\n\nTomorrow, I'll open the box tomorrow. Now, I need sleep. All of this has been consuming me. The tapping is driving me crazy. These birds are watching me. Maybe Otis has an idea about all of this, I'll ask next time I see him. Goodnight."
  },
  {
    "id": "1r0qxvo",
    "subreddit": "writersofhorror",
    "title": "The Redwood Ship [Part 3]",
    "author": "NullandParanoid",
    "score": 2,
    "url": "https://www.reddit.com/r/WritersOfHorror/comments/1r0qxvo/the_redwood_ship_part_3/",
    "created_utc": 1770697232.0,
    "num_comments": 0,
    "word_count": 972,
    "body": "Day 4 at the Cabin\n\nWell, half a week in and I'm dying of boredom. I finished that book and debated grabbing another but I'm not a big reader so I'm gonna need a break from that. I humored the idea of bird watching but without actual binoculars all I could really get were some blurry outlines on my phone's crap camera. After pacing the length of the cabin, checking for ghosts, and exhausting the entertainment available on my phone I went outside.\n\nThe gashes on the side of the cabin still make me nervous. The thought of some dumb, lumbering beast wandering around here doesn't exactly spark the adventurous spirit. But I'd probably hear it before I saw it, so that gave me some confidence. Besides I was due for a nature walk. There are some foot trails around here, and unsurprisingly there's not a lot to see out here. The trees are really cool, I don't know how many more times I can say that though. Sometimes when I look straight up around a bundle of them it looks like the trunks bend in on each other and I get this really intense vertigo. Not much for entertainment, but still pretty I guess.\n\nEventually I stumbled across something interesting. One of the trails leads down a slanted cliff face. The view from there is breathtaking. Really felt the wonders of nature when I took it all in. I'm not super good at describing things like this, but I'll try if just to pad out this entry a bit. Man those newspaper guys are gonna be so disappointed when they finally see what all that money is going towards.\n\nThe forest just goes on for mile, to start with. All the tops of these gargantuan redwoods connect together to make this sort of carpet leading to the horizon. But there are these gaps that give glimpses to the trunks below. Everything is draped in shadow right under the leaves. And it all gets swallowed up by the horizon. An overcast blueish gray colliding with the dying green. Not to sound like a naturalistic guru or whatever, but this is really something to be experienced in person. Simply an insane emotion.\n\nAnd the trail seems to keep that view most of the way down the cliff. I don't know, I'm not a huge fan of looking directly down a cliff face so it's difficult to see exactly where it goes. It looks like it's for rock climbers or more intense hikers, so I will definitely not be going down it. The wind was strange there too. One sudden gust actually pushed me a step closer to the edge, dislodging a big chunk of rock right under my foot. Immediate nope back to the cabin.\n\nOn my way back I got that feeling of being watched again. Maybe some birds or a deer wondering what the fuck is walking through their forest. Or something like that. I looked towards the branches hoping to see another owl or maybe a hawk. I envy birds so much; their freedom over the winds and sky. Just a little fact about myself. Anyway I did see something in the trees but it wasn't a bird. It wasn't an animal. At first glance it was just this sorta oblong shadow perched on one of the many branches. To get any closer would lead me off the trail, so I hoped for no snakes and went into the taller grass.\n\nWhen I got to the tree I had to crane my neck back in order to get a decent idea of what this thing was. It was a backpack. I'd say twenty-five feet up, and no lower branches to attempt my own ascension with. My first thought was that a bear had put it up there. I don't even know if there are bears in the woods but the thought brought a dark, anxious cloud over me. I immediately turned around as if the culprit of the hanging backpack was standing right behind me. But I was alone, as reality would obviously dictate. All alone.\n\nI used my phone camera to zoom in and look for any identifiers, it seemed like the right thing to do at the time. There was some sort of tag hanging from a lanyard but it was too far and too small for my phone to focus. I should've packed my binoculars. While I was messing with some settings this huge rush of cold wind sliced through me and I came to the sudden conclusion that this was a waste of my time. Besides I could come back later, if it really started to bug me.\n\nOh here's something for the papers though; someone was in the cabin. I caught them through the window just as I had turned from the path. They walked right by it at first and I thought it was just a trick of the light until I did a double-take only to see they were straight standing there now. I have no clue what room they were in. That window, on the back end of the second floor, just seemed decorational to me. I combed the whole cabin. Nobody was there.\n\nStill kinda feels like I'm being watched, I always feel like I'm being watched. I signed up for spooky stuff, but seeing a full on silhouette staring down at you? Even if I wasn't sleeping here I'd be freaked out. But I am sleeping here and I am so freaked out. I'm typing this in bed right now, back pressed to the wall and eyes going between the locked door and closed window. I'll post this before falling asleep, so if I do get spontaneously murdered in the night there's at least this record. Til next time, hopefully."
  },
  {
    "id": "1qviu74",
    "subreddit": "writersofhorror",
    "title": "My city experienced a massacre 30 years ago, now they're back and they want the survivors",
    "author": "FormalAntelope3622",
    "score": 2,
    "url": "https://www.reddit.com/r/WritersOfHorror/comments/1qviu74/my_city_experienced_a_massacre_30_years_ago_now/",
    "created_utc": 1770192689.0,
    "num_comments": 0,
    "word_count": 791,
    "body": "Originally from r/nosleep\n\nI live in Windmere, a town with charming boutiques and a dark piece of history locals call the Conwell Incident. It happened thirty years ago, at the Christmas Eve parade. I was just a kid. I don’t talk about that night, but I survived it with my friend Tyrell.\n\nWhat I will talk about is what’s happening now.\n\nIt started nine weeks ago. Lia vanished. She was a survivor, like Tyrell and me. CCTV from the noodle shop where she’d been eating showed her staring at a wall for three straight minutes, her noodles going cold. Then, without a sound, she leaned forward… and passed right through it. The solid brick just swallowed her up.\n\nThe police called it a camera glitch, a trick of the light. They wrote it off.\n\nTwo days later, Michael and Crystal disappeared from their living room. Their house is on the old parade route. Their security system went offline at 2:17 AM. The last frame of footage is a shot of the empty room, the TV reflecting the front window. In the reflection, two figures are standing in the middle of the street outside, staring at the house. The image is too grainy to make out faces, but the timestamp matches the moment the feed died.\n\nFour days after that, Mayor Amanda was in her award-winning garden, also on that road. Her assistant turned around to get a trowel. When she looked back, the mayor was gone. The soil where she’d been kneeling was undisturbed. No footprints led away.\n\nThat’s when I started thinking: Lia, Michael and Crystal, and Mayor Amanda were all survivors of the incident.\n\nI talked with Tyrell about it, and he was as paranoid as I was. He’d been observing, and it seemed more and more people were going missing—not by 3%, but by 35%.\n\nWe decided to investigate. We retraced the missing people’s last known locations: Lia was at the starting point of the parade, then Michael and Crystal were a few meters away, then the Mayor was nearby, interviewing people about the parade.\n\nThe last ones were me and Tyrell.\n\nThree nights ago, I was on the phone with him. His breathing was shallow, a quick rasp against the receiver. “It’s outside my window,” he whispered.\n\n“What is? Tyrell, what do you see?”\n\n“A tall shape. Black. Like a… a cut-out of a person. It’s wearing a cap.” His voice hitched. “Just like he did. Just like Conwell looked.”\n\nMy blood turned to ice. We never described him to each other. We never talked about what we saw that night. But we both knew. The cap was a detail that never made the public reports.\n\n“Get away from the window,” I urged, my own hands shaking. “Go to a different room. Right now.”\n\nI heard a shuffle, a muffled thump. Then his voice came back, strangely calm. Hollow. “Don’t worry about it, bro.”\n\n“Tyrell?”\n\n“It’s not harmless.”\n\nThe line went dead.\n\nI called back twelve times. I drove to his house. His car was in the driveway, the front door unlocked. The house was empty. Cold, like the heat had been off for days. On the floor by the back window, his phone lay shattered, as if dropped from a great height.\n\nI haven’t slept since. I sit in my living room, all the lights on, and I watch the walls.\n\nBecause I see it now, too. Not outside. Not yet.\n\nIn the periphery. A tall, black stillness in the corner of a hallway. A dark, cap-shaped silhouette against my curtains when I know there’s no tree outside that window. It’s never there when I look directly. It only exists in the edges of my vision, a persistent afterimage burned into the world.\n\nAnd the urge is coming back. The same one that must have gripped Lia as she stared at the noodle shop wall. It’s not a thought. It’s a deep, physical pull, a magnetic yearning in my bones to just… stop. To pick a spot on the plaster and give it my full, unwavering attention. To look at it until the world behind it makes sense.\n\nThe Conwell Incident isn’t over. It’s cleaning up. It’s collecting the witnesses who were never supposed to leave.\n\nTyrell was wrong. He said it wasn’t harmless.\n\nBut it’s not trying to harm us. It’s trying to take us back to where we belong. To finish the parade route.\n\nAnd I’m the last one left on the map. The pull is in my chest now, a constant, quiet hum. My front door is locked, but I don’t think that matters. The way out—or the way through—isn’t a door anymore.\n\nIt’s right there. On my wall. It’s starting to shimmer."
  },
  {
    "id": "1qm685r",
    "subreddit": "writersofhorror",
    "title": "Slimbies: Girl by D. R. Long (Sci-Fi/Post-Apoc/Horror) Novella",
    "author": "D_R_Long",
    "score": 2,
    "url": "https://www.reddit.com/r/WritersOfHorror/comments/1qm685r/slimbies_girl_by_d_r_long_scifipostapochorror/",
    "created_utc": 1769306973.0,
    "num_comments": 0,
    "word_count": 147,
    "body": "When the Slimbies outbreak began, the warnings sounded like just another emergency broadcast.\n\nA few bad reactions. A precaution. Nothing to fear.\n\n\n\nBut in one small Delaware home, just before Christmas, everything falls apart.\n\nEvan brings home a frightened puppy to brighten the holiday, unaware that the world has already begun to die. By morning, Noah, Mara, and the puppy are on the run, leaving behind the only family they’ve ever known.\n\n\n\nWhat follows is two harsh years of cold floors, shuttered towns, thin rations, and the too-quiet dead.\n\nTogether, the three of them learn the rules of a broken world: move early, trust nothing, and stay away from anything that moves.\n\n\n\nBleak, intimate, and rooted in the small mercies that keep us alive, Slimbies: Girl is the haunting origin story of the dog who becomes the heart of the Slimbies world.\n\n\n\n\n\n\n\nAvailable now on Kindle Unlimited."
  },
  {
    "id": "1rc0tt1",
    "subreddit": "creepystories",
    "title": "The Sommelier of Bachmut",
    "author": "Beard-and-Beyond",
    "score": 1,
    "url": "https://www.reddit.com/r/Creepystories/comments/1rc0tt1/the_sommelier_of_bachmut/",
    "created_utc": 1771801937.0,
    "num_comments": 0,
    "word_count": 762,
    "body": "I shouldn’t have opened the cellar in Bachmut.\nBut then again, in the winter of 2024, curiosity is a luxury killed by the need for warmth.\n\nMy name is Marek. I am—or was—a volunteer medic. I’ve spent the last year patching up holes in boys who looked like they should be sitting for exams, not bleeding into the grey Ukrainian slush.\n\nWe were taking shelter in the skeletal remains of an old winery on the edge of the city. The shelling was constant, a rhythmic, bone-deep thrum that makes the teeth ache.\n\n\"Marek, help me with this,\" Stepan wheezed, tugging at a rusted iron ring set into the floorboards.\n\n\"Leave it,\" I said, wiping the copper-scented grime from my surgical kit. \"The drones will see the heat signature if we go deeper. It's a tomb down there.\"\n\n\"It’s a bunker,\" he countered, his eyes wide with the frantic exhaustion unique to the front lines. \"And it’s quiet.\"\n\nHe was right. The cellar didn't just feel underground; it felt outside of the war. When we finally pried the hatch open, the air that rushed out wasn't the stale, damp scent of a basement. It smelled of scorched honey and old copper.\n\nWe descended by the flickering light of a single tactical torch. The walls weren't brick. They were lined with glass jars—thousands of them—filled with a viscous, crimson fluid that refused to settle, even after decades.\n\nIn the center of the room sat a man. He didn't look like a soldier. He wore a tuxedo, pristine and black, standing in stark contrast to the filth of the 21st century. His skin was the color of a fish's belly, and his eyes were sewn shut with silver wire.\n\n\"You’re late,\" the man whispered. His voice sounded like dry leaves skittering over a grave.\n\"Who are you?\" Stepan leveled his rifle, his hands shaking. \"Russian? Wagner?\"\n\nThe man laughed, a wet, bubbling sound. \"I am the vintage. And you... you are the harvest.\"\n\nBefore I could scream, the silver wire on the man’s eyelids snapped. From his sockets, dozens of translucent, needle-like appendages erupted.\n\nThey didn't strike like a knife; they wove through the air like silk. One pierced Stepan’s throat.\nI watched, frozen, as the gore began. It wasn't just a killing; it was a distillation. The needles pumped rhythmically, drawing the blood out of Stepan’s body so fast his skin turned translucent, then grey, then collapsed like wet parchment. His internal organs were liquefied and siphoned through those terrible glass tubes. I heard his ribs snap as the pressure turned his chest into a vacuum.\n\n\"The soil of Europe is always hungry, Marek,\" the creature said, calling me by name. \"The Great War, the Second, and now this lovely little tragedy. You think the politics matter? The borders? No. We just need the friction to keep the wine flowing.\"\n\n\nI didn't run. I couldn't. I watched him fill a fresh jar with the essence of my best friend. The creature drank a single drop, and his skin bloomed with a healthy, terrifying pink glow.\n\n\"Why let me live?\" I sobbed, staring at the pile of hair and fingernails that used to be Stepan.\nThe creature smiled, revealing rows of needle-thin teeth. \"Because a sommelier doesn't work the fields. He oversees the cellar.\"\n\nHe handed me a silver needle. It was warm. It pulsed against my palm like a heartbeat.\n\nI’m writing this from a recovery ward in Poland. They think I’m a hero. They think I’m the sole survivor of a horrific Russian thermobaric strike that \"evaporated\" my unit. They see my shaking hands and think it’s PTSD.\n\nBut I have a secret.\n\nI’m not a medic anymore. I’ve been traveling the hospitals of Europe—Berlin, Paris, Warsaw, Belgrade—visiting the \"hopeless\" cases, the ones the war broke beyond repair. The doctors thank me for my \"comforting presence.\"\n\nBut they don't see what I do under the sheets. They don't see the silver needle I carry.\n\nTo be honest, I didn't serve a monster.I’ve realized he was lying. He didn't need the war to feed. He started the wars because he's a connoisseur of specific flavors. \n\nAnd as I stand over the bed of a wounded boy in Warsaw, I realize I’m not just a servant. I’ve developed a palate. The blood of the innocent is sweet, but the blood of those who have killed? It tastes like vintage champagne.\n\nI’m not trying to stop the war. \nI’m making sure it spreads. \nI need the cellar to stay full, and I’m getting very, very thirsty."
  },
  {
    "id": "1radhgd",
    "subreddit": "creepystories",
    "title": "Ever Heard A Man Scream With No Lungs?",
    "author": "BloodySpaghetti",
    "score": 1,
    "url": "https://www.reddit.com/r/Creepystories/comments/1radhgd/ever_heard_a_man_scream_with_no_lungs/",
    "created_utc": 1771636138.0,
    "num_comments": 0,
    "word_count": 942,
    "body": "A sick man kidnapped me. He seemed remorseful after the fact, speaking about some alien entity threatening to destroy the whole world unless he sacrifices me to this entity. A thing he called Unketzez. Since his actual name isn’t particularly relevant, I’ll refer to him as John.\n\nSee, John had a very disorganized speech and an impossible train of thought. Surely, he was delusional. Clearly ill, as I said. I let myself be taken hostage because I have time and very little to do with my time. With that in mind, I played along with the poor man.\n\nJohn, for all of his faults, worked hard to delay what he thought was inevitable.\n\nUnfortunately, Unketzez won out, and I had to be sacrificed.\n\nNeedless to say, it didn’t work out as intended. Not for a lack of trying. No, John tried to sacrifice me. Technically, he succeeded.\n\nTechnically.\n\nIt didn’t work out because I am immortal. I cannot permanently die, not as far as I know. Trust me, I’ve tried; others have tried to kill me, too. Nothing seems to work so far. Temporarily, I can “die,” but eventually my body fixes itself. There are drawbacks to that; I’m not immune to the pains of dying.\n\nAnd John, well, John made it a very long night…\n\nI was partially flayed, with a hot iron, force-fed my own burnt skin, then disemboweled and hanged from my own intestine.\n\nAfter that, the mad bastard tore open my back, shattered my ribcage, and draped the lungs over the exposed bone.\n\nI felt all of that, every single moment.\n\nAdrenaline shots worked like magic to keep me awake and prolong my suffering.\n\nThere are no words to describe the agony John put me through. Bless his heart, he kept apologizing and weeping throughout.\n\nImagine a man screaming with no lungs; that’s what it was like.\n\nEventually, it stopped, and I “died”.\n\nImagine John’s shock when he found me walking out of his basement unscathed.\n\nHe looked and screamed like he’d seen a ghost. I could’ve laughed if he didn’t stab me through the arm and a lung in that moment.\n\nPinning him to the wall was surprisingly easy before I spun him a tale. Playing into his delusions, I told him that I, too, was a devotee of Unketzez and that the whole ordeal was just a test to see whether he was worthy of an awakening.\n\nBeing the sick man he was, he believed every word.\n\nI explained that I was immortal thanks to our god. In reality, it’s been so long that I don’t know if I was born this way or became like this. What I do know is that if someone eats my flesh or drinks my blood, they gain some superhuman ability.\n\nI mentioned how I’ve been killed many times before, in part to be consumed.\n\nWhat happens every time, though, is that whoever partakes in my consumption ends up with an ability that inadvertently kills them.\n\nEvery single time.\n\nSo, I told John that drinking my blood would make him an immortal, too.\n\nIt’s hard for me to say I was angry with him; one effect of a long life is detachment. I couldn’t care less what happened to this insignificant creature, but a terrible night was worth teaching a lesson over.\n\nSo, I convinced John that he wanted this immortality I was promising him, and once he agreed, I pulled out the knife from my body, I shoved my wounded arm straight into his mouth, making sure he got a good taste of my blood. I kept it there until he started gagging and regurgitating and wouldn’t stop, even then. Only relenting when the collapsed lung in my chest finally knocked me out, and we both fell to the ground.\n\nI came to my senses only hours later, to the sound of a weeping man.\n\nThe room was coated in patches and handprints of gold.\n\nAlmost everything around me shone with an auric radiance; the walls, the floor, the furniture. Everything had a tinge of that precious metal coating it.\n\nAt its center, facing me, sat John, half covered in gold himself, rocking back and forth.\n\nThe metal seemed to slowly spread over his body as his movements became stiffer and stiffer with each passing moment.\n\nHe was muttering and crying to himself.\n\nHis own Midas touch was slowly killing him…\n\nQuicker than I even anticipated, by the time I picked myself up, he could barely beg for help.\n\nA dreadful look of fear in his desperate gaze penetrated straight through me. It’s been a while since something sent shivers down my spine, but in this state, this sick man definitely did.\n\nHe barely managed to lift one gold-plated arm in my direction when he saw me get up, and his cries for help slowly morphed into something far worse, and far less human.\n\nBreathless, suffocated, almost crushed\n\nA hiss.\n\nA death rattle escaping from a crack in a metallic statue when the wind blows through it.\n\nThat was the sound of a man screaming with no lungs.\n\nHis death was slower than it seemed. Even after falling silent, he must’ve had some time before the gold statue encasing his organs fully hardened, collapsing his lungs and heart in place.\n\nThe worst part of it all is that even after the gold covered his body completely, it must’ve been only skin deep, because I watched his eyes dart about, almost pleading, for another minute or two, before their gaze fell on me.\n\nDilating one last time, stuck in place\n\nYet somehow, following me across the room until I left."
  },
  {
    "id": "1qww187",
    "subreddit": "creepystories",
    "title": "By lunchtime, the most feared girls in school were afraid of her",
    "author": "Domaverse_Meadia",
    "score": 1,
    "url": "https://www.reddit.com/r/Creepystories/comments/1qww187/by_lunchtime_the_most_feared_girls_in_school_were/",
    "created_utc": 1770322085.0,
    "num_comments": 0,
    "word_count": 142,
    "body": "The wind cut sharp that morning, minus 13 degrees, the schoolyard frozen in silence. Frost clung to every brick, every railing, as if the whole place was holding its breath.\n\nThen a black car slid into the principal’s parking space, tires crunching over ice. Doors creaked open. Out stepped the new girl.\n\nPink heels.\n\nA pink jacket.\n\nA smile too calm for someone walking into Ashthorne High.\n\nThe Hell Belles spotted her first. Seven girls built on violence and reputation, hungry to make an example of her. They dragged her behind the school, certain they’d send her home crying.\n\nBut she didn’t cry. She didn’t even blink.\n\nShe smiled.\n\nBy the time it was over, the Hell Belles were no longer feared.\n\nThat fear belonged to her now.\n\nThe whispers started that same day, sharp and terrified:\n\nThe Devil in Pink Heels."
  },
  {
    "id": "1qozbhh",
    "subreddit": "creepystories",
    "title": "Demons may be attacking me!",
    "author": "Clean_Personality00",
    "score": 1,
    "url": "https://www.reddit.com/r/Creepystories/comments/1qozbhh/demons_may_be_attacking_me/",
    "created_utc": 1769568870.0,
    "num_comments": 2,
    "word_count": 660,
    "body": "I became a Jesus freak recently after life changing events. I am a strong believer and so new to it that when I had my first spiritual attack I honestly thought I was crazy….\n\nOne day I was hanging out with my best friend Annabelle. Due to some family and personal issues I do not want to give to many details but a fight with a close family friend broke out between me and said friend due to her verbally attacking Annabelle in her own home. I am someone who actually believes in respect regardless of feelings and things got out of hand but that night after everything died down I saw a black figure crouching in-front of me and when I blinked it disappeared.\n\nAn hour late I stepped out to have a smoke on the porch and I then saw a figure speed walk around the building. I didn’t think much of it at the time as I have gone through a lot of tough situations in the past 3 years from death, abuse, homelessness, pregnancy, ypu name it it happened. So I assumed stress was messing with me. Until I met with my therapist. \n\nMy therapist asked me about my spiritual journey and how I came to Jesus and what made me believe and keep my faith. After a 20 minute talk about that she implied that I may have seen a demon. Especially due to the way the “family friend” was acting during the altercation. I just soaked that in and listened for the rest of our appointment. \n\nWhen she left I assumed we were both just crazy haha. For about a week I was debating on if she was crazy but if I believed she was crazy I couldn’t truly believe in Jesus which I do! After that conversation small things started to disappear in my home. First it was a pair of shoes, then it was a pot, then it was a cleaning sponge. I looked everywhere and just assumed I misplaced it.\n\nI then went back to my best friend Annabelle’s house after a week just to have a girls night. We were both emotional and bored and it was the freakin weekend so we decided to drink. We were dancing and singing our little hearts away. The night was amazing. Then I passed out. \n\nI had a dream that the closest door opened and light was coming through but I couldn’t see or hear anybody. But then a love seat out of no where was pushed towards me at a rapid speed. I thought I woke up praying but I “woke up” still inside my dream. I didn’t realize so I went to go tell my friends about my dream. My best friends acted normal but the guy I’m “friends” with but kind of dating was acting really funny. I was trying to tell him what happened and how scared I was but he was pulling away from me like he hated me. And I chased him back into my room and then boom! I finally wake up and realize I never woke up the first time. I was so scared that I started praying. \n\nI realized that whatever demon I saw was pulling me towards a good time to open my mind and heart to corruption. That night or drinking may have seemed fun but it opened a portal for me to lose control… \n\nThat day I woke up later in the day I had a burning sensation on my arm and it turned red but I didn’t touch anything and I’m not allergic to anything. None of this made sense until I realized that the enemy can only hear what you say and not what your heart means. That conversation with my therapist may have rattled some chains because I’ve never experienced anything like that before explaining my faith and belief that deeply out loud.\n\nBe safe out here y’all."
  },
  {
    "id": "1qo4ecl",
    "subreddit": "creepystories",
    "title": "Creepy Doll",
    "author": "ConceptNo3529",
    "score": 1,
    "url": "https://www.reddit.com/r/Creepystories/comments/1qo4ecl/creepy_doll/",
    "created_utc": 1769489799.0,
    "num_comments": 0,
    "word_count": 114,
    "body": "So today my sister called me about this specific doll and this is what she told me about it. Her and my other sister got ready for school like normal after school one of my sisters was walking by my other sisters room and saw the doll just sitting in the windowsill. My other sister said she did not see this doll prior in the morning. Does anyone have any stories about this doll? We tried looking up this doll and its the : **2002 Jacqueline Kent Collection Fairy Godmother Hanging Doll Jeweled Opalescent** doll. Nobody in my family knows that doll we have asked everyone, and I never saw that doll growing up."
  },
  {
    "id": "1qx8jcv",
    "subreddit": "writersofhorror",
    "title": "Book Rec: Polaris by Ries Murphy",
    "author": "atl_not_atlanta",
    "score": 1,
    "url": "https://www.reddit.com/r/WritersOfHorror/comments/1qx8jcv/book_rec_polaris_by_ries_murphy/",
    "created_utc": 1770354109.0,
    "num_comments": 0,
    "word_count": 228,
    "body": "Hey everyone, my friend just published his first book, Polaris. Please consider checking it out if you’re into dark speculative fiction, psychological horror, thrillers. Including the blurb and link here for anyone interested.\n\n—-\n\nHalfway through his senior year at Crossing University, freshly-dumped Arthur Bland is out of love and out of options. Heartbroken and plagued by strange nightmares, everything changes for Arthur when he is selected to receive a DeepGlass Curio—an experimental brain implant from the most powerful company in the world.\n\nSoon after, Arthur is invited to work on the Polaris project—a secret city hidden in a digital alternate reality, built by a rogue team of developers using Curio technology. At first, everything seems to go well: Arthur is good at the work, his mind is finally off of his ex, and he is quickly swept into a so-called \"Starside\" courtship with a mysterious young woman named Rebecca.\n\nYet Arthur's best friend, Alena, begins to suspect that the Polaris project is not what it seems—and that Arthur's new girlfriend may not be who she claims.\n\nAfter a gruesome incident connected to the project shocks the school, Arthur and Alena find themselves in a race against time with deadly consequences. To survive, they must unravel the riddle of Polaris before it’s too late—and the city's dark secret changes reality as they know it forever.\n\n—-\n\nPolaris (Oneiromancer)"
  },
  {
    "id": "1qsrbxq",
    "subreddit": "writersofhorror",
    "title": "Quick question for all my horror homies",
    "author": "Pristine-Sundae-1481",
    "score": 1,
    "url": "https://www.reddit.com/r/WritersOfHorror/comments/1qsrbxq/quick_question_for_all_my_horror_homies/",
    "created_utc": 1769928883.0,
    "num_comments": 0,
    "word_count": 71,
    "body": "# Writers of Reddit: Can I get your help testing a new feedback tool?\n\nCalling writers who are curious about how readers interpret their work. I’m helping test a new platform concept that generates structured feedback and discussion guides based on reader responses. \nWe’re running a small validation study and would love a few writers’ perspectives. If you’re interested in participating, go to ** and sign up for the validation test."
  },
  {
    "id": "1qp56sl",
    "subreddit": "writersofhorror",
    "title": "Letter Again Dear Diary",
    "author": "Financial_Income_363",
    "score": 1,
    "url": "https://www.reddit.com/r/WritersOfHorror/comments/1qp56sl/letter_again_dear_diary/",
    "created_utc": 1769586742.0,
    "num_comments": 0,
    "word_count": 134,
    "body": "Wednesday January 28th, 2026 \n28 years old \nDear You. \n\n\n\tA rendition of repeats from fragments of your true peace have became the highlight of multiple guided sources and/or souls that captured vision by sights of incriminated speech therapy. Ongoings of traceback triggers, entitled to stretched meanings by captured visions whom fought mind pleasures in the life of not there own. How ones opposition becomes land of the free in property, tending to its grace only to fill someone else amusement. And so set forth action behind grit, opposition took imbalance justice and ran with scorned insults. Implied loony tuned reasoning to set the atmosphere of wit and abuse. \n\n\n\t\t\t\t\t\t\t\tYours Truly, \n \t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tOpposition\n\n\t\tP.S. the introduction in letter form of the repeat offensive of highlighted descriptive absences of meaning made to tell a tell for possession."
  },
  {
    "id": "1qmn3fj",
    "subreddit": "writersofhorror",
    "title": "Does anyone else avoid writing anything even mildly disturbing because they’re afraid of taking it too far?",
    "author": "knittedscarfs",
    "score": 1,
    "url": "https://www.reddit.com/r/WritersOfHorror/comments/1qmn3fj/does_anyone_else_avoid_writing_anything_even/",
    "created_utc": 1769357193.0,
    "num_comments": 4,
    "word_count": 80,
    "body": "I’ve been debating whether I should post this on the Writing subreddit or whether it belongs on TrueOffMyChest.\n\nI’ll try to be straight forward.\n\nI’m afraid of writing pretty much anything even mildly disturbing. Anything beyond what already frightens me, because I know how far I can push it.\n\nAsking out of pure curiosity, does anybody else relate to this?\n\nIf so, do you take a step back, or do you challenge yourself and follow your imagination wherever it leads?"
  }
]