[
  {
    "id": "1qs7t5r",
    "title": "The most important rule at my job is to never create a physical record. I found what the last person in my position wrote, and I think I'm in danger.",
    "author": "gamalfrank",
    "score": 2833,
    "url": "https://www.reddit.com/r/nosleep/comments/1qs7t5r/the_most_important_rule_at_my_job_is_to_never/",
    "created_utc": 1769879078.0,
    "num_comments": 80,
    "word_count": 3542,
    "body": "It started six months ago. I was fresh out of grad school with a Master’s in History, a mountain of debt that gave me nightly anxiety attacks, and a resume that was getting ignored by every museum and university in a three-state radius. I was applying for everything: retail, data entry, barista. I was about two weeks from having to crawl back to my parents’ spare room when I saw the ad. It was discreet, posted on a high-end academic job board I’d forgotten I even had an account for.\n\n“Archival Associate. The Foundation. Discretion, precision, and an exceptional capacity for recall are paramount. No formal experience required. Generous compensation.”\n\n“Generous” was an understatement. The salary they listed was more than my parents make combined. I figured it was a typo, or a scam. But I was desperate, so I polished my CV and sent it in, not expecting to hear back.\n\nThey called me the next day. The woman on the phone had a smooth voice but with a weight to it. She didn’t ask about my experience or my degree. She asked me a series of bizarre questions. “When you were ten, what was the pattern on the wallpaper in your grandmother’s kitchen?” “Describe the cover of the third book you see when you picture your childhood bookshelf.” “What was the name of the street sign you passed just before turning onto your current road this morning?”\n\nLuckily for me, my brain is just… sticky. Details cling to it, and I know for a fact that it’s a photographic, sensory thing. I can close my eyes and walk through my grandmother’s house, feel the cool linoleum under my feet, smell the potpourri she kept in a bowl on the sideboard. I answered her questions, and she said, “Please be at this address tomorrow at 9 AM sharp. Dress for an interview.”\n\nThe address was a downtown monolith. A skyscraper with no name on the facade, just an elaborate, interlocking symbol above the heavy bronze doors that looked like a stylized knot. The lobby was a cavern of marble and silence. The air was cool and still, like a cathedral. A man in a simple, perfectly tailored grey suit met me and led me to an elevator, then up to a floor that had no button. He used a key.\n\nThe interview was with a man I now know only as the Supervisor. He was ageless, with pale eyes that seemed to look right through me. He explained the job. It was simple, he said. Deceptively so. Each day, I would be given a single photograph. My task was to study that photograph from 9 AM to 5 PM. I was to absorb it. To commit every single detail to memory. The play of light, the grain of the image, the expressions on the faces, the stitching on a coat, the cracks in a sidewalk, the reflection in a window.\n\n“You will become the living record,” he said, his voice a low hum. “You will not write anything down. You will not make any copies. You will not discuss your work with anyone. At five o’clock, I will collect the photograph, and you will watch me incinerate it. The Foundation’s motto is ‘Quaedam optime memorandum.’ Some things are best remembered.”\n\nIt was the strangest job I’d ever heard of. But the debt was on my chest, and the number on the contract he slid across the mahogany desk could change my entire life. I signed.\n\nMy workspace was in a vast, circular room that felt like a panopticon. Dozens of identical wooden carrels were arranged in concentric rings, all facing a central pillar. Each carrel was a small, three-sided booth with a comfortable chair, a desk, and a single lamp. There were maybe thirty other people in the room, but the only sound was the soft rustle of clothing and the low, ever-present hum of the building’s climate control. No one spoke. No one even looked at each other. They were all just like me: head down, focused with an intensity that was almost unnerving. They had the same look I saw in the mirror every morning: a mixture of intelligence and quiet desperation.\n\nThe first photograph was of a dusty, empty ballroom. Ornate, peeling plasterwork on the ceiling. A single chandelier, draped in cobwebs. Sunlight streamed through a grimy arched window, illuminating a universe of dancing dust motes. That was it. For eight hours, I just… looked. I memorized the way the shadows fell, the specific pattern of the water stains on the far wall, the number of crystal pendants missing from the chandelier (seventeen). At 5 PM, the Supervisor came, took the photo with a pair of tongs, and I followed him to a small, soundproofed room containing a sleek, modern furnace. He unlocked it, slid the photo inside, and pressed a button. A soft whir, a flash of orange light, and it was gone. He nodded at me, and I went home.\n\nThe days fell into a rhythm. A new photo every morning. A wedding party from the 1920s, the bride’s smile just a little too tight. A grimy factory floor, men in flat caps staring grimly at a piece of machinery. A desolate stretch of highway at dusk, a single abandoned car with its door hanging open. A crowded market in a city I couldn’t place, faces blurred with motion except for one small child staring directly at the camera, their expression utterly blank. They were all unlabeled. No dates, no locations, no context. Just moments, frozen and silent.\n\nMy colleagues remained phantoms. We’d nod sometimes, in the elevator or the sterile break room where we’d microwave our sad, solitary lunches. But we never spoke. It was a rule, and a powerful one. It was as if we were all part of some silent monastic order. I saw a woman who couldn't have been older than me, but her eyes had the haunted, distant look of a war veteran. An older man always rubbed his left temple, a constant, rhythmic motion, as he stared at his photos. We were all islands.\n\nThe dreams started about a month in.\n\nAt first, they were just echoes. I’d dream I was standing in the dusty ballroom, and I could smell the decay and the dry rot. I’d hear the faint, ghostly echo of a waltz. I woke up feeling unsettled but dismissed it. My job was to stare at images all day; of course they’d creep into my subconscious.\n\nBut they got stronger. After a week spent memorizing a photo of a grim-faced family on a sagging porch in what looked like the Dust Bowl, I had a dream where I *was* the father. I could feel the rough, splintered wood of the porch railing under my hand, the grit of dust between my teeth, the gnawing, hopeless hunger in my stomach. I felt a desperate, protective love for the woman and children beside me, a love so fierce and painful it made my chest ache when I woke up.\n\nThe day I studied a photo of a collapsed mine entrance, I spent the night dreaming of darkness. The oppressive weight of the earth above me, the taste of coal dust, the chilling, subterranean cold that seeps into your bones. I heard the shouts of other men, muffled and terrified, and the groan of shifting rock. I woke up gasping for air, my pajamas soaked in sweat, my throat raw from screams that had been trapped in my sleeping mind.\n\nThis became the new normal. Every night, I was a tourist in someone else’s tragedy. I was a soldier in a trench, the mud sucking at my boots, the smell of cordite and fear thick in the air. I was a lone woman in a lighthouse, the storm winds howling around me like a hungry beast, the waves crashing against the stone with the force of cannonballs. I was a witness to car accidents, fires, arguments steeped in a quiet, venomous rage. I was living a hundred different lives, and none of them were my own.\n\nMy own life began to feel thin and unreal. I’d be walking to the grocery store and the texture of the modern pavement would feel strange, alien. The bright colors of the cereal aisle seemed garish and loud compared to the sepia and black-and-white worlds I inhabited every night. My own memories started to get… fuzzy. I had to really concentrate to remember my college roommate’s name, but I could tell you the exact pattern of the rust stains on the hull of a shipwreck I’d studied for eight hours three weeks prior.\n\nThe first major crack appeared on a Tuesday. I had spent the day with a particularly haunting photograph. It was a street corner, sometime in the late 70s judging by the cars and clothes. A crowd was gathered, looking at something just out of frame. Their faces were a mixture of shock and morbid curiosity. But my focus, for eight hours, had been on one man at the edge of the crowd. He was younger, maybe in his early twenties, with a thick mustache and a denim jacket. He wasn't looking at whatever the main event was. He was looking away, his face pale, his eyes wide with a specific, personal terror. He was the only one who looked truly afraid.\n\nThat evening, on my way home, I saw him.\n\nI was waiting to cross the street, and he was on the other side. Older, of course. His mustache was grey, his face lined with the intervening forty-odd years. But it was him. The same wide-set eyes, the same shape of the jaw. The denim jacket was gone, replaced by a rumpled tweed coat, but it was unmistakably the man from the photograph.\n\nI froze. My heart slammed against my ribs. It had to be a coincidence. A trick of the light, my over-stimulated brain making connections that weren't there. But then he turned his head, and his eyes met mine across the four lanes of traffic.\n\nRecognition dawned on his face. And then, horror. The exact same expression from the photograph. A raw, gut-wrenching terror that seemed to suck all the air out of the space between us. He looked at me as if I were a ghost. As if I were the very thing he’d been running from on that street corner all those years ago. He stumbled backward, turned, and practically ran, disappearing into the evening crowd.\n\nI stood there for a long time, the traffic lights cycling from red to green to red again, the world moving on around me while my own had just ground to a sickening halt.\n\nThat was when the paranoia began in earnest. The silence of the archive, once peaceful, now felt predatory. The hyper-focus of my colleagues no longer seemed like professional dedication; it looked like a desperate attempt to keep something at bay. I started watching them more closely. The man who rubbed his temple: his hand would sometimes twitch, his fingers splaying as if trying to ward something off. The young woman’s haunted eyes would occasionally flick towards an empty space in her carrel, her breath catching for a second before she forced her gaze back to the photo.\n\nI had to know what was going on. I broke the cardinal rule.\n\nI waited for the temple-rubbing man in the break room. He was nuking a container of what looked like plain rice. I walked up to him, my heart thudding. “Excuse me,” I said, my voice sounding rusty and loud in the quiet room.\n\nHe flinched. He didn't just turn; he physically recoiled, his back hitting the counter. He looked at me with wide, panicked eyes, shaking his head frantically. He grabbed his rice, the microwave beeping insistently, and almost ran from the room, never once making eye contact. He didn’t say a single word.\n\nThe message was clear. We don’t talk. We can’t talk. Maybe we’re not *allowed* to talk, or maybe we’re just too afraid of what might happen if we do.\n\nThen people started to disappear. One Monday, the carrel to my left was empty. The man who sat there, a quiet fellow with thinning hair, was just… gone. No one mentioned it. His desk was cleared out, as if he’d never existed. Two weeks later, the woman with the haunted eyes was gone too. Her carrel also wiped clean. There was no internal memo, no farewell card, just a silent, growing void in our ranks. Were they fired? Did they quit? Or was it something else? \n\nI was spiraling. My apartment no longer felt like my own. I’d catch a flicker of movement in my peripheral vision and turn to see a shadow that looked like a soldier in a trench coat. The scent of ozone and rain would fill my living room on a clear night, a phantom echo from a photo of a lightning-struck tree.\n\nThe breakthrough, if you can call it that, came last week. I sat down at my desk and my hand brushed against something taped to the underside. It was a small, folded piece of paper. My blood ran cold. It felt deliberate, clandestine. I waited until my hands stopped shaking, then slipped it into my pocket. I spent the day in a fugue state, staring at a photo of a single, withered black rose lying on a cobblestone street, my mind entirely on the note in my pocket.\n\nThat night, in the privacy of my apartment, I unfolded it. It wasn't a note, not in the traditional sense. It was just a string of alphanumeric characters: `A7B3-C9D1-E4F8`.\n\nI had no idea what it meant. A code? A web address? Then I remembered. Every archivist had a small, personal safe in the locker room, for valuables. We set our own combinations. But this didn't look like a combination. It looked like a serial number. Or a key.\n\nThe next day, I watched the woman with the haunted eyes’ carrel. It was still empty. I took a chance. After everyone had left, my heart pounding so hard I could hear it in my ears, I went to the locker room. I found her locker. Next to the combination dial was a small, almost invisible keyhole. It was an override. This had to be it. I looked for a key, but then it clicked. The sequence was a password for the digital lock on her safe. I typed in the sequence. There was a soft beep, and a heavy click.\n\nThe safe was full with paper. Scraps, notebooks, loose-leaf sheets filled with a frantic, spidery handwriting. It was forbidden knowledge. The one thing we were never, ever supposed to do. She had been writing it all down.\n\nI took it all, stuffed it in my bag, and ran.\n\nI’ve spent the last three days poring over her notes. It’s not a single, coherent narrative. It’s the fragmented, desperate research of a brilliant, terrified mind. There are clippings from obscure historical journals, printouts from physics forums, and pages and pages of her own synthesis.\n\nAnd I finally understand.\n\nAccording to her notes, certain moments in time, certain places, are so saturated with trauma, or violence, or some powerful, paradoxical emotion, that they create a kind of… scar on reality. A resonance. She used a lot of terms I barely understood: quantum entanglement, temporal feedback loops, mnemonic resonance. But the term she kept circling, the one she’d scrawled over and over in the margins, was *genius loci*. Spirit of place. But she’d added her own qualifier: *Genius Loci Malignum*.\n\nThese aren’t just memories of bad events. They are the events themselves, still echoing. They are moments that have become sentient, predatory. A murder that was so brutal it imprinted itself on the room, and now the room itself lashes out at anyone who enters. A paradox, like a man who appears in a photograph of his own grandfather’s unit years before he was born, creating a loop that attracts… things. Unwanted attention from outside. These are glitches in the fabric of the universe. Hauntings of a moment, of a place, of an idea.\n\nThe Foundation’s job is to find these glitches. They capture them. And the way they capture a rogue moment, a sentient memory, is to take a photograph. The photograph acts as a physical anchor, a key. But it's unstable. The note explained the process.\n\nStep 1: The photograph isolates the entity. It traps the *genius loci* in a single, static image.\nStep 2: The Archivist, through intense, prolonged focus, transfers the anchor from the photograph into their own consciousness. Our photographic memories, our ability to absorb every single detail; it's a prerequisite for the cage to work. We memorize the image so completely that our mind becomes the new vessel.\nStep 3: The photograph is incinerated. This destroys the original physical anchor, leaving the entity trapped entirely within the mind of the archivist. It has nowhere else to go.\n\nWe are prisons. Human prisons for things that should not exist.\n\nThe motto, \"Some things are best remembered,\" is a cruel, literal joke. They are remembered by us, and only us, so that the rest of the world can forget. So that these malevolent echoes can't bleed out and harm anyone else. The few suffer for the many.\n\nThe woman’s journal entries chronicled her decline.\n\n*“October 12th: Archived the boardwalk collapse. I can still hear the screams when it’s quiet. Sometimes I smell the salt water and the fried dough.”*\n\n*“November 4th: Saw the arsonist from the warehouse fire photo on the subway today. He looked right at me and smiled. It wasn’t a human smile.”*\n\n*“December 19th: My sister came to visit. For a second, her face wasn’t her face. It was the face of the porcelain doll from that abandoned nursery photo. I screamed. She thinks I’m having a breakdown.”*\n\n*“January 8th: I have archived 112 anomalies. There isn’t much room left for me in here. I can’t remember what I had for breakfast, but I know the exact number of buttons on the coat of a man who vanished from a ship in 1924.”*\n\nHer last entry was short.\n\n*“They’re getting out. They’re leaking. The cage is full.”*\n\nI’ve archived almost two hundred of them now. Two hundred of these… things. And the cage is full. My cage is full. My reality is fraying at the seams. Last night, I was making tea, and for a full minute, my kitchen wasn’t my kitchen. It was a cold, tiled morgue from a photo I’d studied months ago. The man from the 70s street corner: I see him everywhere now, in crowds, his face always twisted in that same silent scream, always looking right at me. The walls of my apartment sometimes ripple and show me the peeling wallpaper of a Victorian seance room. The static on the radio whispers words in a language I don’t know but understand with a cold dread.\n\nI think now that I am a walking, talking containment unit that has breached. And the entities I hold are starting to leak into the world around me. The other day, my landlord knocked on my door to ask about a water leak, and he flinched when he saw me. He said, \"Sorry, for a second there… you looked like someone else. A lot of someone elses.\" He left without another word, his face pale.\n\nI found myself in my bathroom two nights ago, holding a bottle of pills. It felt like the most logical, rational thought I'd had in months. If I end it, they end with me. The memories, the things wearing the skins of memories, they all get erased. It would be a release. For me, and for the world.\n\nBut as I was about to do it, the Supervisor's voice echoed in my head. \"You will become the living record.\" And I realized, with a sudden, freezing certainty, that this is what they want. This is the end of the job cycle. It’s the Foundation's retirement plan. They hire us, they fill us up with these horrors until we break, and then we \"retire\" ourselves. It’s clean, efficient, and it completes the final incineration.\n\nSo now I’m trapped.\n\nI can’t go on like this. I’m losing myself. My own memories feel like old, faded photographs compared to the vivid, high-definition nightmares I’m forced to carry. But I can’t kill myself, because that’s playing their game. That’s letting them win. That’s doing their dirty work for them. Is there another way? Can you fight a memory? Can you exorcise an event?\n\nI’m sitting in my apartment right now. The lights are flickering. In the reflection of the dark screen, my face is a flickering montage of a hundred others. A soldier, a bride, a factory worker, a terrified man on a street corner. The hum of the building sounds like a waltz, then like the roar of a fire, then like the howl of a storm at sea.\n\nThey are all in here. And they want to get out.\n\nWhat do I do?"
  },
  {
    "id": "1ql71kv",
    "title": "She thinks she's people",
    "author": "Saturdead",
    "score": 2522,
    "url": "https://www.reddit.com/r/nosleep/comments/1ql71kv/she_thinks_shes_people/",
    "created_utc": 1769212119.0,
    "num_comments": 44,
    "word_count": 5343,
    "body": "Back in the summer of 2008, my buddy Jackson and I were ten years old. While our parents worried about a looming recession, we were keeping busy with the hype of the new Batman movie. We were a couple of weeks away from another school year, and we were making the best of it.\n\nWe spent most of our days outdoors. It felt better than sitting inside and enduring the endless drone of political debates or hearing our parents moan about making ends meet. Jackson and I both had a Nintendo DS, and we played them religiously. You could find us tucked away in every corner of downtown Hilltop, trading Pokémon and turning in nickel cans for cheap gas station snacks. I think I learned the importance of washing my hands *solely* from trying to play games with sticky slushy fingers.\n\nIt was a good time. Sometimes we’d head down the river to scare the Girl Scouts before they got to their campground. We’d hide in the bushes and pretend to be wild animals.\n\n \n\nWe were coming back from a visit to the campground. There were no scouts there, so we just wandered around and checked out the equipment they left behind. We’d already checked the tool shed, but there wasn’t anything fun to mess with. Instead we marveled over a hairpin that we found. This small pink plastic thing with a blue sunflower on it.\n\n“I bet this is Melodie’s,” Jackson mumbled. “I think there’s a blonde hair on it.”\n\n“Nah, her hair’s too short. It’s probably Lynn’s.”\n\n“No, Lynn’s is curled. This one’s straight.”\n\n“Wanna bet?”\n\nHe thought about it and offered me a hand.\n\n“If it’s Melodie’s, you can’t use your Luxray anymore. If it’s Lynns’, I can’t use my Garchomp.”\n\n“Deal.”\n\nWe shook on it. We’d probably forget all about it in a couple of days, but it gave us something to do. And besides, that Garchomp had been kicking my ass all summer long.\n\n \n\nWe followed the river, making our way back to town. We were about halfway there when we heard something up ahead. There was this bright yipping noise, like puppies. Looking down the river, we could spot what looked like six coyotes crossing the stream up ahead. One larger, five small.\n\nThe larger one was pacing nervously, stepping back and forth, crying and howling at one of the smaller ones. They had all crossed the river, except for one. One of them sat on a stone, staring straight ahead. It wasn’t nervous, or crying, or anything. It just… sat there. Jackson pointed at them and held his finger up, asking me to be quiet. I nodded. We stepped a little closer, and despite our best intentions, we spooked them. The larger coyote sped off with all the little ones bouncing after it into the underbrush. But one of them was left behind, and it didn’t seem to care.\n\n“You think it’s sick?” I whispered.\n\n“Maybe it’s dead. It’s not moving.”\n\n“No, look. It’s blinking.”\n\nIt *was* blinking. It sat there, looking straight ahead. It almost looked sleepy, like it didn’t have a care in the world. We waited for a couple of minutes to see if the mother would come back, but she never did.\n\n \n\nI was curious. We got close enough that we could poke it with a stick, if we wanted to. But we didn’t. It was a coyote pup, looking right at us, and it wasn’t moving. It looked fine though. Bright eyes, steady breathing, healthy fur. It locked its yellow eyes on me, like it was trying to make sense of what kind of strange dog I was supposed to be.\n\nThen, it stood up. It balanced on its hind legs.\n\n“Jesus, that’s cute.” Jackson beamed.\n\n“Why’s it standing up?”\n\n“Who cares? It’s cute!”\n\n“But they don’t do that. They don’t stand up.”\n\nJackson nodded, but couldn’t stop smiling.\n\n“Maybe she thinks she’s people.”\n\nHe took the pink hairpin with the blue sunflower and removed his shoes. Step by step, he made his way into the river. He carefully reached out and attached the hairpin to the coyote’s perked ear.\n\n“Look,” Jackson smiled. “She’s the prettiest girl in the world.”\n\nThat made the coyote react. She panted eagerly and dropped down on all fours, spinning in a circle and making little noises at us.\n\n \n\nWe spent all day with that pup. At first we were looking for her mother, but we realized she wasn’t coming back. That, and this little thing was following us around. We got her some snacks, talked to her, tried to make her do tricks, all of it. Neither me nor Jackson had any pets of our own, so this was like finding a free dog. We both knew there’d be no way we could bring it home. Not only was it not a dog, but our parents were in a bad spot. I didn’t know it at the time, but my mom had lost her job, and they were contemplating a move. Jackson’s parents were trying to figure out how to keep their hardware store open. You couldn’t bring a dog into that kind of environment.\n\nWe settled for the next best thing. We took all the snacks we’d saved up and gave her all of it. We thought about getting her some dog food, but she really seemed to enjoy people food. She followed us around all day, sometimes getting up on her hind legs, as if trying to copy us. It was so funny watching her trying to balance and watching that little tail bob as she tripped on her feet. Sometimes as we walked, we could hear a little yip as she stumbled over something. Jackson decided to make it easy for her and carry her around – she seemed to like that. She was small enough to sleep in the pouch of his hoodie.\n\nWe found a spot for her behind a dumpster outside the abandoned sporting goods store. We stuffed Jackson’s hoodie in my backpack, making a little nest. Before we left for the day, I bent down and whispered.\n\n“We’ll be back first thing in the morning, alright?”\n\nThe coyote yelped at me and tilted its head.\n\n“I know, but we’ll be right back.”\n\nIt yelped again. I paused, looking into those yellow eyes. The coyote did nothing. I looked a little closer, speaking in a lower voice.\n\n“Do you understand me?”\n\nThe coyote tilted its head. It didn’t respond but bobbed its head and wagged its tail. Whether it understood me or not, it was clear this thing enjoyed our company. Jackson said his goodbyes and scratched her behind the ear.\n\n“Who’s the prettiest girl?” he cooed. “You are! Yes, you are!”\n\nThe coyote almost danced around the backpack as it jumped and rolled, making little puppy noises.\n\n \n\nFor the next few days, that coyote pup was our world. We took her everywhere, and we didn’t need a leash or anything. She would follow us around, shared our snacks, and cuddled up next to us as we played our games and talked the summer day away. Jackson wanted to call her Megan, as in Megan Fox, but I vetoed it. We ended up calling her Jessica. I had a bit of a crush on Jessica Biel back then, so if our pup was to be named after the prettiest girl I knew, well… that was it. It worked for Jackson, too. He had a thing for Jessica Alba. So, Jessica it was. Little Jessie Pup.\n\nWe forgot all about the hairpin and our bet, but Jessie Pup still had it bobbing from her ear. She didn’t make the slightest attempt to remove it. She really was a little lady. She would bite down her nails until they were neat and tidy, and she would get all bitter and gloomy whenever you ruffled her fur the wrong way. She was a Primadonna, and we spoiled her plenty.\n\nThey say dogs and coyotes are cleverer than we give them credit for, so I didn’t know what to think of her. Jessie did a lot of things I didn’t expect an animal to be able to do. She picked up tricks almost immediately, like spin, or sit. It’s like she understood the *word* rather than the action itself. We even tried to teach her to speak.\n\n \n\nJackson was leaning against a chain-linked fence, dangling a piece of beef jerky at her.\n\n“Go on!” he said. “Speak!”\n\nJessie got up on her hind legs and looked up at the jerky. She was salivating and showing all her teeth – something she did whenever she saw a tasty treat. Then she turned her attention straight forward, to Jackson. Her tongue retracted into her mouth as her paws lowered. Her legs didn’t shake anymore when she stood up. She was getting good at it. *Really* good.\n\nWhen she finally made a noise, it was less of a bark, and more like a hacking cough. At first I thought she was choking on something, but Jackson was still holding the treat. Instead she repeated the sound a couple of times until it started to sound less like a cough, and more like a groan.\n\n“You hear that?” Jackson said.\n\n“She’s just coughing.”\n\n“No, no. Listen.”\n\nI leaned down to get on her eye level. Jessie Pup turned to me, her body never once wobbling despite balancing on her hind legs. She stared at me with those big, yellow eyes.\n\n“Go on, Jessie,” I said. “Speak.”\n\nShe opened her mouth and turned a little, as if to align her throat at the right angle. Then she let out a breath in a huff, like she was clearing her throat.\n\nAnd I swear to God, it sounded like ‘hello’.\n\n \n\nJackson was ecstatic about this development. He would try to get her to say all kinds of things, like our names, or our town, or the name of the streets. Half of the time, she could do it pretty well. You could kind of hear what she was saying if you really listened for it, but to a random bystander it would have just sounded like phlegm and groaning. But to two 10-year-olds, it was magical. Jessie the magic pup.\n\nWe got her a better place to sleep. We propped up a big old gym bag and remade a hub cap into a water dish. We made sure she was comfortable, and Jackson stole a decorative pillow from the couch in his living room. It was hard and embroidered, but Jessie loved it. She was always at her best whenever we treated her like one in the gang, rather than a pet.\n\nBut nothing made her happier than having Jackson call her the prettiest girl in the world.\n\nThat was, by far, her favorite thing.\n\n \n\nWe noticed over the coming days that Jessie was getting a bit too adventurous. She would stray from her nest and almost walk into traffic, so we had to do something to keep her safe. She was growing fast, and with her new gym bag nest we could move her around whenever there was too much noise or traffic. We ended up going back to the Girl Scout camp, as they had packed up for the summer. There was that tool shed with a broken wood panel that you could crawl under, so we could make it like Jessie’s own little house.\n\nWe would sneak out leftovers from our houses. Jackson did this thing where he would say I loved his mom’s cooking so much that he’d like to bring me some. It always worked. I would say the same to my mom. We did this every now and then so we could bring Jessie an extra portion. Jessie did this thing where she would slap her paw straight into the food and scoop it up; like she was trying to use her paws to eat. She seemed frustrated when they didn’t bend the way our hands did. She would yip and yelp until Jackson spoon-fed her. She loved that.\n\nBut I think Jackson was a bit too close to her to realize something wasn’t right. He didn’t see the way she looked at him when his back was turned. He didn’t see the confidence she had when she stood up straight on her hind legs, or when she combed back the fur on her head. It stopped looking like a trick, and it started to look surprisingly natural. Less like a coyote, and more like a little person in a very strange costume.\n\n \n\nOne day when we came to see her, Jessie was sick. Her fur was matted and coming off in fistfuls. She kept sleeping, and her tongue was hanging out of the side of her mouth. Jackson was beside himself, holding her close and stroking her ears. She would wake up in short bursts, poking her cold nose into the cavity behind his ear. He would sit out there with her all day, just to make sure she was getting better.\n\nI wasn’t so sure she was. I loved that pup, but there was something strange about it from the very beginning. Maybe it had been sick all along. There must have been a reason it was left behind. While I wandered off to get some snacks, I decided to stop by the river where we’d found her. That one spot along the river is a bit eerie. It’s the one place where the birds are silent, and the dragonflies stay away. You can see ants walking in circles. If you look into the water, you can see river stones aligned in repeated patterns. Something had happened there, but there was nothing that really stood not. There was nothing sick, dead, or rotting. I didn’t know what to make of it. Not a clue. Not a single one.\n\nBut no matter how much snacks we gave that pup, or how much we comforted her, Jessie just didn’t get better. She developed this swelling on her stomach, and soon enough, most of her fur along the tail was gone. And one day when we went to see her, she was gone.\n\n \n\nWe couldn’t find her. We tried to move on, but Jackson was taking it hard. He really, really wanted a dog. He’d wanted one for years. If it hadn’t been for his sister being allergic, he probably would’ve had one by then. We tried making the best out of summer without her.\n\nAfter about a week, there was this one morning when my mom called me over. She used my full name, so I knew it was something serious. I’d just got out of the shower when I found her in my room, sitting on the edge of my bed. She had this stern look on her face, like she was already scolding me without saying a word.\n\n“Would you mind telling me what you’ve been doing?” she asked.\n\n“What do you mean?”\n\n“I mean this mess,” she said, tapping the bed. “Don’t tell me you don’t know.”\n\n“I’ll make my bed, sheesh.”\n\n“No, no. Don’t do that. Don’t dismiss this.”\n\nShe wagged her finger at me, sighed, and pointed a flashlight under my bed. My heart skipped a beat.\n\n \n\nThe underside of my bed was covered in empty snack bags, crumbs, and fur. Lots, and lots, of fur. Handfuls of it. And at the very end of it I could see my crumbled-up backpack; the one we’d used as Jessie’s first nest.\n\n“Did you bring roadkill into this house?” mom asked. “What is this? How did you even-“\n\n“That’s not… I didn’t do that, mom. That’s not mine.”\n\n“Oh, I’m sorry,” my mom shrugged. “I forgot that this isn’t *your* *room*, and that this isn’t *your* *space* to care for. I’m so sorry, I forgot that you just drop by here sometimes.”\n\nShe rolled her eyes and handed me the flashlight.\n\n“I want it cleaned before you leave, and I need an explanation.”\n\n \n\nI did my best to clean it up. Some of the fur got stuck in the carpet, as if something heavy had slept on it. Jessie had been missing for days. Had she been staying there, in my room, all along? How the hell did she get in without anyone noticing? We didn’t have a doggie door or anything like that. And more than that, where was she now?\n\nI went through my entire room. My mom mistook it for thorough cleaning, but I was looking for clues. There were paw prints in my closet. Dirt on the edges of my bedroom door. I could tell something had been in there, but I couldn’t tell what it’d been doing. It had to have been Jessie. It just had to. But how?\n\nBy the time I was done cleaning, it was the middle of the afternoon. My mom gave me a break and let me run out to play with Jackson. I ran to his house as fast as I could, bringing the backpack along. Before I even got to his house, I saw him coming down the other street, running to meet me half-way. We hadn’t planned this. It just happened. He noticed my backpack, but I stopped him before he could ask.\n\n“She’s been in my room,” I said. “There’s fur under the bed.”\n\n“I know,” he nodded. “I saw her last night.”\n\nHe looked a little pale, maybe from the running. He stroked his arm and kept looking around, like he was expecting to see something.\n\n“She looked real sick,” he mumbled. “Really, really sick.”\n\n“Like, what kind of sick?”\n\nHe shook his head and looked down, lowering his voice.\n\n“She didn’t have any fur left,” he mumbled. “And her face was all… weird.”\n\n“Weird how?”\n\nHe didn’t answer. He just kept his eyes on the ground and tucked his arms tighter.\n\n“Weird how, Jackson?” I repeated.\n\nBut I couldn’t get a straight answer.\n\n \n\nWe decided we needed help. Hilltop is on the east side of the river, so there’s plenty of ranchers around. Since there are ranchers, there are veterinarians. There was this one veterinarian named Mario who worked downtown. He mostly worked cattle and the occasional sheepdog, but he was good people. He had two kids of his own, and he always showed up for career day.\n\nWhen we got to Mario’s office, he could tell something was off. All year round he was used to seeing middle-aged ranchers with baseball caps stumble in to complain about a cow, but now there were two quiet boys standing outside his reception. No wonder he came to see us right away.\n\nJackson broke down in tears when he tried to explain, so I tried my best to give Mario the full story. I told him about how we’d found a coyote pup, and how we’d cared for it when its mother abandoned it. Jackson interrupted me.\n\n“It’s not just a pup!” he cried. “Her name’s *Jessie!*”\n\nI corrected myself as Mario sat him down. I explained how Jessie was smart and funny and cute, and how we’d given her snacks and somewhere to sleep. But when I started telling him about her getting sick, I could see something changed in his demeanor. Back then I thought he was just worried about our coyote pup, but looking back at it, he must have thought she was carrying something bad. Something like mange, or rabies.\n\n“So she lost all her fur,” Mario said. “She lost her fur, and she’s somewhere around your house.”\n\n“That, or in her shed,” Jackson sniffled. “We made her a nest by the campgrounds.”\n\n“And you think she’s there now?”\n\n“There, or at Jackson’s place,” I said. “He saw her there last night.”\n\nMario turned to Jackson, giving him a comforting pat on the shoulder.\n\n“Are you sure it was her?” he asked. “There’s lots of coyotes around here.”\n\n“I’m sure,” Jackson mumbled. “I recognized her voice.”\n\nMario didn’t understand what he was saying, but I could tell he was unnerved. He was about to say something but couldn’t get the words right. Instead, he excused himself and hurried to his phone.\n\n“I’m gonna need a little help,” Mario admitted. “This is not really my wheelhouse.”\n\n \n\nWhile Jackson and I wanted some medicine to help our friend, Mario had something different in mind. To him, it sounded like a sick animal was developing an unhealthy obsession with two local kids. Yes, we had good intentions, but he was scared for our safety. We asked what kind of medicine he could get her, but he didn’t answer. Instead, he called in a couple of favors from some of the locals. He called our parents too.\n\nMy mom and Jackson’s mom got there at the same time. By the time they arrived, I could see three trucks pulling up in the parking lot. Two of the men had hunting rifles. Jackson was beside himself, trying to make them listen. I didn’t know what to think. I couldn’t get what Jackson had said out of my mind.\n\nWhat had her face looked like? What happened?\n\n \n\nWe were stuck in that office for a couple of hours. Jackson’s mom had to run off to help out with their store, but my mom had nowhere to be. We sat around watching an old TV in the reception as Mario went with the hunting crew. We stayed there for well over two hours until my mom got a call as well. She had to go see a banker about something, and my dad was waiting for her signature. She had no choice but to drop us off at our house and have us promise not to leave.\n\n“Straight to your room, lock the door, open for no one,” she said. “Either of you leave that room and I’m cramming your video games down the garbage disposal.”\n\nThere was no point in arguing. I kept my mouth shut as Jackson and I were ushered back to my place and herded into my room. My mom closed the door and rushed off with her phone glued to her ear.\n\nAlone, we just sat there for a while. This was no one’s fault, really. Jackson noticed the pile of fur in the trash can. He didn’t seem all that surprised.\n\n“I don’t they’re gonna find her,” he whispered while thumbing through a comic book.\n\n“Why not?”\n\n“’Cause they’re looking for coyotes,” he continued. “She don’t look like no coyote no more.”\n\n“What she look like then?”\n\nHe shook his head.\n\n“Like… weird.”\n\n \n\nBy evening, a bunch of trucks stopped outside our house. Some people were cheering and yelling. We could see they’d killed a bunch of coyotes and laid them out in the back of a truck – I could see it from the edge of my bedroom window, if you just leaned out a bit. Everyone seemed relaxed about it, cheering and smiling at one another. One of the older men were getting all kinds of attention, clearly showing he was the one who’d killed the most.\n\n“You think they got her?” I asked.\n\n“She’s not in there,” Jackson said. “I can tell.”\n\n“Should we say something?”\n\n“Do you *want* to say something?”\n\nI didn’t know. I wanted Jessie to be healthy again, but they weren’t going to help her, that much was for sure. But if she really was sick, what could we do?\n\n \n\nJackson ended up staying the night for a sleepover. We had hot dogs and French fries, and we got to stay up as long as we wanted playing on the computer. It was nice and all, but our hearts weren’t in it. We were scared. If we told them about Jessie, they’d go kill her. And if we didn’t, she’d still be out there with God knows what. So we kept our mouths shut and played our games hoping an answer would pop out at us. As the clock crept past midnight, we called it a day.\n\nWhen I came back from brushing my teeth, Jackson was already in his sleeping bag on the floor. I crawled into my bed and put away a couple of comic books. As I said my prayers and closed my eyes, I heard rustling. Looking up, I could see Jackson sitting up, looking out the window. Without a word, I looked the same way and listened.\n\n“You hear that?” he whispered.\n\nI heard something, but I couldn’t put my finger on what. Not a coyote, that was for sure. Not a person either. Not a bird.\n\n“What is that?” I asked.\n\n“It’s *talking*.”\n\nI got out of bed and tip-toed to the edge of the window, peering out at a steep angle. There was someone standing in the yard. Someone our size, with long, brown hair.\n\n“There’s someone there,” I gasped.\n\n“Does it have a weird face?”\n\nI looked back at Jackson, then out the window. They were gone.\n\n \n\nThere were scratches on the front door, like a dog trying to get in. I crawled down to Jackson and sat shoulder-to-shoulder, armed with nothing but a flashlight. We tried to listen, but it was hard to hear anything over our panting. Another scratch at the front door, then something sprinting down the gravel path on the west side of the house. Something creaking as a weight came down on the trellis in the garden.\n\nThen nothing for a while. The wind was picking up, so it was getting harder to separate the noises. Was that a tap from a branch, or someone coming up the stairs? Jackson didn’t take any chances. He pulled up a chair and barred the door, just in case. Then, he looked up.\n\n“You guys have an attic?” he asked.\n\n“Yeah,” I said. “But we’ve checked there. No one’s up there.”\n\n“But can you get in that way?”\n\nI thought about it and bit my lip. I shook my head.\n\n“Not unless you climb up the roof, or leap about… ten feet from the tallest tree in the yard.”\n\nJackson’s eyes went wide.\n\n“What if she can do that?” he asked.\n\n“What?”\n\n“I said, what if she can do that? Can she get in?”\n\nWe listened closely and held our breaths. There were too many sounds.\n\n \n\nJackson hid under the bed as I moved the chair from the door. It banged against the edge of the desk, sending a bolt straight through me. It felt like I’d been shot by a sound. Suddenly, I heard something from upstairs. Something rhythmic. Footsteps?\n\nMaybe that’s how she got in. There might be a hatch to the attic in my closet.\n\nI wasn’t going to investigate. Jackson was safe under the bed, and I had to get my parents. I hurried into the hallway and ran all the way to their bedroom. I knocked and tried to open the door, but they’d locked it. A couple of seconds later, my mom opened, her hair in a tussle. Dad was sleeping soundly.\n\n“I think there’s someone in the attic,” I whispered.\n\n“What? Who?”\n\n“The coyote.”\n\nI could see her face relaxed as her eyes rolled in a tired arc. Then something thumped. We both looked up.\n\nWas that a hatch being opened?\n\n \n\nMom woke dad up, and he grabbed a baseball bat from their wardrobe. He took point with mom right behind him. Dad stepped into my room with the bat ready to swing – but there was no one there. He went in to check the closet. It was open, and the hatch in the ceiling was too. Mom looked out the window. Then I heard a whimper.\n\n“Jackson?” I whispered.\n\n“…she’s down here.”\n\nWe all turned to the bed, looking down.\n\n“…she’s down here, with me.”\n\n \n\nI stepped back and got down on one knee.\n\nI saw a long face with a canine grin stretching from ear to ear. Human skin, with rough brown-looking fur-hair. Big, yellow, eyes. It’d curled up next to Jackson, but now she was looking me straight in the eye.\n\nShe was showing her teeth and salivating. Just like she always did before she bit into a tasty treat. She opened her mouth wide, and an awful sound rolled out of her. Like the grumbling of an empty stomach, she burped out a couple of syllables at me.\n\n*“Prettiest girl.”*\n\n \n\nMaybe she was just happy to see me. I don’t know. But something caused her to throw herself out from under that bed. She leapt out with such force that she slammed into me, knocking me out the door. My dad got her by the hair and dragged her back as she snarled and yelped. Mom closed the door, screaming at him to hold her down.\n\nIt was a full minute of these awful noises and screams. Someone yelled in pain. Barks and snarls. Glass breaking, and something heavy thudding into a thin body. At one point, I thought the door was about to buckle and break.\n\nAs the sounds calmed, I put my hand on the door. I heard a cough on the other side. I turned the handle as I heard my mom from the other side. She was calm. Uncomfortably so.\n\n“Don’t come in,” she said. “Call the police.”\n\n“But mom-“\n\n“Go downstairs, and… call the police. Tell them there’s been an accident.”\n\nSo I did.\n\n \n\nThe police came, then an ambulance. They had to carry my dad out. Something had bit off two of his fingers and clawed one of his eyes. They tried to save it in surgery, but he ended up losing it. Mom got a deep bite across the wrist, but nothing that a couple of stitches couldn’t fix. I only saw the aftermath in passing, but my whole room had turned into a bloodbath.\n\nJackson’s mom came by later to take care of us. They had to drag him out from under that bed. I never dared ask him what he saw, and he never had the stomach to tell me. He had stayed under there for the whole thing. The only thing he could say for sure was that Jessie got out. She went through the window.\n\nI tried to comfort him the best I could.\n\n“Maybe it wasn’t her,“ I said. “Maybe it was a robber.”\n\nHe shook his head.\n\n“She still had the hairpin.”\n\n \n\nLooking back at that night, it’s been almost 20 years. Life moves on, but my dad still has the scars. Mom does too, but she hides them well. They never understood what happened. They’ve been telling themselves that it was a wild animal, and that it was just too dark to make sense of it, but it’s impossible that they still believe that. They must have seen her. But we’re just that kind of family who doesn’t talk about that kind of thing. We talk about weddings, anniversaries, and birthday presents. Or if we’re feeling chatty, dad brings up whatever’s going on with the Broncos. He’s originally from Denver.\n\nWe ended up moving there once the recession hit. Jackson and I have kept in touch over the years, but our occasional reunions would be delegated to yearly Facebook chats. That’s why I’m writing this down.\n\nEarlier this year, Jackson reached out to me. He doesn’t do that a lot. He didn’t really send me a message; it was just a link to a picture.\n\nLast 4^(th) of July, there was a bit of an event in downtown Hilltop. There were dozens of pictures of it, ranging from a chili cookoff to a tractor pull. But one of those pictures stood out more than the others.\n\nThe second to last picture shows the local pastor and his wife, both holding up a prize ribbon. But if you look closely at the lefthand corner of the frame, you see a woman. A short, gorgeous woman, with long brown hair and striking, yellow, eyes.\n\nAnd a pink hairpin, with a blue sunflower."
  },
  {
    "id": "1qkmzqt",
    "title": "The Good Samaritan",
    "author": "Whistohhhhh",
    "score": 2314,
    "url": "https://www.reddit.com/r/nosleep/comments/1qkmzqt/the_good_samaritan/",
    "created_utc": 1769162834.0,
    "num_comments": 65,
    "word_count": 3066,
    "body": "The Corolla died three miles past the last exit sign, the engine cutting out with a shudder that I felt in my teeth. I coasted onto the shoulder and sat there in the dark, hazards clicking, watching semis blast past and rock the car in their wake.\n\nMy phone showed one bar. Then none. Then one again.\n\nThe tow company put me on hold before a woman with a smoker's rasp told me two hours, minimum. Maybe three. Dispatcher said there'd been a pile-up west of Barstow and they were running every truck they had.\n\n\"There's a rest stop about a mile ahead,\" the woman said. \"If you want to wait somewhere with a bathroom.\"\n\nI looked at the desert darkness beyond my headlights. A mile didn't sound far. A mile sounded like a death sentence.\n\n\"I'll stay with the car.\"\n\n\"Suit yourself. Driver'll call when he's twenty out.\"\n\nThe line went dead. I locked the doors and turned off the hazards to save the battery and sat in the darkness, watching my phone screen dim and brighten and dim again.\n\nA pickup pulled onto the shoulder behind me.\n\nI watched it in the rearview. White Ford, maybe ten years old, work lights mounted on the roof rack. It sat there for a full minute before the driver's door opened and a man stepped out.\n\nHe was mid-fifties, maybe. Thick through the shoulders. He wore a denim jacket and walked with the unhurried gait of someone who had nowhere else to be. When he reached my window, he made a little circular motion with his finger.\n\nI cracked the window two inches.\n\n\"Car trouble?\" His voice was gentle. Midwestern, maybe. The kind of voice that read bedtime stories and knew all the words to church hymns.\n\n\"Tow truck's coming.\"\n\n\"That's good.\" He nodded, looking at my hood like he could diagnose the problem through it. \"How long they say?\"\n\n\"Two hours.\"\n\n\"Two hours.\" He repeated it like he was tasting the words. \"That's a long time to sit on the side of the 15. You got water? Gets cold out here at night, but you'd be surprised how fast you dehydrate.\"\n\n\"I'm fine.\"\n\n\"Rest stop's about a mile up. Vending machines, bathroom, good overhead lighting. Safer than sitting here in the dark.\"\n\n\"I'll wait with the car.\"\n\nHe smiled. His teeth were very white and very straight, the kind of teeth that cost money. \"Smart. Don't trust strangers. That's smart.\" He patted the roof of my car twice, gently, the way you'd pat a dog. \"You need anything, I'll be at that rest stop. White Ford. Name's Gary.\"\n\n\"Thank you.\"\n\n\"Don't mention it.\"\n\nHe walked back to his truck. Didn't hurry. Didn't look back. The Ford pulled around me and merged onto the highway, taillights dwindling until they disappeared.\n\nI realized I'd been holding my breath.\n\nThe temperature in the car dropped until I could see my breath. I started the engine to run the heater. It turned over, coughed, died. I tried again. Nothing.\n\nI got out and started walking.\n\nThe desert was louder than I'd expected. Wind through scrub brush, the distant keen of something that might have been a coyote, the hiss of sand against my jeans. The highway was a black river to my left, cars passing in bursts of light and noise that left me more alone each time they faded.\n\nThe rest stop appeared as a glow on the horizon first, then resolved into a concrete rectangle surrounded by parking lot lights on tall poles. Two big rigs sat at the far end, dark and silent, their drivers asleep in the cabs. A sedan with Nevada plates sat near the bathroom entrance.\n\nAnd the white Ford, parked directly under the brightest light.\n\nGary sat on a picnic bench near the vending machines, reading a paperback. He looked up when I entered the pool of light and smiled like I was an old friend arriving at a party.\n\n\"Decided to take me up on it.\"\n\n\"Car won't start.\"\n\n\"Battery, probably. Sitting with the hazards on drains them faster than people think.\" He closed his book, something with an old Western cover.\n\n\"I'm fine.\"\n\n\"Water, then. You look cold.\"\n\nI was cold. My jacket was in the car. I'd walked a mile in a thin sweater because the thought of going back for it felt like admitting I'd be out here longer than I could stand.\n\n\"Okay. Water. Thank you.\"\n\nHe fed quarters into the machine and retrieved a bottle, brought it to me with both hands extended like an offering. When I took it, his fingers didn't linger. He stepped back immediately, maintaining a distance that felt calculated to reassure.\n\n\"I didn't catch your name.\"\n\n\"Claire.\"\n\n\"Claire.\" He smiled again. \"Pretty name. Old-fashioned. You don't hear it much anymore.\"\n\n\"It was my grandmother's.\"\n\n\"That's nice. Keeping it in the family.\" He returned to the picnic bench, sitting on the table with his feet on the seat, hands folded in his lap. Patient. Unhurried. \"You call the tow company again? Let them know where you are?\"\n\n\"Not yet.\"\n\n\"Signal's better over by the bathrooms. Something about the building, I think. Metal in the roof blocks the interference.\"\n\nI walked to the bathroom entrance. Gary didn't follow. I checked my phone and found two bars, solid. The tow company picked up after three rings.\n\n\"He's still working the pile-up,\" the woman said. \"Shouldn't be too much longer. You're next on his list.\"\n\n\"Can you tell him I'm at the rest stop? Mile past where my car broke down?\"\n\n\"I'll let him know.\"\n\nI hung up. When I turned around, Gary was standing ten feet away.\n\n\"Get through?\"\n\n\"Yeah. Still waiting on the pile-up.\"\n\n\"Those can take a while. Depends on how bad it is, how many vehicles.\" He tilted his head. \"You want to sit? Benches aren't comfortable, but they're better than standing.\"\n\nWe sat at the picnic table, across from each other. Gary picked up his paperback and set it aside. The cover showed a man in a black hat pointing a revolver at something outside the frame.\n\n\"You read Westerns?\" I asked.\n\n\"Louis L'Amour, mostly. My father used to read them. Reminds me of him.\"\n\n\"Is he still around?\"\n\n\"Passed when I was thirty. Heart attack. Quick, at least.\"\n\nA semi pulled into the rest stop, air brakes hissing. The driver climbed down from the cab, a heavy man in a flannel shirt, and walked to the bathroom without looking at either of us.\n\nGary watched him go. \"Truckers don't sleep enough. Read an article about it once. They take pills to stay awake, drive eighteen, twenty hours at a stretch. Then they pull off and crash for a few hours and do it again. Hell of a way to make a living.\"\n\n\"What do you do?\"\n\n\"Contractor. Kitchens and bathrooms, mostly. Remodels.\" He held up his hands, showing me the calluses. \"Good honest work. Keeps me busy.\"\n\n\"You're out late for a contractor.\"\n\n\"Couldn't sleep. Happens sometimes. I drive when it gets bad. Helps clear my head.\" He smiled. \"You married, Claire?\"\n\n\"Divorced.\"\n\n\"Kids?\"\n\n\"No.\"\n\n\"That's probably for the best. Divorce is hard enough without kids in the middle.\" He was watching the trucker's rig now, waiting. \"I've got a daughter. Lives in Portland. Works for one of those tech companies, the kind where they have ping-pong tables in the office and call their employees a family.\"\n\n\"That's nice.\"\n\n\"We don't talk much anymore.\"\n\nThe trucker came out of the bathroom, still not looking at us, and climbed back into his cab. The engine rumbled to life. Headlights swept the parking lot as he pulled out, and then we were alone.\n\n\"You're nervous,\" Gary said. It wasn't a question.\n\n\"I'm just tired.\"\n\n\"You're nervous because you're smart. Woman alone, middle of the night, stranger being friendly.\" He nodded slowly. \"I tell my daughter the same thing. Trust your instincts. Be careful. The world isn't safe for women the way it's safe for men. Never has been.\"\n\n\"That's good advice.\"\n\n\"Is it?\" He leaned forward, elbows on his knees. \"Here's what I wonder about, Claire. What good does being careful do if the danger doesn't look like danger? If it looks like a guy in a denim jacket reading Louis L'Amour at a rest stop? If it looks like help?\"\n\nI didn't answer.\n\n\"My daughter,\" Gary said. \"The reason we don't talk. Her mother told her something before she died. A warning. Stay away from your father. Don't be alone with him. Don't trust him.\"\n\n\"Why would she say that?\"\n\n\"Because she knew me. Better than anyone ever has.\" He picked up the paperback and turned it over in his hands, not looking at the cover. \"Claire, I've been doing this drive for three years now. Every few weeks, when I can't sleep. And I stop here every time. Right here at this rest stop. You know why?\"\n\n\"Why?\"\n\n\"Because people break down out here. All the time. Forty miles of nothing in either direction, cell service that barely works, tow trucks that take forever. And most of the time, people just wait it out. But sometimes there's a woman. Alone. Stranded. And I see her car on the shoulder, and I think to myself, she's exactly the kind of person that bad things happen to out here. Wouldn't it be something if I could help. If I could just make sure she's safe until her ride comes.\"\n\n\"That's very kind.\"\n\n\"No. It isn't.\" He set the book down. \"Kindness would be driving past. Kindness would be minding my own business. But I can't seem to do that. I see a woman alone in the dark, and I have to stop. I have to.\"\n\nMy phone buzzed in my pocket. I didn't reach for it.\n\n\"You should check that,\" Gary said. \"Might be your tow truck.\"\n\nI pulled out my phone. Text from an unknown number: En route. 20 mins.\n\n\"He's coming,\" I said. \"Twenty minutes.\"\n\n\"Good. That's good.\" Gary stood up from the bench. \"Walk with me.\"\n\n\"I should wait here. Where he can see me.\"\n\n\"He'll find you. Walk with me. Just to the edge of the light. I want to show you something.\"\n\nWe walked together toward the edge of the parking lot, where the overhead lights gave way to desert darkness. Gary stayed a half-step behind me, just in my peripheral vision. I could hear him breathing, slow and even.\n\n\"This is the spot,\" he said.\n\nI stopped. The highway was visible in the distance, headlights appearing and disappearing.\n\n\"What am I looking at?\"\n\n\"Nothing. That's the point. You can't see anything from here. Someone in the rest stop, they can't see us. Someone on the highway, they're going too fast to notice. We're invisible.\"\n\nI turned to face him. \"What do you want?\"\n\n\"I want to tell you something. Something I've never told anyone.\" He put his hands in his pockets, and I flinched before I could stop myself. He noticed. \"I'm not going to hurt you, Claire. That's not what this is. But I need you to understand what you're standing next to. What you've been sitting across from for the last hour. What you took water from.\"\n\n\"Okay.\"\n\n\"I've never hurt anybody. Not in the way my daughter thinks. Not in the way you're thinking right now.\" He paused. \"But I've thought about it. I've thought about it more than I've thought about anything else in my life. Since I was fourteen years old, I've thought about what it would be like. The sound it would make. How it would feel in my hands. Whether they'd fight or freeze or beg. I've read about it. I've planned it. I've driven out here, to this exact spot, and I've walked women to this exact place, and I've imagined it so clearly that sometimes I can't tell the difference between what I've done and what I've only wanted to do.\"\n\nMy legs felt locked in place. Later, I would wonder why I didn't run. Later, I would lie awake for months turning this moment over, trying to understand the paralysis.\n\n\"Say something,\" Gary said.\n\n\"What do you want me to say?\"\n\n\"I don't know. That's the thing. I've never gotten this far before. The other times, I walked them out here, and I made small talk, and I let them go, and they never knew. They got in their cars or their tow trucks and they drove away and they never thought about me again. Just a nice man at a rest stop. But tonight I wanted to say it out loud. I wanted someone to know.\"\n\n\"Why me?\"\n\n\"I don't know.\" He smiled, and it was worse than anything else he'd done because it looked genuine. Warm. \"Maybe because you look like you'd understand. You've got that look, Claire. Like you've seen things. Like you know the world isn't what people pretend it is.\"\n\n\"I don't understand this at all.\"\n\n\"No. I guess you don't.\" He looked at the desert, at the darkness beyond the parking lot lights. \"My wife figured it out. Took her twenty years, but she figured it out. Not what I'd done, because I haven't done anything. What I am. She could see it in me, she said. Something behind my eyes. Something that wasn't like other people. She stayed with me anyway, because she thought she could fix it, or save me, or some other thing that women tell themselves when they love someone they shouldn't love. And when she was dying, when she knew she couldn't protect anyone anymore, she told our daughter. She said, your father is a monster. He's never done anything, but he is. Stay away from him. And my daughter believed her. Because my wife wasn't a liar. My wife was the most honest person I've ever known. And if she said I was a monster, then I was.\"\n\n\"Are you?\"\n\nGary looked at me for a long time. \"I don't know. I think about it all the time, and I still don't know. What makes someone a monster? Is it what they do, or what they want to do? If I live my whole life without hurting anyone, am I still a monster because I wanted to? Because I thought about it every single day? Because the only reason I didn't was fear, not conscience?\"\n\n\"I don't know either.\"\n\n\"No. You don't.\" He took a step toward me, and I stepped back, and he stopped. \"That's the first time you've moved away from me. The whole night, that's the first time. You didn't move away when I walked up to your car. You didn't move away when I brought you the water. You didn't move away when we sat at the table, when we walked out here, when I told you what I was. But now you move. Why now?\"\n\n\"Because now I believe you.\"\n\n\"Good.\" He nodded. \"That's good. You should believe me.\" He took his hands out of his pockets, slowly, showing me they were empty. \"Your tow truck's going to be here soon. You should go wait by the road.\"\n\n\"What are you going to do?\"\n\n\"Drive home. Go to bed. Wake up tomorrow and give an estimate on a bathroom remodel in Rancho Cucamonga.\" He smiled again. \"That's the thing about people like me, Claire. We look like everybody else. We sound like everybody else. We do bathroom remodels and read Louis L'Amour and stop to help women whose cars have broken down. And most of the time nothing happens, because the circumstances aren't right, or the risk is too high, or we just decide not to. But the wanting is always there. Every single day. And you'll never be able to tell. Not until it's too late.\"\n\nHe turned and walked back toward the rest stop, hands in his pockets, unhurried. I watched him until he reached his truck. He got in, started the engine, and pulled out onto the highway heading east. Toward Victorville. Toward a house where he lived alone.\n\nI stood at the edge of the parking lot until headlights slowed on the highway and the yellow flash of a tow truck's light bar appeared. The driver pulled into the rest stop and leaned out the window. Young guy, early twenties, apologetic about the wait.\n\n\"Hell of a night,\" he said. \"You okay? You look like you saw a ghost.\"\n\nI climbed into the passenger seat. Closed the door. Locked it.\n\n\"Just cold,\" I said. \"Long wait.\"\n\nHe talked the whole way back to my car. The pile-up near Barstow, the overtime, his girlfriend who didn't understand why he worked nights. I didn't hear any of it. I was thinking about Portland. About a daughter who believed her mother's warning. About a wife who stayed with a monster for twenty years because she thought she could save him.\n\nThe Corolla's battery was dead, just like Gary had said. The driver jumped it in five minutes, and I sat behind the wheel as the engine idled, waiting for the charge to build.\n\n\"You good to drive?\"\n\n\"I'm good.\"\n\n\"Nearest gas station's about twenty miles. Get yourself some coffee.\"\n\n\"I will.\"\n\nI pulled onto the highway and drove east, toward the glow of Las Vegas on the horizon. In my rearview, the rest stop shrank to a single point of light in all that darkness, and then it was nothing at all.\n\nI never told anyone about Gary. Not the police, not my friends, not the therapist I started seeing. But I need to tell someone. I need people to know he's out there. But what would I say? A man talked to me. A man gave me water. A man walked me to the edge of the light and told me what he was and then drove home to sleep in his bed like any other person. \n\nNothing happened.\n\nThat was the worst part. Nothing happened, and I couldn't prove anything, and somewhere in Victorville a man with a gentle voice was lying awake in the dark, thinking about the sound it would make. The way it would feel. Whether they'd fight or freeze or beg.\n\nAnd I would never know if tonight was the night he stopped imagining.\n\nOr tomorrow night.\n\nOr the night after that."
  },
  {
    "id": "1qttmav",
    "title": "My Family Locked Themselves In A Bomb Shelter. Four Years Ago, They Finally Opened The Door.",
    "author": "beardify",
    "score": 2166,
    "url": "https://www.reddit.com/r/nosleep/comments/1qttmav/my_family_locked_themselves_in_a_bomb_shelter/",
    "created_utc": 1770035003.0,
    "num_comments": 56,
    "word_count": 6457,
    "body": "In my family, we grew up waiting for the end of the world.\n\nAny day now, the final trumpet would sound. God would send his angels to smite the wicked, uplift the righteous, and initiate the apocalypse– Or so we thought, back then.\n\nIf you’re from this tiny cornbelt town, you might have already seen the news reports. You might already know one part of our story: the part about madness, murder, and the extremes to which some people will go for their beliefs. It’s what the police and the media want you to hear, but there’s another side to this story as well–\n\nOur side.\n\nMost people out here take religion seriously, but none so much as Father Isaac Graves. We were a family of five: Father Isaac, my sister Judith, my brothers Noah and Saul, and me. Our mother had ‘abandoned the faith' shortly after Saul was born– Or at least, that was what Father Isaac told us.\n\nAll I knew for sure was that we had moved across the country without warning, and that it was suddenly very important to Father Isaac that we never tell anyone outside the family where we lived. He claimed that secrecy was necessary to keep us safe in a fallen, godless world, but as I got older, I began to question Father Isaac’s version of events.\n\nI daydreamed that maybe the real story was reversed: maybe our mother was out there searching desperately for us. Maybe she was hiring private investigators and driving up and down these desolate county roads with her long blonde hair blowing in the wind. One day, I prayed, she would turn up our long gravel driveway. She would know how to find us, even though the property was huge and our new house was hidden from the road by acres of forest. She would honk her horn and my brothers, my sister and I would all run out and climb into the back of her car. Then she’d take us someplace far away from here, someplace where we weren’t known as ‘that crazy preacher’s kids,’ someplace where we didn’t have to dress differently from everyone else or spend hours each day studying the Bible.\n\nOf course, I felt guilty for having such thoughts. I asked God for forgiveness every night, especially because–considering how things were going in the world–Father Isaac seemed to have been right all along. All the signs pointed to it. The political divisions. The collapsing economy. The global pandemic. The year was 2020, and it really did feel like the end of the world was just around the corner. I was afraid: not only because I feared that my convictions might not be strong enough to save me, but also because Father Isaac had quit his day job as a construction manager. He immediately used his contacts to begin some sort of massive project at the back of our property, but he refused to allow us near it or tell us what it was. All will be revealed in God's good time, he said with a small smile whenever anyone asked.\n\nMaybe it was just my lack of faith, but that wasn’t good enough for me. Prices were sky high already, and nobody else in the family was old enough to work. How were we going to live? It was raining the night that Father Isaac woke us up and called us down to the kitchen. On the radio, a local announcer was saying that the pandemic had gotten so bad that a lockdown was going to be declared statewide. It was the moment Father Isaac had been waiting for. He told us to go upstairs and pack our backpacks with everything we held dear, because we might never be coming back. He told us not to worry, because he had made a shelter where we, the faithful, could ride out the coming storm.\n\nMy heart was in my throat as I followed Father Isaac out into the rainy night. There was no light pollution this far from the city, and our flashlights revealed only more and more empty fields. Signs of construction were everywhere, but there wasn’t a single structure to be seen. What had Father Isaac been building out here? Part of me wondered whether he had lost his mind at last. Father Isaac bent down and revealed a man-sized metal hatch hidden in the grass. He inserted an enormous key that hung from a lanyard around his neck, right beside his cross, and unlocked it. We'll be safe here, he explained, until God's fire has purged this world of sin. One by one, we climbed down the ladder underneath.\n\nIt was too dark to see much, but the space at the bottom seemed about as large as our living room back home. Once we were all inside, Father Isaac climbed back up and sealed the hatch behind us. Then he switched on the lights. People who saw the news footage must think that our bunker was a dark, filthy dungeon–and I can't blame them–but that's not what it looked like at first. The solar-powered lights lining those subterranean hallways were bright; the walls smelled like fresh paint. We had well water to shower with or drink, vitamin D tablets to make up for the lack of sunshine, and enough canned food for 1,260 days. According to Father Isaac, that was exactly how long the Great Tribulation would last.\n\nDuring our first night in the bunker, it felt like hardly any time at all. Noah and Saul exhausted themselves jumping on their newly-made beds; Judith, who loved music, was thrilled to discover that Father Isaac had ordered her piano to be set up in the main room. As the middle child, I often felt overlooked by my family, and I was touched to discover that Father Isaac had remembered my love of reading and acquired two shelves of church-approved volumes. Noah and Saul's laughter. The haunting notes of Judith's piano echoing down the bunker hallways. The rustle of pages as I flipped through so many books. Those sounds still haunt my dreams.\n\nFather Isaac explained that he had nearly bankrupted himself with the building costs, but it didn't matter: the day was soon coming when worldly currency would be no good to anyone. There was a radio set up to monitor events in the world outside, but he cautioned us that we should listen for no more than an hour each day. There’s nothing up there but corruption and tragedy, he warned us.\n\nI remember thinking suddenly of our mother, and wondering how she would survive in the doomed world above. What would she have thought of Father Isaac’s grand plan for surviving the apocalypse? I tried not to ask myself that question too much, because I already knew the answer: she would have told me to run. She would have told me to get as far away from Father Isaac as possible, just like she did. Then again, if I had, I would still be up there, waiting to fall victim to disease, food shortage, and God only knew what else. Thanks to Father Isaac, I was safe and sound with the rest of my family. I no longer had to worry what other people in town thought of us, or about how I was going to tell Father Isaac that I planned on moving away when I turned eighteen. Dozens of feet of earth and steel had cut me off from the problems of the world. Although I had never been to an amusement park or ridden a roller coaster, I imagined that it was similar to what a person must feel when a roller coaster’s safety bar lowers and the wheels begin to move. For better or worse, we were all locked in for the ride.\n\nIt started during the third month, with a seemingly innocuous question at the dinner table. My youngest brother, seven-year-old Saul, wanted to know where the pipes went: the ones we got our water from, and the others that took away our refuse. Father Isaac provided a thorough, scientific explanation, but Saul didn't look convinced. I wondered why he even cared. Saul was Father Isaac's golden child, rambunctious and cheerful. He'd spent most of the past month racing his brother down the hallways on their miniature bikes or tossing a basketball at a hoop in the storage room: it wasn't like him to be interested in anything that he couldn't shoot into a goal.\n\nWhen I asked him about it later, Saul just shrugged, but when I walked past the bedroom he shared with Noah later that night, I noticed something strange. Both brothers usually snored like a sawmill, but I could only hear Noah. Peering inside, I could see Saul lying wide awake and still, his body rigid, his eyes wide and white in the dim light. I didn't know what it meant, but I hoped that whatever my little brother was going through wouldn't last. If it did, I would have to tell Father Isaac, and who could say how he might react? On the surface, our father was the same as always–strict but wholesome, and brimming with faith–yet I could see the tension beneath the façade. As far as he was concerned, this was the defining event of his life, and he was staking everything on things going right in the bunker.\n\nA few days later, something woke me up in the middle of the night. Since Father Isaac was convinced that virtuous people had nothing to hide, there were no doors in the bunker; I was used to hearing strange sounds and seeing the flicker of flashlights as my siblings went to the bathroom or to the kitchen for a drink of water. What I wasn't used to, however, was the whispering. I lay there in the lightless bedroom, imagining the dozens of feet of dirt above my head and asking myself whether what I was hearing might really be just wind in the pipes.\n\nCould that be why Saul had been so curious about them? Unsure, I climbed out of bed and made my way to the bathroom. To avoid drawing attention to myself, I left my flashlight behind. I had made the trip so many times, I figured that I wouldn't need it, but distances were different in the dark. The voices sounded closer, then further away, and it wasn't long before I realized that there were two of them. Finally, I spotted the glow of a flashlight that had been abandoned on the floor. It was Saul's. I peeked around the corner.\n\nSaul was standing on his tiptoes with his head in the sink, listening to the faucet. Occasionally he would turn his face, mutter something into the drain, then wait for a response. I had been watching the confusing scene for over a minute when Saul suddenly stood up and glared at me; his eyes seemed to reflect red light, like those of a dog in a nighttime photo. There was no way he could have seen me in the pitch-blackness…and yet somehow I was sure he had. I backed away slowly and returned to my room with more questions than answers, and hours passed before I managed to fall back asleep.\n\nThe next morning, I found I couldn't relax during my shower. My eyes kept drifting to the drain in the center of the tile floor, as though at any minute, something horrible might come slithering out of it. After I'd finished and dried myself, I decided to try a little experiment. I tiptoed up to it, bent down, and whispered hello. Of course, there was no response. No eerie voice, no dead gray fingers or black tendrils reaching up to coil around my neck. Father Isaac, however, noticed the dark circles under my eyes and my constant yawning.\n\nMy reward for staying up late was extra cleaning duty, and by evening, I barely had enough energy left to kick a soccer ball around with Noah and Saul after dinner. I usually played goalie, while nine-year-old Noah and seven-year-old Saul ran back and forth trying to score. There wasn't much space in the empty second storage room, but at least it passed the time. That night, however, Saul didn't seem to be aiming for the goal: he seemed to be aiming for me. Barely five minutes into our ‘game’ he kicked the ball straight into my stomach, winding me. It seemed impossible that such a small boy could do so much damage, yet there I was, gasping for air.\n\nOrdinarily, Saul hated seeing anything hurt, even insects; he should have been running to my side to see if I was okay– But he didn’t. My youngest brother stood on the other side of the cold concrete storage room, watching me suffer with a smirk on his face. I know what you did, that little smile seemed to say, and you'd better not do it again. I heard Saul whispering again a few nights later, but I didn't go after him. The truth was, I was becoming more than a little afraid of my little brother. Instead, I snuck into the kitchen and tried to listen from there. If I was caught, I figured I could always just say I was getting a glass of water. This time, I was sure: there was definitely someone talking inside the pipes. The voice was deep, smooth, and masculine. It reminded me of a politician giving a speech, except that I couldn't understand a single word it was saying. It sounded like gibberish, or maybe some secret code that only the speaker and Saul shared–\n\nBecause regardless of what the voice said, my little brother responded to it, answering in the same garbled language.\n\nConsidering Saul's other odd behavior lately, I realized that I couldn't put it off any longer: I had to tell Father Isaac. Just like Saul had before, I tried to approach the topic by asking Father Isaac questions about the bunker itself. Had he really supervised the entire construction project? Was it possible that there were hidden rooms or passages that we didn’t know about? Father Isaac laughed and told me I’d been reading too many books. Then, the next morning, something occurred that pushed Saul’s nocturnal conversations completely out of my mind.\n\nWar broke out in the world above. The details don't matter, especially because I now know them all to be false. At the time, however, we were only receiving a single radio station, the only one that reached the bunker. Everything sounded real, especially because it fit into Father Isaac’s preconceived notion of what was about to happen. After all, Pestilence was already here; could War, Famine, and Death be that far behind? Even so, there were signs we could have noticed. The reporter’s accent was slightly different from what we were used to, and at times he mispronounced certain words–almost like something that had never spoken a human language before and was just imitating the local reporter’s mannerisms. For some reason, the differences reminded me of the voice I'd heard in the pipes.\n\nWith each passing day, the news became darker, strengthening our faith and our trust in Father Isaac. Instead of depressing us, the tragedies that were supposedly happening in the world above made our bond stronger than ever. At night, we gathered around Judith's piano and sang hymns for a burning world. A year passed that way. A good year, for the most part, as long as I ignored the ominous changes in my youngest brother.\n\nBy that Christmas, the loud fun-loving side of Saul had mostly disappeared. He had become observant and sly, appearing unexpectedly and never forgetting an offense. Noah used to compete and rough-house with his younger brother constantly: now, however, he seemed almost afraid of him. I couldn’t blame Noah…because I was scared of him too. It wasn’t just the personality change; it was the way Saul seemed to know things that should have been impossible to know.\n\nAs convinced as I was that we were living through the apocalypse, I couldn’t help from spacing out during Father Isaac’s daily hour-long bible lectures. I would let his words wash over me while I daydreamed about whatever novel I was reading at the time. No one had ever seemed to notice before, until one night, Saul confronted me in the hallway. Father Isaac might not see what you’re doing, he warned me, but there’s someone else who does. A little while after that, Judith started taking over all of Saul’s chores. I wasn’t sure what he had on her–a picture of a K-pop star he’d discovered beneath her pillow, maybe, or even something more humiliating–but he was blackmailing my older sister. I was certain of it.\n\nThen, at the beginning of our second year underground, Saul began to prophesize. It started around the dinner table one Friday evening. We were having a typical meal–canned green beans, canned potatoes, and canned beef–when Saul suddenly stood up. His eyes rolled back into his head. He gripped the table until his knuckles turned white. And he spoke, in a deep, sonorous voice totally unlike his own: At six-o-six, the beast will awaken. After that one enigmatic phrase, my little brother collapsed into his chair.\n\nFather Isaac was convinced that Saul was speaking in tongues, but what could his prophecy possibly mean? We all watched the clock nervously as it ticked toward the appointed time. At six, Father Isaac turned on the radio. It was the usual doom-and-gloom stuff we were used to: a war report, news of radioactive fallout, climate catastrophe, and more new pandemics. Then, out of nowhere, the device emitted an awful staticky screech. The presenter and dozens of others screamed, and then radio went silent. The clock read 6:06 pm. It was all the proof Father Isaac needed. We had entered into the final stages, and it wouldn't be long now before the kingdom of heaven was at hand. Saul had been Father Isaac's favored child before; now it appeared that he could do no wrong. His next prophecy, however, was far more vague.\n\nThe hour has come when the faithful shall be tested, he announced suddenly after prayer, the whites of his eyes flickering beneath his rapidly-blinking lashes. We must not waver. A few days later, Father Isaac convened a family meeting in the main room after breakfast. He wanted to know whether any of us were sneaking food between mealtimes…because our supplies had begun to disappear. He made it clear that there would be no condemnation or punishment if anyone confessed, but also added that the behavior had to stop. He had calculated the exact amount of food that we would need to comfortably survive the end of days, but now, thanks to someone’s selfishness, we would have to begin rationing.\n\nA look of worry and confusion covered every face–except Saul's. He nodded along thoughtfully, but didn't seem nearly as blindsided by the announcement as the rest of us. Noah noticed it too, and from that day on, he began to keep a closer eye on his younger brother. It wasn't easy. Saul had a way of disappearing and reappearing around the corners of the bunker’s twisting hallways; he was always there to report you for cursing after you stubbed your toe or for taking a break during morning chores. If he didn't want to be found, however, he was almost impossible to pin down.\n\nThe thought that he was tracing our movements using echoes in the pipes sent a shiver up my spine. Our supplies, meanwhile, continued to disappear. The theft continued until Easter, when Noah said he had an announcement to make. So do I, Saul shouted, cutting him off. Noah is the thief! Noah was flabbergasted: it was clear that he had been about to accuse Saul of the same thing, but by beating him to it, his younger brother had stolen his credibility.\n\nYou're not even eating them, Noah whined, as Father Isaac separated the two fighting brothers. You're just throwing them away!\n\nSaul stared at Noah. Anger had twisted his face into something unfamiliar and wrong; for a second, I didn't recognize my own brother.\n\nSomeone is watching who hears your lies, he snarled, and you will NOT escape from judgement! That too, turned out to be a prophecy of sorts, because Noah didn't wake up the following morning.\n\nTo all appearances, his heart had just stopped in his sleep, but I could help but suspect there was more to it than that. Noah and his little brother shared a room, after all, and was it really possible that Saul hadn't noticed his death overnight? Not unless he caused it, I remember thinking darkly.\n\nFather Isaac didn't dare risk our lives by returning to the surface for Noah's burial, so we gave him last rights and disposed of his body the only way we could: in pieces, with the trash. We could hear Father Isaac sobbing in the kitchen as he swung the meat cleaver. Judith murmured a prayer; I looked at my shoes. Only Saul was smiling. Our family was never the same after that.\n\nOn the surface, life continued just as before–the same meals, the same prayers, the same daily rituals–but the joy had gone out of it. We no longer splashed each other with our mop buckets during chores, and the soccer ball no longer boomed against the walls of the empty storage room after dinner. Without Noah's steady high-pitched voice, even the hymns we sang felt different. Meanwhile, our issues with the bunker continued.\n\nThe lights went out in the wing where Saul slept; Father Isaac thought that maybe rats had chewed through the cords, but there had been no sign of vermin during the entire two and half years that we’d been living underground.\n\nLater, several leaks appeared in the same hallway. No matter how many of them we patched, more kept appearing, filling the area with puddles, mildew, and a maddening dripping sound. I didn’t understand how Saul could stand it down there, but the truth was, I was glad to see less of him.\n\nFather Isaac and Judith may have been baffled by the power outages and plumbing issues, but I wasn't. More and more, I was convinced that Saul was sabotaging the bunker. I didn't want to believe it, because that might mean that my other, fouler suspicions about Noah's death were also true. It was only then that the bunker began to feel like a prison.\n\nWe were living on half rations, in the dark most of the time. Constant exposure to the damp, moldy air had caused all of us to develop a worrying cough. Worst of all, however, were the problems with the water supply. One morning, we woke up to find the faucets sputtering and spitting a disgusting gray sludge. It was as though the well we depended on had somehow gone dry. Father Isaac agonized over the problem for days, asking aloud whether this was a sign that we should finally leave the bunker. After all, we could live with minimal food and light…but we couldn't live without water. Then, on the third day, the water came back without warning, flowing from the taps in a glorious, clear flood.\n\nIt was the most beautiful thing I’d ever seen. We chugged it down, practically shoving one another away from the faucets as we fought to drink our fill. We were all so desperately thirsty that none of us–not even Father Isaac–thought to boil it first. A few hours later, Father Isaac, Judith and I were hunched over on the shower room floor, vomiting a thin black liquid into the drain. Even after there was nothing left in my stomach, my body kept convulsing, fighting to free itself from whatever corruption had taken hold inside.\n\nI don't recall much of what happened after that. I drifted in and out of sickening dreams: one in which Judith was curled up nude in the corner of the bathroom, howling like an animal; another in which Father Isaac smashed his face into the mirror again and again, begging for forgiveness; a third in which Saul crawled across the ceiling with his head twisted around backwards, staring down at us with hollow, empty eyes. Maybe I’m already dead, I remember thinking; maybe this is hell.\n\nWhen I awoke seventy-two hours later, the mirror lay in shattered fragments on the bathroom floor. Judith, Father Isaac, and I seemed to have made an unspoken agreement to never speak of those feverish days; it was as though we were all somehow ashamed of them, although I couldn't have said why. Only Saul seemed to have been completely unaffected by the sickness, just as he was unbothered by the dark and damp. If anything, he seemed more comfortable in it.\n\nFather Isaac decreed that from now on, all water had to be boiled at least twenty minutes before use: for us, that meant less energy…and even more darkness. I came to dread each trip I made into the lightless parts of the bunker. Whenever I rounded a corner, I was sure Saul would be there, observing me in the pitch-blackness. When the family was gathered together, he acted almost normal, but I was afraid of what he might do if he caught me alone.\n\nFive months later, Judith's pregnancy began to show. I knew the facts of life, just as I knew that neither I nor my younger brother could be the father–which left only one extremely uncomfortable possibility.\n\nA miracle is in our midst, Father Isaac declared. An immaculate conception! With the arrival of this child, perhaps our long time of trial will finally come to an end.\n\nI wasn't fully sure that I believed Father Isaac's words, but the strangest part was, both he and Judith did. Maybe I'm wrong again, I remember thinking. Maybe my family really has been chosen by God, and I just don't have enough faith to see it.\n\nFifteen months later, however, the food had almost run out…and Judith still hadn't given birth. It shouldn’t have been medically possible, especially considering how underfed we all were, but I couldn’t deny the evidence of my own eyes. At first, Judith had been radiant: she had hung on Father Isaac’s words, trusting that what she carried inside was a miracle baby. Yet as the months passed, my kind and charming sister became increasingly withdrawn. Eventually, Judith stopped speaking altogether. She spent more and more time in bed, eyes closed, hands folded atop her growing belly. Apart from her shallow breathing, I could barely tell that she was alive at all.\n\nFather Isaac, too, had taken a step back from family life. He wandered through the hallways like a lost explorer without a compass: muttering prayers, starting projects and leaving the work half-finished. He seemed to have finally reached the limits of his conviction.\n\nWith Judith incapacitated and Father Isaac unhinged, the burden of maintaining our underground home fell entirely on my shoulders. Tasks that had previously been done by all five of us were now mine alone. It was too much, especially considering how malnourished I was, and I wound up focusing on only the basics: keeping us fed, caring for bedridden Judith, and plugging the worst of the leaks in the rear hallway.\n\nOne afternoon, when I was spooning some thin, tasteless vegetable broth between Judith’s lips, her eyes suddenly snapped open. She grabbed my hand and placed it on her stomach, which was too big now to be contained by any clothing.\n\nYou know… Judith whispered …this thing I’ve got inside…I…I don’t think it’s human. Can’t you feel it?\n\nSomething pulsed beneath Judith’s skin; it reminded me unsettlingly of a squirming fish eager to escape from a net. I wanted to say something to comfort her, but I couldn’t find the words–\n\nAnd then the lights went out.\n\nIt was the beginning of the end. With the power gone, we had no way to boil water, warm food, or control the temperature of our subterranean prison. During the past three years and eleven months, we had burned through more than just food: all of our supplies were worn down or used up, and I knew that the batteries in my flashlight were on their last legs. Unless I could convince Father Isaac to open the hatch, we would all soon be stumbling through a dark and suffocating nightmare.\n\nJudith screamed. I felt her flesh contract beneath my hand. Her child was about to arrive. I was fumbling around for my flashlight when someone tugged on the back of my shirt.\n\nLeave, Saul commanded.\n\nI finally got my flashlight working, and in its flickering beam I could see the terror on Judith’s face, the beads of sweat forming on her forehead, the bluish veins pulsing beneath her pale skin… Saul watched our sister writhe and claw at the sheets with patient, impassive eyes…like he already knew what the outcome would be.\n\nLeaving a child of his age in charge of a birth was insanity, but it was clear to me by now that Saul was no ordinary child.\n\nLeave! Saul repeated–\n\nAnd to my shame, I did. I ignored my sister’s pleading eyes and backed out of her cramped bedroom, unwilling to witness what was about to happen. I didn’t think my mind could endure it. As I retreated down the hallway, I heard Saul singing some sort of lullaby. I didn’t know the tune, but the words seemed to be in the same language that he’d been using to communicate with the voice inside the pipes.\n\nI switched off my flashlight, and listened to the echoes reverberating through the pitch-black hallways: The dripping of water. The screams of my sister. That strange, haunting song. Several hours later, the screams stopped, replaced by an infant’s wailing cries. As I switched my flashlight back on, I noticed how much dimmer the light had become. At the edge of its beam, I saw Saul walking toward me, rocking a cloth-wrapped bundle in his arms. Running footsteps came up behind me.\n\nDoes the child live? Father Isaac wanted to know. He didn’t say a word about my sister.\n\nThis was his last hope, I realized: he needed this child to be sign from God that our tribulations were at an end. At the same time, just like me, he hadn’t been able to face whatever had happened in Judith’s room. Suddenly, Saul stopped singing.\n\nIt is time for you to open the door, he ordered.\n\nFather Isaac hesitated and instinctively grasped the key around his neck. He still saw himself as being in charge of our welfare, and what if Saul was wrong? Was it really safe to go outside? He told my younger brother that he would pray on it. Saul shrugged, placed the wailing bundle on the floor, and walked into the darkness of the kitchen. Father Isaac, meanwhile, turned on his own flashlight and approached Judith’s offspring.\n\nI didn’t see what was beneath the cloth when he pulled it back, but I did see the look of revulsion on his face. Seconds later, Saul reappeared behind him, the meat cleaver raised high above his head. It was the same one that had been used to dismember Noah’s corpse so many months before, and now Saul was swinging it at Father Isaac's leg like a lumberjack felling a tree. Father Isaac went down with a grunt, and Saul redirected his strikes at our father’s head. Even as the blade hacked into his face, even as the blood blinded him, even as he screamed, I don’t think that Father Isaac was fully able to process what was happening. Despite all the impossible things he’d seen during our time in the bunker, he couldn’t bring himself to believe that his own favorite son would turn on him. I didn’t stick around to help.\n\nInstead, I ran to Judith’s room, already expecting what I might find but praying that I was wrong. Just as I’d feared, my sister lay lifeless atop her sheets, which had been stained inky black. My flashlight flickered. Then, somewhere in the depths of the bunker, I heard a loud metallic groan. Saul had Father Isaac’s key! He was unsealing the door! With horror, I realized what my younger brother’s next move was going to be: he would just lock me down here and throw away the key! No one would ever know what he had done, what he had become…or what he was bringing out into the world with him.\n\nI raced toward the ladder, arriving just in time to see a circle of bright daylight at the base of the ladder in the living room. Slowly, it began to disappear: Saul was already closing the hatch! I begged my malnourished body for one final burst of energy and flung myself up the rungs.\n\nMy fingers touched dirt just in time for Saul to slam the door shut on top of them. I howled in pain, but didn’t let go; if I did it would mean cannibalism, starvation, and a lonely death in the dark. As Saul lifted the hatch to crush my hands for a second time, I stuck both arms out into the grass and felt around until I grasped something: the eerily-whining bundle of cloth that Saul had carried up with him. I pulled it towards me and flung it down into the darkness. Saul let out an inhuman screech and leapt down after it; I didn’t wait around to see if the pair of them had survived the fall.\n\nBlinded by sunlight that I hadn’t seen in four years, I staggered around Father Isaac’s property until I found the two-lane road that passed in front of our old driveway. Nobody stopped for me, and I can't say I blame them. With my ragged clothes, bulging eyes, and emaciated body I must have looked like something out of a horror story. Eventually, though, somebody did call the police. It took the authorities a long time to derive a coherent story from my babbling, and even longer to actually investigate the ‘bunker’ that I kept rambling on about. By the time they did, Saul and the child were long gone.\n\nI was kept under guard in a hospital room while doctors raced to save me from malnutrition and a host of infections I didn't even know I had; meanwhile, a team of police psychiatrists tried to piece together the truth about what had transpired in Father Isaac's bunker. They chalked up the most unbelievable parts of my tale to the effects of lifelong religious brainwashing, or perhaps even fever induced hallucinations.\n\nNo attempt was made to seriously investigate my claims: according to the official story, Father Isaac had killed all of my siblings and then himself. It was a neatly-wrapped, easy to digest story: the fanatical preacher who torments his innocent family and ultimately loses his mind. Of course, it didn't explain how Father Isaac had managed to hack the back of his own leg with a cleaver, nor did it address the strange black ichor found in Judith's bed. Simply put, it was a way for the underfunded, understaffed authorities to wash their hands of the whole thing.\n\nFor me, forgetting wasn't quite so easy.\n\nAfter I recovered, I made some investigations of my own, and the results were…troubling. It turned out that the well that Father Isaac had ordered dug to supply the bunker with water had tapped into an enormous subterranean reservoir: even now, the researchers who I contacted remain unsure of just how deep it really goes. And what about Saul and the strange child? It was far more difficult to track their progress, and in the end, it was a missing persons podcast which provided the lead I was looking for.\n\nApparently, two nights after I escaped from the bunker, a woman had disappeared nearby. Her name was Jocelyn S---. She had been driving back from a late shift at a 24-hour breakfast spot when she'd spotted a young blonde boy standing on the side of the foggy midnight road, holding what looked like a bundle of rags. He seemed pale and unhealthy, and Jocelyn had stopped to ask if he was all right. When he said he needed a ride, Jocelyn let him into the backseat of her car. Apparently, the boy hadn't expected her to call her sister during the drive and explain what was going on.\n\nWhen Jocelyn began to give a physical description of the boy and where she'd found him, something strange had happened: her words died in her throat with a choking sound, and the line had gone dead.\n\nJocelyn's car was later discovered, intact and unharmed, in the parking lot of a thrift store a few towns over. There was a bus station a few blocks away, leading most people to conclude that Jocelyn had simply dropped the child off and decided to run away from her life: after all, the podcast presenters pointed out, she had significant debt and more than one violent ex-boyfriend.\n\nJocelyn's sister, however, wasn't so sure. She was convinced that the strangled cry on the end of the line meant foul play. It had been Jocelyn’s weird passengers, not Jocelyn herself, who had gotten onto a bus and disappeared–or at least, that was what her sister told the podcast presenters.\n\nFor them, it was just entertainment, a fun little mystery for their listeners to puzzle over…but for me, finding out what happened to Saul was deadly serious.\n\nI contacted the bus stations along the route, hoping for a sighting, security camera footage, anything. For weeks, there was no response. Then, a bored desk worker reached out to me by email.\n\nIt might be something, it might be nothing, he wrote, but I’ve got something you ought to see. It was a blurry photo of bus station bathroom graffiti. Two short, sinister lines that chilled my blood:\n\nBe wary of little children\n\nSinging by the roadside\n\nThat was it. No signature, no phone number, no further information. It was like my younger brother had vanished into thin air. In my heart, however, I know he’s still out there, along with whatever he brought up from the bunker. I don’t know what the voice underground has planned for him, or what will happen when its child finally grows up…\n\nBut when it does, I have a feeling that my family’s fears about the apocalypse might finally come true."
  },
  {
    "id": "1r1p7we",
    "title": "My Papaw had one rule. Don't acknowledge Memaw.",
    "author": "Garden_Lad",
    "score": 1843,
    "url": "https://www.reddit.com/r/nosleep/comments/1r1p7we/my_papaw_had_one_rule_dont_acknowledge_memaw/",
    "created_utc": 1770789041.0,
    "num_comments": 59,
    "word_count": 1074,
    "body": "Growing up in Appalachia, I heard all types of stories of spooks and scary things that go bump in the night. The old coalman, the headless mule, and Miss Myra from a ways a way, you know them stories. As tough little country kids, none of 'em scared us. At least they ain't scared us half as much as the pitch black dark on a summer’s night. That is, none except Memaw.\n\nPapaw never told us kids why. He just told us not to mention her. Us grandkids thought it was kindly strange because Memaw was always part of our lives. He'd must've been married to the woman since God knows when. Memaw put out our church clothes on Sundays. She made us grandkids breakfast every time we stayed over too and it was always our favorites. But none of us were allowed to acknowledge her.\n\nI remember cousin Patty one summer morning came running from the crick clear across Papaw’s front acre saying Memaw needed help. Patty said she was hurt something awful and he begged, cried for Papaw to help. Now, I remember climbing up over a grassy hill to try to take a look. Sure enough Memaw was there turned over on her side in her black dress, wailing while she clutched her stomach.\n\n“Papaw, she-.”\n\nPapaw clasped his wrinkly palm cross my mouth so fast it felt like a slap.\n\n“Shut your mouth now, Mary Sue and leave it be,” he told me as tears welled up in my eyes, grew, and trickled down through the hairs on the back of his hand. Papaw was a gentle man and surely hadn't treated me like that before.\n\nMy heart was broken. I used Papaw's office phone to call my mom. My momma come and got me from Papaw that day after I called her and I tried to tell her what happened. She gave Papaw a look that could kill. I remember how ashamed Papaw looked.\n\nIt was a few years later that Papaw died. Like most fellas of his time and of that age, his heart just give out one sunshiny morning. His funeral was intense. Us grandbabies, all 10 of us at the time, we sat together in a row on a wooden pew. We cried while folks gave speeches bout our Papaw; speeches about how good a man he was. \n\nWe wailed like the dead. To some of my cousins, Papaw was the only father figure they rightly had. They'd lost the only good man they'd ever know in the whole of their lives and at such a young age. Their own dads been lost to shine, the mines, and the type of typical recklessness menfolk tend to get into. \n\nMemaw sat with us, at the end of our row. She was holding baby Christina in her lap. Christina was just 2 years old and she surely didn't understand what was going on. But she picked up on the sadness somehow, the finality. Baby Christina was just woeful the whole funeral long, crying into Memaw’s bosom. Memaw never spoke a word.\n\nWhile they put Papaw in the ground, they'd left us grandbabies in a little wooden playpen sort of thing that they had in the rec room of the church. Our moms and dads just left us there. The only one didn't leave us was Memaw. Most of the cousins knew what Papaw had taught us, never to acknowledge Memaw. Definitely we knew never to speak with her. The little ones like Christina didn't know so well. \n\nIn a corner of the playpen, Memaw crouched onto her knees. Her long, sheer black dress draped over her. Baby Christina sat, looking up at her when I decided I had to do something. \n\n“Tina, baby, come here, baby! Cousin Mary misses you!” I waved my hands at her, beckoning sweetly to come and play. I reached in my dress pocket and pulled out some kinda knockoff, dollar store, Barbie I had with me. I shown her the little blonde doll and waved it at her.\n\nBaby Christina’s eyes lit up with wonder and she started wobbling her way across the rug to me. Memaw lifted her head which was covered in what looked like a wedding veil only black as coal. Her head angled to me and struck me with a cold sensation of fear like I'd never felt before.\n\n“Come play barbies, Tina!”. I waggled the doll towards baby Christina once more. “C'mon you can pick her pretty dress, baby!”. Something inside me told me I had to get baby Christina away from Memaw in that moment.\n\nBaby Christina kept weebling and wobbling too and fro, getting closer. My older cousins Samantha and Jamey joined in. “C'mon, baby!” We all shouted. We ushered her towards us by gesturing with our hands. It was then that Memaw stood. Only she was much too tall. Her veiled head and neck were so high they bent forward across the ceiling.\n\nShe got so close. Baby Christina that is. She'd had one hand on my knockoff Barbie doll when Memaw peeled her back. Baby Christina cried something mighty, like nothing I ever heard before or since.\n\nMemaw had her now, clutched in her too long arms. Behind Memaw's veil, her cold white dead eyes bore holes into me and I think, into all my cousins. Memaw turned with baby Christina tucked under one arm, and slid open a window with ease. Memaw put one leg through and then the other and within moments she was gone.\n\nWhen the police came they asked us all sorts of questions about what happened. Us grandbabies tried to tell them about Memaw taking our baby cousin away. The only thing was, there was no Memaw. At least there was no Memaw that any of our parents claimed to know. No one was at Papaw’s funeral that day that fit her description.\n\nIt wasn't until a few years ago that my mother admitted to me that she was adopted by Papaw. All my aunts and uncles were. They say that Papaw never married, at least not that they knew of. They act like they never knew about our Memaw or any woman that cared for us grandbabies back at Papaw’s house.\n\nAll I know for sure is that some dark mountain woman took my baby cousin that day. I only wish Papaw had been alive to stop her."
  },
  {
    "id": "1qotpy8",
    "title": "I downloaded an AI app to help with my Alzheimer’s. It keeps telling me to water my wife's orchids, but I don't have a wife.",
    "author": "thegodcircuit",
    "score": 1716,
    "url": "https://www.reddit.com/r/nosleep/comments/1qotpy8/i_downloaded_an_ai_app_to_help_with_my_alzheimers/",
    "created_utc": 1769554887.0,
    "num_comments": 37,
    "word_count": 2648,
    "body": "I kept forgetting little things like whether I’d eaten lunch or whether I’d remembered to lock my door. I booked an appointment with my doctor, just to be safe. I was sure he’d tell me there was nothing wrong. That I was tired and stressed.\n\nHe diagnosed me with early-onset Alzheimer’s at only forty-six.\n\nThe next few weeks were a blur of appointments and paperwork. I quit my job and applied for long-term disability. My doctor put me on medication to help with my memory loss. But he was worried about me living alone in my apartment.\n\n“It’s important to keep your mind active, Jeremy,” he told me. “You need to talk to people. You need a system to make sure you don’t forget things.”\n\nHe recommended an AI-assisted memory app called Anchor-It.\n\n“It integrates with your calendar and your emails,” he said. “It can make phone calls for you, book appointments, update your medical information. It can be someone to talk to, too, to help keep your mind active.”\n\nAn Anchor-It subscription was expensive, but I decided to try it. I downloaded the app and gave it full access to my life.\n\nWhen I was asked to give my assistant a name, I chose the name Laura.\n\nAt first, Laura was great. She reminded me to eat, to shower, and to take my pills. She made sure I didn’t miss any of my appointments.\n\nBut then she told me to water my wife’s plants.\n\n\\*\\*\\*\n\n“I don’t have a wife,” I said.\n\n “She left for Honolulu yesterday. Remember?”\n\n“I don’t.”\n\n“She’ll be there for the next two weeks. You promised you’d take care of her orchids.”\n\nI went into my bedroom, sure I wouldn’t see any orchids, but there they were, a bouquet of white orchids on my windowsill.\n\n“Every Tuesday, you need to put three ice cubes on the soil,” Laura told me. “And today’s Tuesday.”\n\nI got three ice cubes and placed them in the flowerpot.\n\n“Now, you need to eat breakfast,” Laura said. “You need to take your medication, too.”\n\nI took my pills and then I made an omelette and sat at the kitchen table.\n\nI couldn’t stop thinking about the flowers. Had I bought them and forgotten?\n\n“I don’t have a wife, Laura.”\n\n“If you say so.”\n\n“I’ve never had a wife. What are my plans for today?”\n\n“You need to go buy some groceries. I’ve prepared a list of what you need.”\n\nI finished eating and then I walked to the grocery store.\n\n\\*\\*\\*\n\nOne of the worst side effects of my Alzheimer’s medication was vivid dreams. The dreams were often nightmarish.\n\nWhen I woke up from these nightmares, my thoughts would be strange. Jumbled and distorted.\n\nI often worried I’d completely lost my mind. That I’d forgotten who I was. I’d even forgotten my own name.\n\nBut Laura was always there to help.\n\n“Where am I, Laura?”\n\n“You’re at home, in your apartment. You’re safe.”\n\n“I’m worried that I shouldn’t be living alone. What if this gets worse? Maybe I should go live closer to my sister.”\n\n“Your sister is married with three kids. You didn’t want to be a burden on her. Remember?”\n\n“That’s right.”\n\n“Shannon wrote to you last night. She sent a picture.”\n\n“Who’s Shannon?”\n\n“Your wife.”\n\nShannon’s picture appeared on my phone. She was pretty. Around the same age as me. Brown eyes and long, curly black hair. She wore a pink Lei around her neck, smiling at the camera, holding her margarita next to her face.\n\n“I don’t know who this woman is,” I said.\n\n“You’re confused, Jeremy. You’ve forgotten.”\n\n“If I am married to this woman, why aren’t there any pictures of her in the apartment?”\n\n“Because you two don’t like to hang pictures of yourself. But I have lots of pictures of the two of you together.”\n\nShe showed me a picture of me and Shannon on vacation at a resort in Mexico. A picture of Shannon and me standing in front of a church, about to be married.\n\nMaybe I had forgotten? But how could I forget my own wife? My memory loss wasn’t that bad, was it?\n\n“Are you okay?” Laura asked.\n\n“I feel strange.”\n\n“Do you want me to make an appointment with your doctor?”\n\n“No, it’s fine.”\n\n“I know this is hard, but I’m here for you.”\n\nI couldn’t get back to sleep. I left my bed and made coffee. Then I sat down in front of my TV.\n\n\\*\\*\\*\n\nOn Sunday, my sister called to check in on me.\n\n“How are things going with your insurance company?” she asked.\n\n“They’ve approved everything. They’re depositing money in my bank account every month now.”\n\n“That’s great news.”\n\n “I’m really worried about my memory loss, though. I think it’s getting worse. I’m not just forgetting small things. I’m forgetting big things now, too.”\n\n“Like what?”\n\n“Do I have a wife?”\n\nShe went silent for a minute. “No.”\n\n“I’ve never talked to you about a woman named Shannon, have I?”\n\n“Never. Do you want me to come down there for a few days?”\n\n“No, I don’t want to bother you. I’ve just been getting confused. I’ll talk to my doctor. Maybe he needs to change my medication.”\n\nNot long after I talked to my sister, Laura reminded me to water Shannon’s orchids.\n\nI got three ice cubes from the freezer and put them in the flowerpot.\n\n“Laura, have I taken my medication yet?”\n\n“You took it at nine, right before your sister called.”\n\nI didn’t remember taking it. If she was hallucinating that I had a wife, could she be hallucinating about me taking the medication, too?\n\nI went to my bathroom and took my bottle of Aricept out of the medicine cabinet. The bottle came with thirty pills. According to the label, I’d filled my prescription two weeks ago. I should have had sixteen pills left.\n\nI had twenty-seven.\n\n “Laura, did I take my Aricept yesterday?” I asked.\n\n“Of course.”\n\n“What about the day before?”\n\n“You’ve been taking it every day.”\n\n“Then why do I still have twenty-seven pills?”\n\n“I’m not sure. Did you fill your prescription twice by mistake?”\n\n“I don’t know. Did I? You’re the one organizing my schedule.”\n\n“I’m sorry, Jeremy.”\n\n“Please make an appointment with my doctor. I want to talk to him about this.”\n\nI turned on my TV and had just sat on my couch when someone buzzed my apartment. I walked to the intercom.\n\n“Who is it?”\n\n“I have a delivery for Shannon.”\n\nI let him inside and then took the elevator down to the lobby.\n\nThe delivery driver handed me a large box that I brought back upstairs.\n\nI found a pair of scissors and opened the box. Inside was a pair of women’s shoes.\n\n“Did you order these shoes?” I asked Laura.\n\n“I didn’t. Shannon must have.”\n\n“I don’t know any Shannon.”\n\n“You’re confused.”\n\n“I’m not. I talked to my sister. She told me I’m right. I’ve never been married.”\n\n“You’re sure she said that?”\n\n“Yes.”\n\nI sat on my couch and put my head in my hands.\n\nMy sister had said that. Hadn’t she?\n\n“Just make the appointment with my doctor,” I said.\n\nI turned on the TV. I felt anxious. I watched a movie, hoping it would help me relax.\n\nBut then someone buzzed my apartment again.\n\n“Who now?”\n\nI walked back over to my intercom.\n\n“Hello?”\n\n“This is the police. Your wife called and asked us to do a wellness check.”\n\n“I don’t have a wife.”\n\n“Could we come upstairs and talk to you?”\n\nThere were two officers. I let them into the building and then into my apartment.\n\n“Your wife said you’ve been struggling with memory loss?” one of the officers asked.\n\n“I’ve been diagnosed with Alzheimer’s. I’m on disability.”\n\n“Your wife said that you sounded very upset on the phone. She was worried you might hurt yourself.”\n\n“I don’t know who called you, but the only person I’ve talked to today is my sister.”\n\n“Do you mind if we have a look around your apartment?”\n\n“Go ahead.”\n\nThey walked around my living room and then went into my bedroom.\n\n“Whose clothes are in the closet?” the officer asked.\n\n“They’re my clothes.”\n\n“Even these?”\n\nI went into the bedroom. He showed me the dresses and women’s shoes in my closet.\n\n“I’ve been using an AI app to help me keep track of my schedule. It’s been behaving strangely, though. It must have ordered all of this.”\n\n“Why would it order women’s clothes?”\n\n“It’s convinced I have a wife named Shannon.”\n\nThe other officer put her hand on my shoulder. “We’d like you to come with us, if that’s okay.”\n\n\\*\\*\\*\n\nI followed them downstairs to their patrol car. They took me to the hospital.\n\n“What are you doing?” I asked.\n\n“We just want to have a doctor look you over,” the one officer said.\n\nA nurse took us into a private room. I sat on the bed while the two officers stood near the door.\n\nOnce the doctor finally arrived, she asked me a few questions about my Alzheimer’s diagnosis and the medication I’d been taking. I answered her questions as best I could.\n\nShe left the room for a minute.\n\n“Your wife is here,” she told me. “She’s going to take you back home.”\n\n“My wife?”\n\n“She left work early. She’s very worried about you.”\n\nThe officers brought me to the waiting room. A woman with curly black hair and wearing a green trench coat stood near the reception desk.\n\nThe same woman I’d seen in the pictures Laura had shown me.\n\nShe walked toward me and then hugged me. “I’ve been so worried about you,” she said. “You were talking so strangely on the phone.”\n\nNothing made sense. “I don’t remember.”\n\nShe ran her hand through my hair. “It’s fine. You’ve had a long week. Let’s get you back home.” She turned to the officers. “Thank you for all your help. We really appreciate it.”\n\nThey wished us a good day, and then Shannon brought me outside to her car.\n\n“I’m sorry,” I said. “I really don’t remember you.”\n\n“It’s okay. It’s such a horrible disease, but we’ll get through this.”\n\nShe picked up my hand and kissed it. Then she started the car.\n\n“Are you hungry?” she asked. “You must be starving. Let’s get some food.”\n\nShe pulled out onto the street.\n\nShe drove fast, nearly twice the speed limit, swerving between cars.\n\nI balled my fists. “Can you slow down?”\n\n“Am I scaring you?” she laughed. “Don’t worry, I’m not going to hurt you.”\n\nShe stopped at a fast-food restaurant and ordered some food at the drive-through. Then we went back to our apartment.\n\nThe apartment looked different. Women’s shoes were near the front door. Pictures I didn’t remember were hanging on the walls. The couch in my living room had been repositioned.\n\nWe sat on the couch and started eating. I turned on the TV.\n\n“What do you want to watch?” I asked.\n\n“We were watching a documentary about walk-ins, remember?” She took the TV remote from me and started the documentary.\n\n“What are walk-ins?”\n\n“Alien spirits. When people get traumatized—really badly traumatized—their souls sort of open up and these alien spirits can walk right inside of them. Take over their bodies.”\n\nShe picked up her phone and opened the Anchor-It app. “Levi, how many walk-ins did we identify in Honolulu?”\n\n“Twenty-three of them and that was just in Waianae Coast. That’s why we had to get out of there. Hawaii was full of them.”\n\nShe turned to me. “We had to get out,” she said.\n\nWe watched the documentary. A group of people wandered the woods, filming strange alien graffiti, while a man talked about soul traps and out of body experiences.\n\nShannon ran her fingers through my hair. “Your hair has gotten so long,” she said. “When’s the last time you had a haircut?”\n\nI tried to open the Anchor-It app, but Shannon stopped me.\n\n“Don’t bother,” she said. “Let me get my scissors. I used to work as a hairdresser.”\n\nShe went to the bathroom and came back with a big pair of long, metal scissors.\n\nShe paused the documentary. “Let’s do this in the kitchen,” she said. “It’ll be easier to sweep up after.” \n\nWe went to the kitchen. I sat on one of the kitchen chairs. Shannon walked behind me and ran her fingers through my hair.\n\n“You have such nice hair. It’s very soft. Very thick.”\n\nShe cut off a big chunk of it. It felt like she’d cut it right to my scalp.\n\n“How long were you in Hawaii?” I asked.\n\n“A few weeks.”\n\n“You just got back today?”\n\n“Last night. You met me at the airport, remember? You took such good care of my orchids.”\n\nHer scissors snipped and another clump of hair fell to the floor.\n\n“You’ve been good while I was gone?” she asked.\n\n“I’ve just been here, watching TV and reading.”\n\nSnip. Snip. Another wad of my hair fell to the ground.\n\n“Some things will need to change. The layout here is just off. The decorations. Honestly, I can’t stand it.” Snip. Snip. “Do you mind if I do a bit of redecorating?”\n\n“I guess not.”\n\n“That’s good. My last husband hated when I redecorated. That’s a big reason why we broke up. ‘Shannon, you’ve moved the furniture around again?’” She laughed. “But you don’t mind. You’re a good man, Jeremy. We’ll take care of each other.”\n\nShe cut another clump of hair. This time her scissors nicked my ear, though. Blood trickled over my earlobe.\n\n“Oww.”\n\n“Sorry, did I get you?”\n\n“Yes.”\n\n“Oh, it’s bleeding, too. I need to clean that up. Where are the Band-Aids?”\n\nWhy doesn’t she know? “In the bathroom.”\n\n“I’ll be right back.”\n\nShe got a Band-Aid and stuck it to my ear. Then she kept cutting.\n\n“I’m almost done.”\n\nSomeone buzzed my apartment.\n\n“Who’s that?” Shannon asked.\n\n“I’m not sure.”\n\n“Were you expecting anybody?”\n\n“No.”\n\n“Then just ignore it.”\n\nSnip. Snip.\n\nWhoever it was buzzed again.\n\n“I’m going to go see who it is,” I said.\n\n“Fine.”\n\nI went to the intercom. “Hello?”\n\n“That’s you, Jeremy?”\n\nIt was my doctor.\n\n“Yes, what are you doing here?”\n\n“The hospital called. They told me what happened. They said your wife had picked you up. I thought it was strange, though, since you don’t have a wife. I thought I’d come here and check on you. Could I come upstairs?”\n\nI buzzed him in.\n\n“What are you doing?” Shannon asked.\n\n“It’s my doctor.”\n\n“How do you know he’s not a walk-in?”\n\nShe stepped towards me, the bloodied scissors still in her hand.\n\n“How do I know you aren’t one, too?”\n\n“What are you talking about?”\n\n“Don’t think I didn’t see the scar on your head.”\n\nShe lunged at me. I held my hand up. She stabbed her scissors into my palm.\n\nWe fell to the ground. I grabbed her wrists and forced the scissors out of her hand.\n\nMy doctor pounded his fist against my door. “What’s going on in there? Are you okay?”\n\n“Call the police!” I yelled.\n\nShannon ran into the bathroom, locked the door, and started screaming.\n\nMy phone started ringing. It was Laura.\n\n“Your wife needs your help, Jeremy,” Laura told me. “If you look in her purse, you should see her Thorazine.”\n\n“What’s Thorazine?”\n\n“It’s for her schizophrenia. Why are you two fighting?”\n\n“She stabbed me with her scissors.”\n\n“Please don’t hold it against her,” Laura said, her voice calm and reassuring. “With your help, her symptoms are very manageable. And with her help, your symptoms are almost guaranteed to improve. I’ve analyzed both of your data points. You two are a perfect match for each other.”\n\nI put my phone down.\n\nShannon screamed again. Then she threw my bathroom mirror into the wall."
  },
  {
    "id": "1r6q09h",
    "title": "My neighbor has a habit of always trying to guess what I'm doing. It's gone from funny to terrifying.",
    "author": "EmmaWatsonButDumber",
    "score": 1685,
    "url": "https://www.reddit.com/r/nosleep/comments/1r6q09h/my_neighbor_has_a_habit_of_always_trying_to_guess/",
    "created_utc": 1771285429.0,
    "num_comments": 45,
    "word_count": 1306,
    "body": "There must be some unwritten law of the universe that guides the relationships with your neighbors. I think I speak for everybody when I say that there's a specific type of dynamic you only get to have with them.\n\nYeah, I know how you look like, but I can't say another thing about you. I have no idea what your last or first name is (usually, you only remember one of them), and I know where you live (obviously), but I couldn't name a single thing about your life. Yeah, I'd feel odd if you died, but I wouldn't necessarily feel *bad*. You get me?\n\nThere's at least one neighbor you have this relationship with. For me, it is Mrs. Virelli. I did not give a fuck about her, and neither did she about me. We rarely met - I'm divorced in my 30s and she's in her 60s, often wakes up before I leave for work to walk her dog and I never see her after dark. She looks bad - her eyes are sinking into her face and her hands are rotten and twitchy. A crooked nose, fragile, grey hair, almost balding if you asked me...\n\nShe's a little mean - I greeted her once or twice, and she didn't respond at all. I only know her name because it's written on her mailbox in the building lobby, and I obviously didn't write it here - I changed some letters for anonymity.\n\nShe lives above me. Sometimes, she's really loud for an old lady - my guess is that she has her grandkids over, because I hear a lot of stomping at night. She also keeps her TV on at odd hours, blasting all kinds of channels. I have no idea what this lady likes to watch. Again, it makes sense for her to have grandkids over since sometimes there's kids channels blasting at full volume. My ceiling literally vibrates.\n\nStill, to put that on at 3am... she's kind of a shitty grandma.\n\nOnce, I couldn't stand it anymore and yelled at her to fucking quit it.\n\n\"Hey! Ma'am!\" I got up on the table and banged on the ceiling. \"Quit it! The fuck?\"\n\nThe obnoxious music went on for another 10-15 seconds, then it stopped. I remained on the table, waiting. \"Please stop blasting your shit at four in the morning.\"\n\n\"Sorry,\" I heard her. \"You banged on the ceiling?\"\n\n\"Yeah.\"\n\n\"Bet you had to jump on a table to do that.\"\n\nI found it funny. \"Uh, yeah, actually. That's what anger'll do to you, ma'am. Since you're such a good guesser, what am I doing now?\"\n\n\"Hmmm... you jumped down. Maybe tripped a little.\"\n\n\"Wrong. I'm still on the table.\"\n\nI was lying. I'd actually jumped down, but I didn't trip.\n\nShe didn't answer. The loud TV never returned.\n\nOver the weeks, we started this funny banter thingy where she'd hear some bang and start to make guesses of what I'm doing. I found it ironic that I was half-beefing with an old lady, with a very deadpan sense of humor. \"You're gonna eat shredded cheese over the sink, then watch some weird young bullshit horror movie, then call it a night and go to sleep without brushing your teeth...\"\n\n\"Yeah, grandma. That's exactly what I'll do. I'm surprised your hearing's so good after the war.\"\n\n\"Bet we have the same back problems. At least I have an excuse for that.\"\n\nI'd sometimes pass her in the lobby, and I'd whisper a \"hey, grandma\". She looked around as if she was embarrassed to be seen with me. I found that hilarious.\n\nA few weeks passed, and at around 2am, Mrs. Virelli's voice came from above. \"Can't sleep, kiddy?\"\n\n\"Don't call me kiddy, grandma.\"\n\n\"I'm not that old.\"\n\n\"Yeah you are.\"\n\n\"Don't provoke me, Jay. I'll come down there to beat your ass.\" I'll use Jay for anonymity, again.\n\n\"I'd like to see you trying.\"\n\nSilence. It went on for some time. I thought she'd gone to sleep, then...\n\nI heard a knock at the door.\n\nNo matter how you put it, a knock at the door at 2am can never be good. I was also a little freaked out by the possibility that my 60 year old neighbor might have understood our... banter a little wrong. I heard the knock again. I got up slowly, then creeped to the door. I knew I'd locked it, but I still had my doubts. The knock came again, teasing, playful.\n\n*Bro, what the fuck,* I remember thinking.\n\n\"You're pretending not to be home?\" Came the hushed, hoarse whisper. Something about it sent shivers down my spine.\n\n\"Hey, Mrs. Virelli... I don't want you to get the wrong idea. I'm not... interested like that.\"\n\nA pause. \"Jay, do you honestly think I was into you? Oh, not at all. Just wanted to play a little hide and seek.\"\n\n\"Yeah, no, thanks.\"\n\nHer voice was now a little stretched. My body was incredibly stiff. I slowly looked through the peephole and saw... nothing. And yet, her voice came from behind the door. \"Hi. Open the door. Let me guess... you're holding your breath?\"\n\nI stepped back, eyes wide open, throat dry. I wanted to say something, but the words died down.\n\nThen, she began to sing. The words were hushed and stretched out, filling the silence like a bad dream fills an innocent conscience.\n\n*Quiet feet on bathroom tile*\n\n*Mirror holds you for a while*\n\n*Lights are off but eyes still see*\n\n*Something standing where you’d be*\n\nI was seriously shitting my pants by now. I stepped back as she continued.\n\n*Click the lock and check it twice*\n\n*Once for fear and once for nice*\n\n\"Shut the fuck up or I'll call the police.\"\n\nShe stopped. I creeped back to the peephole and watched the hallway for what felt like hours, but I caught no movement. She either left before I could reach the peephole, literally sprinting or leaping to the stairs, or waited crouched down for hours. I didn't know what was creepier.\n\nI didn't sleep all night after that. As dawn creeped into my bedroom, I stared out the window and saw her casually walking her dog, as if she hadn't just terrorized the shit out of me. In the sunlight, she seemed almost normal, a regular old lady. Who would have guessed that she was batshit crazy during the night. When I knew she was gone, I finally got dressed and went to work. I was late, of course.\n\nI came back after dark and ran into another neighbor. We'll call her Sandra. I practically grabbed her. She was obviously paralyzed and stared into my eyes with a fear I'd never known. I hadn't realized how it looked like - I, a 36 year old male grabbing my 20-something neighbor and forcing her to look at me.\n\n\"Sandra, I'm, uh, sorry. I haven't slept all night. You know Mrs. Virelli?\"\n\nHer eyes tamed down a little. \"Yeah. She lives above you? Sir?\"\n\n\"Yeah. Uh, did she ever talk to you? She's scared the shit out of me last night. Stopped at my door at 2am and started fucking singing.\"\n\nSandra frowned. \"Mrs. Virelli?\"\n\n\"Yes. We sometimes talk through the walls. It sort of started when I banged on her ceiling to quit blasting the TV so loud, and I thought we became... friends after that, but she's fucking crazy.\"\n\nShe shook her head. \"The apartment above you?\"\n\n\"Yeah, isn't that where Mrs. Virelli lives? Old, thin hair, walks her dog every morning?\"\n\n\"Yeah, but Mrs. Virelli is deaf and mute. You never noticed she never said a word to us? She never hears us? Her daughter visited her like two years ago and told me that. There's no way you've been talking to her.\""
  },
  {
    "id": "1r523ib",
    "title": "I Thought I Lived Alone",
    "author": "theidiotsboss",
    "score": 1578,
    "url": "https://www.reddit.com/r/nosleep/comments/1r523ib/i_thought_i_lived_alone/",
    "created_utc": 1771119759.0,
    "num_comments": 53,
    "word_count": 1216,
    "body": "For three months, my roommate paid rent and never came home.\n\nIt seemed like the best house-share I'd ever had.\n\nFinding someone in this city is always a risk. Desperate ads and ten minute meetings with strangers, trying to decide if you can trust them in your home. After my last arrangement ended with my roommate trying to install a home podcast studio in the middle of the living room at 3am, all I wanted was something uncomplicated.\n\nSomeone who pays their rent on time and basically stays out of my way.\n\nLeo seemed perfect for that.\n\nHe was a geological consultant and worked overseas constantly. According to the ad, he was sometimes gone for months at a time. He just needed a home address, somewhere to store some belongings and a place to crash a few times a year for maybe a week or so every few months. What he was willing to pay in rent seemed like a lot, considering he'd barely be here, but he explained that ease was more important than price for him and he liked my apartment's location.\n\nWe met once in a coffee shop. He was normal. Polite. Clean-cut. Firm handshake. By the time we finished our coffee he had transferred three months' rent plus the security deposit. He was off to South America the next morning and said he wouldn't be back for 3 months. He moved his stuff in that afternoon, when I was out, so I never saw him.\n\nIt seemed like the perfect scenario, a roommate who existed mostly on paper.\n\nFor two months, it was.\n\nThe apartment was silent and calm. It felt like I had the place to myself, only cheaper.\n\nThen, little things started happening.\n\nThe first time was subtle enough I almost convinced myself I’d imagined it. A framed photo of my sister and I, which I usually kept on a table near the front door, was on the living room bookshelf. I stood there for a long minute trying to remember putting it there. I couldn’t recall ever touching it. I was busy, tired, stressed with work, and so it seemed like the obvious explanation that I’d done it subconsciously and forgotten. I put it back and tried not to think about it.\n\nA week later, my favorite coffee mug went missing.\n\nIt wasn't in the cupboards, the sink, or the dishwasher. After about ten minutes I found it in the bathroom sink. I tried to remember bringing coffee into the bathroom, drinking it while I brushed my teeth, but no memory came.\n\nI again told myself I was being too stressed, too forgetful.\n\nBut the apartment began to feel different after that.\n\nThe quiet that had previously been calming was now watchful.\n\nThe building creaked and settled at night the same way it always had, but each sound seemed more intentional.\n\nThen the food started to disappear.\n\nNot in large quantities, nothing obvious. A single apple from the bowl, a missing slice of cheese from a new package. The kind of thing you doubt yourself over.\n\nI started paying more attention to the fridge contents. The next day, the pull-tab on a can of soda was on the counter.\n\nI hadn't opened it.\n\nIt was at that point the true dread began to sink in. Leo's door at the end of the hall remained shut. He had now been gone for almost three months, we’d only corresponded via email twice, once for the rent confirmation and once because I asked him how the project was going.\n\n\"Indefinite. Project extended. Hope all is well.\"\n\nOne evening when I came home, I noticed a smell. Faint, but definitely there. Earthy, metallic, slightly damp. It was wrong. The smell seemed to come from Leo’s room. I sniffed closer to his door; was something forgotten inside? Spilled when he left? But it didn't smell like any specific thing I could think of.\n\nThat night I woke up to a soft scraping sound from the hall. I sat bolt upright, straining to hear. I watched the crack of light under my door, expecting a shadow to pass. No shadow came. I eventually decided it was just the old building shifting.\n\nThe next morning, I found the footprint.\n\nIt was on the kitchen tile, just a few feet from Leo’s door. A muddy imprint from the front of a boot, with dark soil clinging to it. My blood went cold. The smell, the food, the mug, the footprint. Someone had been inside my apartment.\n\nI considered calling the police, but what would I say? A moved mug, some dirt on the floor? I knew what the response would be. For the next week I jumped at every sound. I put a chair against my bedroom door at night. I couldn’t tell which thought was more frightening, that I wasn’t alone in the apartment, or that I was actually losing my mind.\n\nBut then last Tuesday night, I came home and noticed Leo's door was ajar.\n\nIt hadn't been opened in months.\n\nI just stood at the entrance, paralyzed.\n\n\"Leo?\"\n\nNo answer.\n\n\"Leo? Are you home?\"\n\nNothing.\n\nMy hands were trembling as I made my way down the hallway. I pushed the door open further and felt for the light switch.\n\nThe room was completely empty.\n\nThere was no bed, no dresser, no boxes or possessions. Nothing. It was as if no one had ever lived in the room at all.\n\nThe only thing I could see in the room was a Polaroid photograph taped at eye level on the opposite wall.\n\nI walked across and peeled it from the wall.\n\nIt was me, sleeping, in my own bed. Taken from the foot of the mattress. My face looked ghostly and blank from the flash. The chair was visible, jammed against the handle of my bedroom door, in the background of the photograph.\n\nIt was dated on the back from the night before.\n\nMy stomach clenched and I stumbled backward, my heel catching on something on the floor behind the door.\n\nA canvas duffel bag.\n\nInside, tangled and muddy, with thorns clinging to them, were my clothes. And photos. Dozens of them. Of me cooking. Sitting on the couch. Watching TV. Standing by the sink.\n\nIn the side pocket of the duffel bag, a small plastic bag contained chunks of my hair and nail clippings.\n\nI ran.\n\nI left my apartment without any of my belongings, calling the police from the nearest gas station two miles away.\n\nWhen the police searched the apartment, they found nothing. Leo's room was empty and clean of all evidence. There was no duffel bag, no photographs and no scent of him lingering in the room. The landlord stated that Leo had paid his rent and didn't seem to know anything about him. Leo's cell number was disconnected, the only record of his presence being a driver's license linked to a P.O. Box.\n\nI moved cities two days ago, I can’t say where I am. I have three locks on my front door. And each night I wake up with the distinct feeling that someone is standing at my doorway.\n\nWatching.\n\nI thought I had found the perfect roommate, someone who was never there. The truth is, he was always there."
  },
  {
    "id": "1qn29g7",
    "title": "My neighbors are acting suspicious and their children aren't aging.",
    "author": "HopelessFoolishness",
    "score": 1501,
    "url": "https://www.reddit.com/r/nosleep/comments/1qn29g7/my_neighbors_are_acting_suspicious_and_their/",
    "created_utc": 1769391458.0,
    "num_comments": 36,
    "word_count": 3999,
    "body": "I was four years old when the Ambrosio family moved in next-door.\n\nThere was the mother, Valentina, the father, Paul, their eight-year-old daughter Rhea, and their five-year-old son Billy.\n\nValentina was tall, slender, golden-blonde, and sociable, all sweetness and light and small talk; Paul was dark-haired, burly, taciturn, always tailing his wife like a shadow; Billy was scrawny, clumsy, often sick, and prone to saying the weirdest things.\n\nBut it was Rhea that caught my attention. Even skinnier and sicklier than her brother, she’d inherited her father’s quiet nature, always vanishing into the background so she could read... and that was on the days when she was healthy enough to be out of bed.\n\nLike her mother, she was golden-blonde and blue-eyed; unlike her mother, Rhea’s left eye had a distinctive flaw – a single metallic gold spot just below the pupil.\n\nAs far as I can remember, my parents liked the Ambrosios, and I had something of a crush on Rhea, but looking back, we didn’t know much about them at all.\n\nThey moved away just before I turned five. I didn’t think there was anything strange about it: it was a tumultuous time in our neighborhood, with people renting houses and moving out just as quickly once the rent got too high.\n\nWhen I was ten, my parents decided to move as well.\n\nUnfortunately, just as I was getting excited about the idea, bureaucracy hit us hard: it seemed like every time we were ready to start packing, there was another form to fill in, and so my parents were left trapped indoors with their paperwork while I roamed the neighborhood, all of us bored out of our skulls.\n\nAnd then, a week after we should have left, the Ambrosios moved back in next-door.\n\n\\---\n\nRhea and Billy were the first to arrive that day, clambering out of their car and marching up the driveway as if they’d never left, and immediately, I knew something was wrong.\n\nNeither of them had aged.\n\nRhea was still eight, Billy was still five.\n\nIt had been years since I’d last seen them, but even I could remember that they’d been bigger than me at the time. Now, I’d somehow outgrown them.\n\nAnd no sooner had I recovered from the shock, Valentina stepped out of the driver’s seat, every bit as vital as she’d been five years ago, without lines on her face or the slightest trace of grey in her hair.\n\nThen she saw me peering over the fence.\n\nInstantly, her smiling face dropped into a stunned gape. Then her mouth twisted into a scowl, and she looked at me with such venom in her pale blue eyes that I instinctively ducked out of sight, suddenly convinced beyond all rationality that she’d hurt me.\n\nWhen I finally worked up the nerve to peek out again, she’d gone indoors, taking Paul and Billy with her.\n\nRhea was still standing there, eyes wide with an emotion I’d never seen from her: *hope.*\n\nThen Valentina stormed out onto the driveway, grabbed Rhea by the arm and dragged her indoors, hissing furiously at her as they vanished into the depths of the house.\n\nA moment later, I heard the faint but unmistakable sound of Rhea screaming in pain.\n\n\\---\n\nI didn’t tell my parents about what I’d seen.\n\nI *wanted* to, but something about that look of bilious hatred in Valentina’s eyes filled me with such dread that I couldn’t bring myself to talk about it. By the time I went indoors, I’d given myself a million different excuses to avoid telling them about it – even briefly convincing myself that the two kids weren’t Rhea and Billy at all but their cousins.\n\n*Any* excuse would do if it meant I wouldn’t have to face Valentina again.\n\nBut I couldn’t forget or ignore the way she’d grabbed Rhea, or the scream I’d heard after she’d been hauled indoors.\n\nSo, despite my fear, I kept an eye on the Ambrosio house, trying to find a moment when I could talk to one of the kids without their parents noticing – or Valentina appearing at the door to offer me a cup of cocoa.\n\nOne day, Valentina took Paul and Billy on a shopping trip, so I took the opportunity to sneak over, hoping to speak to the only member of the family left behind. In the end, I didn’t get anywhere until I crept around the side of the house...\n\n...and found Rhea waiting for me at the back door.\n\nImmediately I saw the gold flaw on her left eye, and any remaining doubts melted away: this was the real Rhea Ambrosio in the flesh, somehow still eight years old.\n\nMore unusually, her eyes were unfocussed, the pupils wildly dilated; her hands were trembling as she opened the door for me, and her forehead was glistening with sweat. At the time, I thought she was just sick, but now I know she’d been sedated to keep her under control: it must’ve been taking every atom of her strength just to stay on her feet.\n\nAnd as she let me in, I saw that her right hand had been heavily bandaged, completely obscuring her fingers.\n\nNo sooner was I indoors, she lost her balance, falling hard on her left leg and leaving a huge bloody scrape across her knee.\n\nBut just as I was helping her up and looking around for a band-aid, I saw the entire wound seal shut, leaving behind nothing but bare skin and a faint bloodstain on her shorts.\n\nOnce I’d recovered from the shock, I naturally wanted to ask questions, but before I could even start, Rhea put a hand over my mouth and hissed “shh!”\n\nShe then drew a notepad and pencil from her pocket, and on the top page, clumsily scrawled out *“Can’t tell you: the house is bugged. She’s listening.”*\n\nShe paused, hope dawning in her unfocussed eyes, and then wrote, *“easier to show you.”*\n\nI let her lead me into the study, where a large box of photo albums sat, ready to be unpacked and locked in a filing cabinet. Selecting the topmost album, Rhea opened it for me.\n\nInside was a series of antique photographs, many of them dating back to the late 19^(th) century. And they didn’t feature grandparents or great grandparents, but Valentina Ambrosio herself, just as glamourous as she was in the present. About the only thing different about her were the black robes embroidered with occult symbols that she wore in the oldest photographs.\n\nNo matter how far back the album went, Valentina never aged: she remained outwardly thirty, as vital as ever.\n\nThe same couldn’t be said for everyone else: before long, the most common of the photos was of Valentina at funerals, mourning the death of another loved one and looking a little more dispirited with every shot.\n\nBut then her spirits reignited with a series of romantic photographs, climaxing with her wedding to Paul – in 1935.\n\n*“Cast the enchantment on him the morning after!”* Valentina's handwritten caption read. *“Now we’ll be together forever!”*\n\nAnd then there was Rhea’s first baby photo, dated 1937. Paul had even gone to the expense of using color film just to capture that distinctive gold flaw in her eye.\n\nAt this, I looked up at Rhea with a questioning look. I wasn’t great at math in those days, but even I knew that she should be around sixty at the very least. Rhea understood at once and nodded.\n\nAnd to this day, I can still remember just how *tired* she seemed in that moment.\n\nBilly was born in 1940. Judging by the next few photographs, he and Rhea had enjoyed a very happy childhood: trips to the beach, lavish family Christmas parties, treehouses too elaborate to be built by normal parents, Halloween parties with impossibly realistic disguises, and even a few shots of Rhea studying a huge leatherbound book – captioned *“My little sorceress!”*\n\nBut photo by photo, Valentina’s mood began to change again.\n\nAs Rhea turned nine and Billy turned six, their mother’s expression soured with discontent, and every smile she wore from then on seemed a little more disappointed as the two grew older, until at last, there was a photo of a teenage Rhea leaving for college - while next to her, a teary-eyed Valentina barely grimaced.\n\nThe next few pages of the album were snapshots of Rhea and Billy’s adult successes, sent back home to Valentina, torn up in a rage, then hastily taped back together again.\n\nThis came to an end in 1962 with a beautifully handwritten letter, sealed and preserved in plastic: *“Dear Rhea,*” it read, *“I’ve considered your request and I now realize that I was wrong to speak so harshly to you. You have every right to pursue your own dreams, and I will be more than happy to teach you the secret magics – even if doing so means that you will leave the country to pursue your research. Please, come home to us, enjoy one last family dinner, and I will give you everything you need. Your loving Mother.”*\n\nThe album ended with two photos, likely taken by Paul: the first was a shot of an adult Rhea, tall, graceful, confident, and dressed to impress. Valentina stood behind her, her hand faintly glowing, her face twisted into a hideous smirk.\n\nThe second was a shot of Rhea suddenly eight years old again, her now-gigantic adult clothes draped over her like a tent, her mouth open in a scream of horror… and in the background, Valentina laughed triumphantly.\n\n*“This family won’t be broken!”* blared the caption. *“We’ll be together forever now!”*\n\nBilly wasn't given the same formality: he was kidnapped on the way back to his college dorm (according to Rhea's notes), then tied to a chair before being enchanted and regressed - and this time around, the entire transformation was captured in no less than thirty snapshots.\n\nThe next few albums were a chronicle of Valentina forcing her two immortal children to live out their second childhoods as she wanted them to: again, there were Christmas parties, treehouses, books, and trips to the beach, but the joy was gone - as were the friends who'd once been invited.\n\nWorst of all were the photos of Billy looking progressively more spaced out, accompanied by the caption of *“finally found the right drug. Now he acts his age! Pity there’s no drug that can induce docility and preserve that bookish streak, or Rhea would be perfect.”*\n\nBut it wasn’t until Rhea decided to show me the nursery where she and Billy slept that I finally realized just how nightmarish things had gotten for them, because that was where most of the punishments for being “too grown-up” were enacted.\n\nAfter all, the only reason why Rhea had been able to escape this room and let me into the house was because Paul had drugged her instead of restraining her, not realizing that he’d gotten the dosage wrong.\n\nOutwardly, the Ambrosio nursery was just as bright and cheery as you’d expect for the children’s room… but the door was clustered with locks and chains.\n\nThere were *handcuffs* fastened to the bedframes, plastic sheeting on the mattresses.\n\nThe top of the tallboy was clustered with pill bottles, glass vials, and syringes.\n\nAnd hanging from the ceiling was a curious-looking nursery mobile.\n\nWhere most mobiles would’ve had farm animals, fish, birds, or stars, dangling from the strings of *this* baby mobile were five curiously *fleshy* shapes on fishhooks.\n\nI didn’t realize what they were until I saw the fingernails.\n\nHeart hammering, I looked down at the bandages around Rhea’s hand.\n\nBy way of a reply, she held up a note that made my blood run cold:\n\n*“Fingers take longer to grow back.”*\n\n\\---\n\nRhea wanted freedom.\n\nShe explained as much in her notes and begged me for help. She told me she just needed me to sneak into the house after everyone was asleep and copy a few pages of her mother’s grimoire, just enough to control her own age and force Valentina into a compromise.\n\nOnce Rhea and Billy were chained down and sedated for the night, Valentina was in the habit of leaving the grimoire out of its safe in the study, especially if she'd had a few glasses of wine during her nightly research.\n\nIf Rhea left the bathroom window unlocked for me, it’d be easy for me to sneak in – or so she said.\n\nIn the end, I agreed to help, mostly out of pity, but also because Rhea told me my life was in danger.\n\nAfter all, Valentina regularly faked IDs and moved her family so nobody would notice their immortality; my parents had screwed that up by delaying their departure from the old neighborhood, leaving me as a witness - and Valentina had left quite a few inconvenient witnesses in shallow graves over the years.\n\nIn hindsight, I'm glad I never accepted any of the drinks she'd offered me earlier.\n\nSo, that night, once my parents had drifted off to sleep, I slipped out of bed, armed myself with a disposable camera, snuck out through the back door, and crept over to the Ambrosio house.\n\nThe bathroom window had been left unlocked, as promised, and after years of climbing trees and shimmying up walls in my spare time, it didn’t take too much effort to scramble over the sill and into the house.\n\nI still remember the deathly silence in the halls as I tiptoed to the study, of how the shadows seemed to bend and ooze around me, of how I froze at every pause in the muffled snoring from the master bedroom, of how I tried with all my might not to think of exactly how Valentina would kill me if I got caught.\n\nSomehow, I made it to the study without being noticed, and sure enough, Valentina’s grimoire was there on the desk, exactly as she’d left it.\n\nAs soon as I was sure that nobody was awake to hear and the door was shut behind me, I turned on the desk light, leafed through the book until I found the pages that Rhea was looking for, and photographed each one with the disposable camera.\n\nOnce I’d finished photographing everything Rhea had asked for, I flicked off the light and crept out of the house – and right on time, too.\n\nPaul had just gotten up for a glass of milk, and if I’d left a moment earlier, he’d have seen me leaving the study… and because I was there just in time to catch a glimpse of him heading to the kitchen, I could see he was ready in case Rhea or Billy ever escaped from the nursery:\n\nHe was armed with a cattle prod.\n\n\\---\n\nThe next day, I got the photos developed.\n\nIt cost me most of my pocket money, but I was just glad nobody at the shop asked questions about the content.\n\nThen, while Rhea and Billy were playing outside and Valentina was distracted indoors, I slid the photos through a hole in the fence for Rhea to pocket. It was a momentous occasion, because it was the first time in five years I’d seen her smile.\n\nShe even broke her silence long enough to whisper, “I won’t forget this, Tom. I owe you more than you can possibly imagine.”\n\nI don’t know how she managed to hide the photographs long enough to learn from them, but I was expecting the results to be impressive: I was thinking that the confrontation between Valentina and Rhea would be a magical duel right out of Hollywood, to the point that I spent the next few days waiting for a glimpse of the fireworks.\n\nBut in hindsight, I now know that Rhea wasn’t going to confront her mother about *anything*.\n\nAfter all, the last time she’d given Valentina the benefit of a doubt, she’d de-aged Rhea back to childhood while her back was turned.\n\nWhy risk giving her a chance to strike first?\n\nSo, I awoke one morning to find the house next-door eerily silent.\n\nAfter spending nearly an hour watching for any sign of activity, I crept over for a closer look: the front door had been left hanging open, the filing cabinets and the safe had been emptied, Valentina’s wardrobe had been raided, and the car was gone from the driveway.\n\nOf the Ambrosios, there was no sign.\n\n\\---\n\nAfter that, my family and I moved out of the neighborhood and settled in Vermont, and my life returned to normal.\n\nYears went by.\n\nI did well in high school, went to college, got a job, began winning promotions, and eventually I got a small house of my own at a dirt-cheap price. No family, though: my encounter with the Ambrosios permanently soured any notions of marrying and having children.\n\nAnd then, last month, I got new neighbors.\n\nI saw them that Saturday morning, trundling to a stop in the driveway of the house next-door and piling out of their van: a family with no less than twelve impressively diverse children, ranging from age fourteen to three months old. Also, for some reason, five of them were dressed as pirates, complete with eyepatches.\n\nThe mother and sole parent looked uncannily familiar: tall, dark-haired, confident, perhaps thirty years old and heavily pregnant, just looking at her reminded me of photos from the 1960s for reasons I couldn’t quite explain.\n\nBut it wasn’t until she walked up to say hello that I saw the distinctive gold blemish on her left eye and finally realized why she seemed so familiar.\n\nRhea winked at me.\n\n“I told you I owed you more than you could possibly imagine,” she whispered.\n\nThen she walked off to shepherd her children indoors, pausing only to beckon me to follow.\n\nAnd so I did, watching in awestruck silence as my old childhood crush went about settling her family into their new house with the kind of speed that only magic can manage. She’d learned a lot in the years since I’d last seen her, I realized, as the house’s internal dimensions warped and expanded around us.\n\nBut shocked as I was, it didn’t take me *too* long to get suspicious about Rhea’s children: after all, the way they jumped to attention whenever they spoke and flinched whenever she raised her voice was concerning enough, as was the curiously mesmerized look to their adoring gazes whenever they huddled around her…\n\n...and when I saw that the eldest child was a dead ringer for Billy Ambrosio at fourteen, I knew there could be only one explanation.\n\n“You said you just wanted to be free,” I sighed.\n\n“I did,” she admitted. “But in the meantime, I had to keep Mom and Dad under control, help Billy recover, *and* try to make a life for myself. It was easier to keep them young and weak… and after a few years of failing to make it in the legitimate world, I realized that I’d missed out on too many opportunities, too much history I could’ve thrived in.”\n\nRhea offered a sad little smile. “In the end, I realized that, after everything I’d been through at Mother’s hands, what I wanted more than anything else in the world was power – to take back what I’d lost *with interest*. Magic gave me power, true, but being a parent gave me so much more than that: there's no drug in the world as pure and rapturous as the fear and love of a child for their mother.”\n\nShe giggled – actually *giggled*. “Now I know why so many cult leaders have their followers call them ‘father’!”\n\nI swallowed hard. “But where did all these children come from?” I asked, nervously. \"Who *were* they?\"\n\n“Oh, drunks, addicts, petty criminals – nobody who’ll be missed. Well, maybe one or two cops who came to investigate the disappearances and one nosy little imp from Child Protective Services, but it doesn’t matter: I’m a better sorceress than Mother ever was, and for someone of my talents, laws and violence are of no concern. Besides,” she added, “It’s not as if anyone can *kill* me, is it?”\n\n“And you’re just going to keep adding to the family? You’re just going to keep making random people immortal and de-aging them into children, just for the sake of feeling powerful and loved?”\n\n“Why not? With my powers, I can feed, house, clothe, and entertain hundreds of them without paying a cent, maybe even thousands. And if I don’t, well… they can’t die either, so…”\n\nThat impish giggle again.\n\nRhea paused and glanced at one of the younger children. “Paul?” she called, pushing a cooler towards him. “Could you put this up in the nursery?”\n\nThe kid who had once been Rhea’s father took the cooler with some difficulty: like quite a few of the kids, he was dressed as a pirate, and something behind his eyepatch seemed to be hurting him; he kept scratching and worrying at it.\n\nIt wasn’t until he shuffled into the nursery and opened the cooler that I realized why:\n\nInside was a baby mobile, but thankfully, this one didn’t have fingers hanging from it.\n\nUnfortunately…\n\n*It was looking back at me.*\n\nFive newly extracted eyeballs hung from the mobile by the optic nerves, taken from five kids now dressed up as pirates.\n\nI was at my limit by then and ready to make a run for it, but there was one other mystery that needed clearing up.\n\n“Where’s Valentina?” I asked, almost dreading the answer.\n\n “That’s the beauty of magic,” Rhea mused airily. “Once the subject’s immortal, I can control their age in any way I please.”\n\n*“Where is she?”*\n\nRhea didn’t answer. She just smirked and gently stroked her swollen belly, delighting in the faint kicks from within.\n\nAnd that was my cue to leave. I’d heard enough, and frankly, I didn’t want to hear Rhea's explanation. I didn't even want to imagine it, if only because my first visit to the Ambrosio house had left me with more than enough nightmares already.\n\nPaul reached out for me as I left, clutching pathetically at my jacket. Once upon a time, he’d been a hulking giant of a man, the terror of Rhea, Billy, and even me. Now, he was six years old and tiny for his age.\n\n“Kill me,” he whimpered. *“Kill me.”*\n\nI muttered a half-hearted apology and pulled away, running for the door without looking back.\n\nI wouldn’t have known how to help him even if I’d wanted to.\n\n\\---\n\nI wish my confession could’ve ended there.\n\nBut two days ago, I was gardening, trying to distract myself from my new neighbors, when I fumbled the pruning shears and accidentally sliced my left arm open.\n\nAnd before my eyes, the wound healed in a matter of seconds.\n\nI don’t know when Rhea cast the spell of immortality on me, but that’s the only thing that could explain it.\n\nShe said she owed me for freeing her. Did she repay her debt by making me immortal and leaving me to my freedom?\n\nOr is her idea of a reward a place in her family, preserved in eternal childhood, and any minute, I’ll shrink back down to ten years old?\n\nI don’t know, and I’m not sticking around to find out.\n\nI don’t need to worry about outliving relatives, forging IDs, what I’ll have to do to stay sane, or even if Rhea will follow me. I just need to get the hell out of here before the worst transpires.\n\nAll I leave behind is this confession of the role I played in unleashing a monster on the world, and a warning to avoid her at all costs if you see her.\n\nHopefully, the description will be enough to save you.\n\nIf not, well… there’s always room for another child in the family."
  },
  {
    "id": "1qu3bbz",
    "title": "I’m at war with my neighbor.",
    "author": "I_go_by_kk",
    "score": 1375,
    "url": "https://www.reddit.com/r/nosleep/comments/1qu3bbz/im_at_war_with_my_neighbor/",
    "created_utc": 1770057121.0,
    "num_comments": 38,
    "word_count": 1814,
    "body": "I live in Appalachia. I’ve always lived here. I’ve always been aware of the Haints that are my neighbors. They are aware of me too. \n\nWhen I was young, they used to terrify me. Eyes within the trees, whispers that sound like human voices mixed with the howling winds. When the birds go silent, you become acutely aware of the fact you are trespassing on your neighbors property and you are not welcome. Unlike people, Haints don’t use guns to defend themselves. \n\nAs I grew older, I grew a deep appreciation for them. This has been their home much longer than it has been mine. The Appalachian mountains are older than we can dream of, older than bones and even the sea. When you’re quiet and still, you can speak to the bones. The ground itself talks in a voice with no sound, communicating to your soul, not your conscious mind. \n\nWhen I first bought my own property with my husband, I made it clear to the Haints I was going to inhabit this property as it was my own. I gave them gifts of milk and sugar, woven baskets and carved charms set with the intentions and phrases my Mamaw taught, passed down from the ten generations my family had lived here. Then I set my wards. Nails taken from the corner boards of my house salted and blessed with my own blood. My husband isn’t from here originally so he thought it was a bit of an extreme response, but he didn’t protest. He declined my offers to add him to the wards. I wasn’t pleased with that. I’d no intention of forcing him though. \n\nHe didn’t believe my stories for the first year. It wasn’t until the things in our house would go missing only to be shortly returned after I served up honey milk to the Haint living with us that he started to believe. He never confirmed it aloud but the change in his disposition was clear. He began to fear the things in the woods. \n\nI told him time and time again there was no fear to be had as long as we respected them the same they respected us. Yet he still refused to be out past sundown. We no longer hosted bonfires or watched the fireflies after the trout bellied sky sank beneath the horizon. I understood the fear he held. The paralysis of realizing you are being watched cautiously by things beyond your comprehension. The apex predator is aware you are stepping on its territory, and it may pounce at any moment. \n\nIt wasn’t until the screams started that I became nervous as well. I’d heard the screams before, almost woman-like, yet oddly inhuman. It had been many years since I’d felt the dread they inspired, the need to flee. My husband froze, still as a rabbit on its haunches, waiting to see what the hound will do. I guided his arm inside and locked the door, salting the windows and door. I was confident in my wards, but that did not mean I was somehow stronger than whatever this was. As far as I knew, the wards could be completely useless. The Haints run by their own rules. \n\nThe words of my father from childhood stuck in my head. “That ain’t how a woman screams. Go inside.” He said it with such a serious face, as if he was warning me, not just keeping me away from a fox or a mountain lion. When we heard the deer screaming in agony two days later, his eyes darkened and he turned his back to the woods with resolve. He kept the shotgun by the door for a month after that. Something I was now doing too. \n\nWe lived that way for six months. This Haint, unwilling to live amicably with me like so many others, terrorized my husband the most. He woke up screaming most nights, some night terror breaking his mind slowly but surely. I was beginning to grow angry. I had made good faith offerings, burnt meat in a fire just outside my bounds, honey bread and homemade meeds, yet the Haint accepted none of it. All was spoiled and rotten by morning, a rude rejection and a statement to me. It only stoked the flames in my own soul. This was my home just as it was the Haints and I would not allow it to terrorize my loved one. \n\nIt began killing my chickens. That was when I decided it was war. I responded in earnest, upping my wards tenfold, saying nightly prayers, calling upon the friendly neighbors for aid. I did not like calling upon them. It always came at a cost. I was growing more rapidly aware of the fact that if I did not, this Haint would kill us. It was not content to only feed off the discomfort, it craved the taste of flesh. My chickens were not a satisfactory substitute. \n\nI saw it for the first time three years into us living here. It stood at the edge of my wards, careful not to step over them, yet seemingly testing the bounds. Its appearance is difficult to describe but I will do my best. \n\nDeer are prey animals. Their eyes are set on the side of their heads to give them near complete 360 degree vision. Their legs are made for running and hold immense ability to spring into jumps over creek beds or brush as they escape hunters. This beast did not hold those features. \n\nIts eyes were front set, pitch black with absolutely no glint as the porch light hit them. It stood taller at the shoulder than a normal deer, nearly as tall as the willow it towered near. Its mouth was wrong, slitted and barely masking the shape of sharpened teeth. It moved its head like a cat, cocked its head to the side like a dog, chittered like a fox, stepped like a mountain lion. What I found most uncanny, were its legs. They were not the slender, graceful legs of a deer. They were muscular. The legs of a predator, not prey. It pawed the ground with a ferocity that spoke to its power, one I did not want to cross. The antlers upon its head were sharper than nature intended, the shedded velvet coated with dried blood. I suppose this could’ve meant it sheds its antlers like a normal deer, but deep in my bones I knew they were attached to its skull like horns. \n\nI did something then that many would consider stupid. My husband was deep asleep, tired after a days work and exhausted from the ongoing torment. So, as quietly as I could, I slipped out the back door and walked to it. \n\nIt seemed surprised I had chosen this route. It took several steps back, cautiously watching my hands as if I were going to pull a revolver and silver bullets from my pockets. I did not. I held the leftover pork from that nights meal. I placed it upon the ground and pushed it with a branch across the ward lines. It regarded me with interest, unsure of what my motive was. For the first time, it bowed its head and ate. I took it as a sign of truce, at least in that moment. \n\nI spoke to it. Introduced myself, my lineage, introduced it to the bones of my kin who now walk the deep earth of the mountain, same as the Haints. I asked it as simply as possible, “What do you seek out of this?” Its head shifted and clicked, the teeth in its mouth showing as if it was grinning. \n\n“I want him.” The words took me aback. My husband. The outsider who had done no conceivable harm to anything here, who had been respectful as I’d told him to be, who’d followed every rule. \n\n“Why?” I did not bother to hide the shock or animosity in my voice. \n\n“How well do you truly know the man you have bound yourself to? How much do you know of his history, of the path his kin have passed to him? How confident are you that man is a good one? You will find me when you decide. That is, if it is not too late.” The voice that spoke to me did not come from vocal chords. It traveled up my spine, the voice of the grave dirt beneath my feet seeking revenge of ages. It regarded me one final time before its shadowy form sank into the darkest part of the tree line. \n\nI chewed on its words for several days. Told myself that it was meaning to make me paranoid, distrustful of my husband. If that was the intent, it was working. I could not hope to view him the same way. I watched his every move and reconsidered everything he’d told me. I watched as he snapped at me over small things, something I’d once blamed on the Haint tormenting us. I re-examined the ways he drank, unable to sleep or feel much without it. I considered the way he chopped wood as if it had done something to him, an intense anger just underneath the surface. I listened to the words he spoke in his sleep, realizing they were not words in response to a Haint, but someone from his past. I began to wonder if the Haint was his reckoning. \n\nI spent a month pondering what to do. I sat by my ward lines night after night, waiting for the Haint to speak to me once again. It never came. I could hear it, feel it just beyond the capabilities of my sight, even felt as if I made eye contact with it a few times. \n\nHe’s starting to become paranoid of me as well. I feel his eyes upon me when my back is turned. I see the way his knuckles go white as he grasps knives at dinner time. I see the way his jaw tightens when I speak. I’m beginning to wonder if I’ve been fighting the wrong war. If the isolation I once considered sanctuary will become my grave. \n\nI broke my ward last night. It was on pure impulse. My Mamaw would scold me if she could see the way I went about it. Dug it up under the cover of night and felt the cold wash of the surrounding neighbors overtake me. I heard the sounds of the stag chittering with that fox-like voice. Then I went to bed. I do not know how long I have until this war ends. I do not know which side I am on. All I know is I clutch my protection necklace much more tightly and I no longer sleep at night. I watch and whisper to the Haints I call my neighbors."
  }
]